[{"Name":"Polly and Pirate Pete","Start":"11:30","End":"12:15","Location":"Children’s Village","Group":"Enter Edem","Image":"pirate","GroupImage":null,"url":"https://www.enteredem.co.uk/","Description":"Meet Polly and Pirate Pete, trapped in a box, destined to play tricks, tell fortunes and bad jokes a plenty for eternity."},
{"Name":"Polly and Pirate Pete","Start":"13:30","End":"14:15","Location":"Children’s Village","Group":"Enter Edem","Image":"pirate","GroupImage":null,"url":"https://www.enteredem.co.uk/","Description":"Meet Polly and Pirate Pete, trapped in a box, destined to play tricks, tell fortunes and bad jokes a plenty for eternity."},
{"Name":"Thingamabob","Start":"10:00","End":"11:00","Location":"NotKnown","Group":"PanGottic","Image":"thingamabob","GroupImage":null,"url":"","Description":"With an internationally renowned blend of circus, invention and humour, PanGottic brings to life a giant ball slinging, self exploding piece of handcrafted gadgetry, inspired by the famous Rube Goldberg machines and Heath Robinson contraptions.  Be part of the mayhem as our intrepid inventor risks nerf wracking failure to bring you one perfect chain reaction… with a little help from his little assistant."},
{"Name":"The Allotment","Start":"15:00","End":"17:00","Location":"NotKnown","Group":"Plunge Boom","Image":"plungeboom","GroupImage":null,"url":"","Description":"The Vegetable Nannies invite you into their Allotment to befriend, feed and comfort the baby fruits and vegetables.  Meet Barbara the downhill-racing watermelon, Jessica, the Sweet-Potato beauty queen and many more!"},
{"Name":"Circus Skills Workshop","Start":"11:00","End":"16:00","Location":"Children’s Village","Group":"Circus Box","Image":"","GroupImage":null,"url":"","Description":"All day circus school where you can try your hand, or foot, at learning some of the tricks of the trade : unicycling, diabolo, plate spinning and so much more.  Children under 8 to be accompanied at all times."},
{"Name":"Van Dunk Brothers/Wannabee TV","Start":"13:30","End":"14:30","Location":"NotKnown","Group":"Bread and Butter","Image":"wannabetv","GroupImage":null,"url":"","Description":"The award winning Bread and Butter Theatre Company (voted 'Britain’s Hardest Working Small Business') was established in 1997 by Garry Gifford as a one man, one pair of underpants outfit and has, over the years, grown into an innovative and professional company that has performed at such diverse venues as the Millennium Dome, Shanghai World EXPO, London 2012 Olympics and Batley market. After studying drama with Ant and Dec and doing some work in hit TV series 'Byker Grove', Garry turned his back on celebrity to conquer the world of street theatre. After all, who wants to be in a hot jungle in December when you can be dressed as a cracker in sub-zero temperatures? "},
{"Name":"B Boys","Start":"13:30","End":"14:30","Location":"NotKnown","Group":"Joy Magnet","Image":"joymagnet","GroupImage":null,"url":"","Description":"These big, bouncing, b-boy breakers and their beat blasting boom box are sure to bring out the funk in everyone. Heads will turn as they bounce along to their sound system in their massive high tops. This high-energy fun act might even teach you their secret handshake. "},
{"Name":"Austerity Party","Start":"13:30","End":"14:30","Location":"NotKnown","Group":"Swank","Image":"austerity","GroupImage":null,"url":"","Description":"Feeling low? Current events getting you down? Not to worry, Hope and Joy are here to bring you Austerity Party Time (APT), an up-cycled, fun filled party to lighten any troubled times. Swank's Hope and Joy are dressed in big, bright and beautiful costumes fashioned from bags for life and the fabric from broken umbrellas. Their recycled hostess trolley hides a portable PA and carries props that hint at austerity, such as a barrel of broken biscuits and packs of bread rolls. Dance to the irresistible party tunes coming from the trolley, play catch your daily bread and celebrate good times with Hope and Joy"},
{"Name":"Damsels in Distress","Start":"13:30","End":"14:30","Location":"NotKnown","Group":"Swank","Image":"swank","GroupImage":null,"url":"","Description":"You’ve got your handsome prince – you couldn’t spare him could you?’ From the dark days of yore come ‘Lady Lust-a-Lot’ and ‘Lady Longing-for-Love’. Borne on the backs of ‘Eric and Ernie’ their delightfully drippy dragons, these ‘bootiful’ Westcountry damsels with their black teeth, spots and long gnarly hair are on a constant futile crusade to find their knights in shining armour and other little princes and princesses along the way"},
{"Name":"The Crow House","Start":"13:30","End":"14:30","Location":"NotKnown","Group":"Circo Rum Ba Ba","Image":"crowhouse","GroupImage":null,"url":"","Description":"A derelict house appears in the middle of the street. The windows are shattered and a keep out sign bars the front door. A furious bird has taken up residency in the chimney and squawks territoriality when anyone comes near the house. One by one three very different characters arrive through the audience and try to take over the house. A battle of wills and skills ensues with ducking and diving, wheeling and dealing and ingenious plans evolving as each person tries to gain a room inside.  Little by little in a choreographed frenzy of acrobatics, silks trapeze, hat juggling and circus slap stick they begin to accept each other and work to create a home, together, within the battered house. The only remaining problem ... the furious bird in the chimney."},
{"Name":"The Great Fiasco","Start":"10:00","End":"10:40","Location":"NotKnown","Group":"Markmark Productions","Image":"mmfiasco","GroupImage":null,"url":"http://www.markmarkproductions.co.uk/","Description":"The worlds most amazing performance implosion!  \nRonaldono is the true master of delusion creating an incredible debacle of dance, magic, comedy and theatre.  It is the very last performance of an act; a duo which has been touring the halls, piers, seaside theatres and clubs for far, far too long.  As the act falls apart so does their relationship in hilarious fashion.  This blend of cabaret, circus, street theatre and clowning is an uproarious celebration of early 70’s entertainment.  A cabaret act that is packed full of physical jokes and tricks.  They don’t all go according to plan but the audience laughs along at their terrible attempt to put it right."},
{"Name":"HMS Punafore","Start":"10:00","End":"10:40","Location":"NotKnown","Group":"Markmark Productions","Image":"mmpunafore","GroupImage":null,"url":"http://www.markmarkproductions.co.uk/","Description":"This Victorian masterpiece has been beautifully butchered and blatantly blended and is now a prancing, promenading, maritime, musical comedy.  The boat and its crew are trying to perform Gilbert and Sullivan’s HMS Pinafore but it doesn’t quite go according to plan.  A seafaring spectacle that sings and dances its way around festivals.  A case of high Cs on the high seas.\n. This show was created for Portsmouth’s Trafalgar Celebrations and has since been performed at many international nautical events."},
{"Name":"Drunk Monkey","Start":"11:30","End":"12:00","Location":"Church Square","Group":"Monkey Doesn't Dance","Image":"monkey.png","GroupImage":null,"url":"","Description":"The monkey languishes in his bucket and ponders the state of the world.  It is quite depressing.  There needs to be enough text here to make this interesting so that people will want to visit.  I am unsure whether anyone will come and see drunk monkey."},
{"Name":"Not the Flying Tortoise Show","Start":"9:30","End":"10:00","Location":"Children’s Village","Group":"Dr Palfi","Image":"","GroupImage":null,"url":"","Description":"Dr Palfi and Minnie’s Not the Flying Tortoise Show is so dynamic it requires absolutely no tortoises whatsoever.  Arts Fresco’s favourite consultant laughologist makes his annual trip to the town."},
{"Name":"Dafft(t) and Narcissus Show","Start":"10:30","End":"11:00","Location":"Around Town","Group":"Dr Palfi","Image":"","GroupImage":null,"url":"","Description":"Dr Palfi and his banana camera phone wanders through the festival aided by his uncaring Care Worker, Nurse Narcissus, spreading hilarity in their wake."}]
