
[{"Name":"Pirate Pete and Peggy","Start":"9:30","End":"10:00","Location":"Church Square","Group":"Enter Edem","Image":"https://www.enteredem.co.uk/wp-content/uploads/2017/03/Piratezoltar.jpg","GroupImage":"https://www.enteredem.co.uk/wp-content/uploads/2017/08/enteredemnewweblogo17.png","url":"https://www.enteredem.co.uk/","Description":"Meet Polly and Pirate Pete, trapped in a box, destined to play tricks, tell fortunes and bad jokes a plenty for eternity. Georgette the dead, will entertain you with her table of trinkets and her puppet crustacean companion. Towering peg leg pirates, Billybob Jones and Tilly the Terrible can spy wide across the port but have no luck with finding treasure. Play pirates vs privateers with a feisty duo, join a team and blast the cannon ball between the ships! Juggling Jill and Jim Lad will show off their skills in throwing and catching swords and guns! This swashbuckling gang is not to be missed, if you’re lucky they may teach you a trick or two!."},
{"Name":"Markmark","Start":"10:00","End":"10:40","Location":"Square","Group":"Markmark Productions","Image":"http://www.markmarkproductions.co.uk/images/food_police.jpg","GroupImage":"","url":"http://www.markmarkproductions.co.uk/","Description":"The Frying Squad.  These pompous public servants patrol and police your festival or event promoting health, safety and umbrage wherever they go!"},
{"Name":"Thingamabob","Start":"10:00","End":"10:30","Location":"Church Square","Group":"Matt Pang","Image":"https://mattpangcouk.files.wordpress.com/2016/09/pang-on.jpg?w=700&h=501","GroupImage":"","url":"","Description":"With an internationally renowned blend of circus, invention and humour, PanGottic brings to life a giant ball slinging, self exploding piece of handcrafted gadgetry, inspired by the famous Rube Goldberg machines and Heath Robinson contraptions. Be part of the mayhem as our intrepid inventor risks nerve wracking failure to bring you one perfect chain reaction… with a little help from his little assistant."},
{"Name":"Worlds tallest Bubbleologist","Start":"10:30","End":"11:00","Location":"Church Square","Group":"Bubbleinc","Image":"https://cdn.shopify.com/s/files/1/0163/1782/products/Will_1_profile_pic_in_a_bubble_1024x1024.jpg?v=1556813396","GroupImage":"https://cdn.shopify.com/s/files/1/0163/1782/t/1/assets/logo.jpg?66","url":"https://www.bubbleinc.co.uk/products/worlds-tallest-bubbleologist","Description":"Tall Will is the tallest Bubbleologist in the whole world! He's 6'10 and is also a brilliant stilt walker!  With 10+ years experience of working with bubbles, he joined the Bubble Inc team as a bubble performer back in 2007. He is a very experienced and talented Bubbleologist with an amazing repertoire of bubble tricks - from giant bubbles to the tiniest bubbles in the world. Bubble sculptures, smoke bubbles, fire bubbles, bubbles inside bubbles, bubbles with his bare hands and tons more to delight and captivate every audience of any age"},
{"Name":"Drunk Monkey","Start":"11:30","End":"12:00","Location":"Church Square","Group":"Monkey Doesn't Dance","Image":"monkey.png","GroupImage":"","url":"","Description":"The monkey languishes in his bucket and ponders the state of the world.  It is quite depressing.  There needs to be enough text here to make this interesting so that people will want to visit.  I am unsure whether anyone will come and see drunk monkey."},
{"Name":"John Spinning Plates","Start":"9:30","End":"10:00","Location":"Square","Group":"Infonote Artists","Image":"","GroupImage":"","url":"","Description":"John attempts to spin a plate.  It is also quite depressing."},
{"Name":"John Spinning Plates","Start":"10:30","End":"11:00","Location":"Square","Group":"Infonote Artists","Image":"","GroupImage":"","url":"","Description":"John attempts to spin a plate.  It is also quite depressing."}]

