[{"earliest_start_utc":"05 Oct 2020 08:00:00","slug":"strategic-brand-management-mini-masterclass","venue_name":"Private","venue_city":"","latest_end_utc":"05 Oct 2020 12:30:00","earliest_start_local":"05 Oct 2020 09:00:00","url":"https:\/\/bcbf20.ticketleap.com\/strategic-brand-management-mini-masterclass\/dates\/Oct-05-2020_at_0900AM","venue_street":"","latest_start_local":"05 Oct 2020 09:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/6160b102-5c00-40da-b000-1c4950a2e88a\/hero.jpg","latitude":0,"latest_start_utc":"05 Oct 2020 08:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/6160b102-5c00-40da-b000-1c4950a2e88a\/full.jpg","name":"Strategic Brand Management Mini-MasterClass ONLINE","id":"81b51afc-dc9d-11ea-919f-22000a3fd8f5","html_description":"<p><strong>Who it’s for:<\/strong> This session is aimed at those responsible for brand management at a mid to senior level, this could be on a brand or marketing team or as a business owner.<\/p>\n<p><strong>Overview: <\/strong>The team from The Brand Strategy will guide you through some essential factors of strategic brand management, you will leave with new understanding and tools that you can use in your business straight away. This will be an interactive session.<\/p>\n<p><strong>Presenters:<\/strong> You will be guided through four areas led by Mark Smith, founder of The Brand Strategy and lecturer of Nottingham Business School, along with other members of the team including Ruth Sneddon, strategic copywriter; Joanna Finchen-Parsons, strategist and independent development editor; and Philippa Mwayi, Digital Content Planner.<\/p>\n<p><strong>Programme:<\/strong><br>Supercharge your week, with a raft of new skills and knowledge that you will take straight back to your brand team or business. Our plan is to ensure that half a day invested in your development on Monday morning will reap dividends across the rest of your week and beyond. <\/p>\n<p><strong>The masterclass consists of four separate sessions that can be booked separately, but work best as one programme together. Each part (session) will last 60 minutes.<\/strong><br><br><strong>PART 1:<\/strong> \"Eudæmonic Transformation\" - a new approach to brand decision making for long-term sustainable profit<br>With many businesses collapsing and struggling to stay afloat in the current crisis, the time has never been more poignant to think about sustainable decision making in business. Yet with so much of the interface with the customer based around short-term return  on investment deliverables, it is easy to be distracted by vanity measures rather than long-term sustainable profit delivery. <br><br>Attendees will have a tool to begin to think strategically about business decisions and recognise the warning flags to identify with quick-win opportunities. <br><br><strong>PART 2:<\/strong> \"Choose your words carefully” - crafting a credible purpose statement<br>Understanding and clearly articulating your business purpose can have deep implications for why, how and what you deliver - and whether your customers and colleagues believe in you. In this workshop, discover how to use the power of words to capture the spirit of your business in a clear, credible and inspiring way.<\/p>\n<p>Attendees will learn how to craft a motivating purpose statement and have a first attempt at writing it.<br><br><strong>PART 3:<\/strong> “Knowing Your Customer” - identifying the Optimum Segment<br>Too often businesses are marketing to the wrong people, meaning advertising pounds are wasted and customers are left dissatisfied unnecessarily. This session will cover the fundamentals of segmentation, targeting and positioning.<\/p>\n<p>Attendees will leave with tools they can immediately apply to their own businesses to improve efficiencies.<\/p>\n<p><strong>PART 4:<\/strong>  “Identifying Customer Moments to Unlock Value” - improve the customer experience with a commercial lens<br>Every element of the customer experience holds opportunity to add or lose value - both for the business and for the customer’s experience and perception of the brand. This session will cover identification of these ‘moments’ and the importance of attributing both customer value and business value to each moment, then prioritising each.<\/p>\n<p>Attendees will leave with the understanding of the detail of customer experience brought to life with case studies such as how a simple 50p door wedge could create £2m additional revenue for their business!<\/p>\n<p><strong>Who are The Brand Strategy: <\/strong>Midlands based agency The Brand Strategy exist to create long-term sustainable brand turnaround that adds value both to your business and to consumers' lives. They are driven by ensuring brands not only survive, but thrive by creating Eudæmonic Transformation for brands to develop brand and customer experience. <\/p>","longitude":0,"latest_end_local":"05 Oct 2020 13:30:00","earliest_end_local":"05 Oct 2020 13:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"05 Oct 2020 12:30:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Creative Industries"}]},{"name":"Date","options":[{"name":"05\/10\/20"}]}],"description":""},{"earliest_start_utc":"05 Oct 2020 08:30:00","slug":"microsoft-office-365-do-you-like-getting-your-moneys-worth","venue_name":"West Midlands House Limited","venue_city":"Willenhall","latest_end_utc":"05 Oct 2020 11:00:00","earliest_start_local":"05 Oct 2020 09:30:00","url":"https:\/\/bcbf20.ticketleap.com\/microsoft-office-365-do-you-like-getting-your-moneys-worth\/dates\/Oct-05-2020_at_0930AM","venue_street":"Gipsy Lane","latest_start_local":"05 Oct 2020 09:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/2b27cb51-cbcb-4c5b-9e9e-18fc74c10da1\/hero.jpg","latitude":0,"latest_start_utc":"05 Oct 2020 08:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/2b27cb51-cbcb-4c5b-9e9e-18fc74c10da1\/full.jpg","name":"Microsoft Office 365. Do you like getting your money's worth?","id":"bd82322a-5a2c-11ea-b7ab-22000b6902b0","html_description":"<p>Question: Do you use Office 365 for Business and If so, which applications are you using? If your answer is limited to Word, Excel, PowerPoint and Outlook then this is an event you DO NOT want to miss. Learn how to unlock the modern ways of working in O365, no matter where you are or what device you are on. Learn how to easily access, share edit files in real time with co-author capability. Share your opinion and personality in one to one messages by sending gifs and emojis or to a wider audience with group chat and instantly go from group chat to a video conference with just the touch of a button. Unleash the power of your Team to share and manage content in a collaborative SharePoint workspace.<\/p>\n<p>Become smarter and more productive using Office 365 and all at no extra cost.  <\/p>\n<p>The event is aimed at any individual or organisation of any size, where Office 365 for Business is their primary software application.<\/p>\n<p>Across any sector where the workers require collaboration tools to communicate with colleagues across the world and share information in real time.<\/p>\n<p>Where an organisation has rolled out Office 365 without a formal training plan and therefore the workforce is unaware of the new features it contains.<\/p>\n<p>What will attendees gain? <\/p>\n<p>The time saving and cost benefits are significant in several areas across the business:<\/p>\n<p>1. Workers can manage and organise their own documents more efficiently between co-workers and reduce duplication.<\/p>\n<p>2. Reduce the need and cost of third party cloud file storage to share documents within the organisation.<\/p>\n<p>3. Reduce the need and cost of third party online meeting software across the organisation.<\/p>\n<p>4. Reduce travel time and enviromental imptact to meetings using simple chat, group chat and video conferencing capabilities of O365.<\/p>\n<p>5. Improve the capability and ease to work from home and outside the office using cloud file storage<\/p>\n<p>6. Unify the way that the organisation collaborates and shares information.<\/p>\n<p>Agenda: <\/p>\n<p>Presentation and live demonstrations by Timothy Price<\/p>\n<p>09:30-10:00 Registration and networking<\/p>\n<p>10:00-10:15 Introductions and agenda<\/p>\n<p>10:15-10:45 Managing and sharing personal documents in OneDrive for Business<\/p>\n<p>10:45-11:15 Team collaboration, document management and sharing in a SharePoint workspace<\/p>\n<p>11:15-11:45 Chat, Group Chat and Video Conference using Microsoft Teams<\/p>\n<p>11:45-12:00 Q&amp;A and Session Close<\/p>\n<p>We would encourage delegates to bring their own laptops to join in the demonstrations.<\/p>\n<p>Speaker: <\/p>\n<p>Timothy Price <\/p>\n<p>MCT (Microsoft Certified Trainer)<\/p>\n<p>MOS (Microsoft Office Specialist)<\/p>\n<p>MOSE (Microsoft Office Specialist Expert)<\/p>\n<p>MOSM (Microsoft Office Specialist Master)<\/p>","longitude":0,"latest_end_local":"05 Oct 2020 12:00:00","earliest_end_local":"05 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"05 Oct 2020 11:00:00","venue_postal_code":"WV13 2HA","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"},{"name":"Walsall"}]},{"name":"Sector","options":[{"name":"Education & Skills"},{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"05\/10\/20"}]}],"description":""},{"earliest_start_utc":"05 Oct 2020 08:30:00","slug":"the-true-cost-of-poor-management","venue_name":"Wolverhampton Technology Centre","venue_city":"Wolverhampton","latest_end_utc":"05 Oct 2020 11:30:00","earliest_start_local":"05 Oct 2020 09:30:00","url":"https:\/\/bcbf20.ticketleap.com\/the-true-cost-of-poor-management\/dates\/Oct-05-2020_at_0930AM","venue_street":"Wolverhampton Science Park","latest_start_local":"05 Oct 2020 09:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/751212f9-119c-45f2-9961-6c3529357efc\/hero.jpg","latitude":0,"latest_start_utc":"05 Oct 2020 08:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/751212f9-119c-45f2-9961-6c3529357efc\/full.jpg","name":"The true cost of poor management","id":"e94d20c6-6a95-11ea-80c0-22000bb24b5c","html_description":"<p>Gallup (2016) found that one of the most important decisions companies make is who they hire as managers. But is management something we value and prioritise as a business? We put so much effort into our systems and processes. We innovate to try to be the very best at what we do. We invest in training to mitigate the cost of underperforming employees. But what about the manager? Do we appreciate just how critical they are to our business? Do we know how much damage a poor manager can do?  This workshop is designed to help you understand the true cost of poor management within you organisation. It also provides practical advice on what you can do to address this.  <\/p>\n<p>The event is aimed at SMEs, HR Mangers, newly appointed managers and team leaders. <\/p>\n<p>Attendees will be able to learn about why it is important to take care of their staff, ensure that managers are trained, and of the importance of creating a healthy working environment. This will include managing mental health in the workplace and its effects on team dynamics, how to create a productive and healthy working environment and how managers can gain the necessary skills. <\/p>\n<p>This 3 hour session includes business simulations and case studies to consider the following:<\/p>\n<ul><li>Where do managers come from?<\/li><li>What makes a good manager?<\/li><li>How does a poor manager impact on the business?<\/li><li>How to create a good manager?<\/li><li>How to fix a bad manager?<\/li><\/ul>\n<p>Speaker: Mike Ryan, Tutor, Gecko Programmes<\/p>","longitude":0,"latest_end_local":"05 Oct 2020 12:30:00","earliest_end_local":"05 Oct 2020 12:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"05 Oct 2020 11:30:00","venue_postal_code":"WV10 9RU","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Wolverhampton"},{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"05\/10\/20"}]}],"description":""},{"earliest_start_utc":"05 Oct 2020 09:00:00","slug":"get-more-clients-now","venue_name":"Private","venue_city":"","latest_end_utc":"05 Oct 2020 11:00:00","earliest_start_local":"05 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/get-more-clients-now\/dates\/Oct-05-2020_at_1000AM","venue_street":"","latest_start_local":"05 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/f999da22-3406-48f0-b5b3-ed359c7e970c\/hero.jpg","latitude":0,"latest_start_utc":"05 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/f999da22-3406-48f0-b5b3-ed359c7e970c\/full.jpg","name":"Get More Clients NOW! ONLINE","id":"fb3aa844-5fa5-11ea-8aca-22000b6d80dc","html_description":"<p>If you're looking for more high-quality leads, this online workshop is for you! What we’ve learned about most business owners is this: You are BRILLIANT at what you do - ✳️ You've done the work ✳️ You've got the experience ✳️ You love what you do ✳️ And you really care about getting the right results for your clients. You’ve had a handful of great referrals that turned into ideal clients but can’t seem to get any real traction going from your network. And you're fed-up with buying data and trying all this online marketing stuff, which never quite turns up the goods either.<\/p>\n<p>If any of this sounds familiar to you, we want to give you something different.<\/p>\n<p>In our ‘Get More Clients NOW’ workshop, we will share with you our Top Tips for getting more business by referral, that you can go away and IMPLEMENT straight away.<\/p>\n<p>You see, we've been through the same pain trying to attract the right clients, just like you.<\/p>\n<p>So we know EXACTLY how you feel.....<\/p>\n<p>And it's about time that we had a change and start talking about the real facts and not a load of spammy mumbo-jumbo.<\/p>\n<p>Instead, we’ll show you the techniques you need to nurture your existing network to provide all the referrals you need to only work with your ideal clients...<\/p>\n<p>Our technique (if you can call it that!) is simple.<\/p>\n<p>It's the old-fashioned relationship building that long-lasting (and high earning) salespeople have always used...<\/p>\n<p>...just implemented with your existing relationships in a very specific way to attract your ideal clients.<\/p>\n<p>So, if you want more of the right clients, at the right time, at the right price, then you need to be at this workshop!<\/p>\n<p>This workshop is for you if you have to generate sales.<\/p>\n<p>You may be the business owner or the person responsible for bringing in the business.<\/p>\n<p>Either way - you will be frustrated with your networking and understand that referrals are the most cost effective way to grow your business.<\/p>\n<p>You want to know how you can implement a structure and a strategy around getting consistent and proactive referrals for your business.  <\/p>\n<p>What you will discover at this workshop:-<\/p>\n<p>- The One Thing you must do to get more referrals<\/p>\n<p>- How to hook people in to want to know more about what you do<\/p>\n<p>- A vastly under used tool to generate business<\/p>\n<p>- A little known trick for making you stand out to your network<\/p>\n<p>- How to work out the number of referrals you could be getting<\/p>\n<p>You will leave this workshop with actionable information that you can implement in to your business, immediately.<\/p>\n<p><strong>Speakers: <\/strong><\/p>\n<p>Dawn Owen<\/p>\n<p>Jackie Casey<\/p>","longitude":0,"latest_end_local":"05 Oct 2020 12:00:00","earliest_end_local":"05 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"05 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"05\/10\/20"}]}],"description":""},{"earliest_start_utc":"05 Oct 2020 09:00:00","slug":"mental-fitness-for-local-business-in-a-post-covid-world","venue_name":"Private","venue_city":"","latest_end_utc":"05 Oct 2020 10:30:00","earliest_start_local":"05 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/mental-fitness-for-local-business-in-a-post-covid-world\/dates\/Oct-05-2020_at_1000AM","venue_street":"","latest_start_local":"05 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/d8d758f5-5d5f-4ecc-991a-7d0191b83e94\/hero.jpg","latitude":0,"latest_start_utc":"05 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/d8d758f5-5d5f-4ecc-991a-7d0191b83e94\/full.jpg","name":"Mental Fitness for Local Business People in a Post-Covid World ONLINE","id":"3dbd9f50-e629-11ea-83e9-22000b0208fb","html_description":"<p><em>Understand the root causes for your fear\/stress\/anxiety and learn how to command your mind to remain clear-headed and focus. I'm a Stourbridge-based personal development coaching practice. For more info<\/em>,<em> visit <a href=\"https:\/\/lunarcoaching.com\" rel=\"nofollow\" target=\"_blank\">lunarcoaching.com<\/a><\/em><\/p>\n<p>In 2020 very few of us in business here in the Black Country have avoided being negatively affected in some way by the coronavirus pandemic. For many, there has been a lot of extra stress added upon the everyday challenges of running our business.<br><br>So, looking to the future, in this workshop I'm going to explain what mental fitness is and how it can help you come into a post-COVID world better and more able to meet challenges both in business and life with a positive mindset.<br><br>Just like your body needs certain activities to stay fit and capable, your mind requires intentional training and guidance to stay strong and orientated. A key aspect to cultivate better mental fitness as a local business person is to understand how you self-sabotage: the behavioural patterns that are causing you fear\/stress\/anxiety and stopping you from performing better or achieving more. <br><br>In this workshop, I’ll be talking about 3 common self-sabotaging personas, how they are affecting your business operations, practical measures you can take to avoid the negative effects as well as commanding your mind to remain clear-headed and focused.<br><br><strong>This workshop includes:<\/strong><br>• An overview of mental fitness: what is it and how it’s relevant to all of us;<br>• Identifying 3 common “Saboteurs” (self-sabotaging behavior pattern): the Judge, the Avoider (procrastinator) and the Hyper-Vigilant (constant worrier).<br>• Introducing practical measures to self-command.  <\/p>\n<p>The event is suitable for business owners, team leaders, startup solopreneur\/entrepreneur, or anyone that is interested in gaining better adaptability and positive mindset for their career or business growth. <\/p>\n<p><strong>Attendees will gain the following information:<\/strong><br><br>1. An understanding of what Mental Fitness is.<br>2. A new sense of self-awareness: knowing which parts of them that are not helping themselves to succeed, to be fulfilled and happy. <br>3. An insight into building self-command brain muscles: small steps to take in any business circumstance\/ situation to train their mind to stop chattering and stay focus.<\/p>\n<p><strong>Agenda: <\/strong><\/p>\n<p>10:00 – 10:15am: Opening, Zoom check-in, simple reminders on Zoom etiquette, a brief introduction of myself and then a breathing exercise to get all attendees grounded and focus.  <\/p>\n<p>10:15 – 10:30am: An overview of Mental Fitness: what is it, how is it measured, how it is relevant to us and our business performance?  <\/p>\n<p>10:30 – 11:00am: There are 10 universal self-sabotaging behavior patterns, aka the Saboteurs. They are the root causes of our negative emotions, i.e. stress, anxiety, self-doubt, frustration, shame, guilt and so on. To improve our Mental Fitness, we must first understand which of these patterns are “running our shows”.  <\/p>\n<p>For this workshop, I’ll be talking about 3 common Saboteurs that we can all resonate with: in the Judge (harsh critic), the Avoider(procrastinator) and the Hyper-Vigilant (constant worrier). Specifically, I’ll identify their characteristics, feelings, thoughts and impacts.  <\/p>\n<p>Attendees will be given a brief moment to reflect on how they’re being affected by these 3 saboteurs.  <\/p>\n<p>11:00 -11:15am: I’ll introduce 3 practical exercises to build our self-command brain muscles. These exercises can be done with our eyes open, in any business situations and will immediately activate the brain areas that calms ourselves down. We’ll be refocused and able to make better decisions.     <\/p>\n<p>11:15 – 11:30 Special offer and opportunity for BCBS attendees. Q&amp;A. Closing. <\/p>","longitude":0,"latest_end_local":"05 Oct 2020 11:30:00","earliest_end_local":"05 Oct 2020 11:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"05 Oct 2020 10:30:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"05\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"05 Oct 2020 09:00:00","slug":"the-digital-revolution","venue_name":"Private","venue_city":"","latest_end_utc":"05 Oct 2020 10:00:00","earliest_start_local":"05 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/the-digital-revolution\/dates\/Oct-05-2020_at_1000AM","venue_street":"","latest_start_local":"05 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/c15c497e-5155-4dc0-ae47-ffd0182a9c55\/hero.jpg","latitude":0,"latest_start_utc":"05 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/c15c497e-5155-4dc0-ae47-ffd0182a9c55\/full.jpg","name":"The Digital Revolution ONLINE","id":"0aa4aa34-dd53-11ea-847d-22000aa9f9b2","html_description":"<p>Hear about CityFibre’s ambitious plans to make the Midlands one of the best digitally connected regions in the UK.  Full fibre is currently available to less than 15 per cent of premises across the UK.  It is revered as the best in connectivity for its speed, near unlimited bandwidth and reliability.  By using fibre optic cables for every stage of the connection from the customer’s home or business to the internet, users will be offered a significantly superior and more reliable broadband service, capable of Gigabit speeds (1,000 Mbps).<\/p>\n<p>But it is not just individuals and business who will benefit, the installation of the network will give a significant boost to the local economy, as well as providing job opportunities for local people.  <\/p>\n<p>The event is suitable to businesses from all sectors and all sizes. The technology is already being rolled out across many public sector networks, but SMEs and micro business can also benefit.  <\/p>\n<p>Attendees will learn about the different types of infrastructure currently available. They will hear about the benefits of full fibre, which can give them a competitive edge.<\/p>\n<p>Attendees will hear of CityFibre's roll out plans for the technology and which towns and cities are set to benefit from it.  <\/p>\n<p>Speaker: <\/p>\n<p>Bashir Ahmed MBA - CityFibre's City Manager for Wolverhampton<\/p>","longitude":0,"latest_end_local":"05 Oct 2020 11:00:00","earliest_end_local":"05 Oct 2020 11:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"05 Oct 2020 10:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Property & Construction"}]},{"name":"Date","options":[{"name":"05\/10\/20"}]}],"description":""},{"earliest_start_utc":"05 Oct 2020 13:00:00","slug":"intellectual-property-issues-for-smes","venue_name":"Private","venue_city":"","latest_end_utc":"05 Oct 2020 13:30:00","earliest_start_local":"05 Oct 2020 14:00:00","url":"https:\/\/bcbf20.ticketleap.com\/intellectual-property-issues-for-smes\/dates\/Oct-05-2020_at_0200PM","venue_street":"","latest_start_local":"05 Oct 2020 14:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/d47451d3-8b54-4cca-9264-009b906d4bbf\/hero.jpg","latitude":0,"latest_start_utc":"05 Oct 2020 13:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/d47451d3-8b54-4cca-9264-009b906d4bbf\/full.jpg","name":"Intellectual property issues for SMEs ONLINE","id":"e5795cac-6519-11ea-a169-22000b0c01fa","html_description":"<p>Knowing your intellectual property rights and how to enforce them for the protection of your business is something all business owners and managers should be aware of. The event is aimed at owner-managers, managers, directors and all those with a responsibility for running an SME. This seminar, facilitated by experts from Higgs &amp; Sons’ Litigation team, highlights what SMEs can do to protect their intellectual property and steps to be taken when an infringement has taken place.<\/p>","longitude":0,"latest_end_local":"05 Oct 2020 14:30:00","earliest_end_local":"05 Oct 2020 14:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"05 Oct 2020 13:30:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."},{"name":"Property & Construction"}]},{"name":"Date","options":[{"name":"05\/10\/20"}]}],"description":""},{"earliest_start_utc":"05 Oct 2020 14:00:00","slug":"reducing-the-cost-of-workplace-conflict","venue_name":"Private","venue_city":"","latest_end_utc":"05 Oct 2020 15:00:00","earliest_start_local":"05 Oct 2020 15:00:00","url":"https:\/\/bcbf20.ticketleap.com\/reducing-the-cost-of-workplace-conflict\/dates\/Oct-05-2020_at_0300PM","venue_street":"","latest_start_local":"05 Oct 2020 15:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/f19571f0-eec4-4eff-9800-1f7c654ec944\/hero.jpg","latitude":0,"latest_start_utc":"05 Oct 2020 14:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/f19571f0-eec4-4eff-9800-1f7c654ec944\/full.jpg","name":"Reducing the cost of workplace conflict ONLINE","id":"ad47e2a6-6463-11ea-b4c2-22000a41f88b","html_description":"<p>Workplace conflict can be costly to your business. This seminar explores how to reduce the risks of conflict and overcome problems before they escalate. This interactive seminar will benefit anyone who runs or manages a business and employs staff, or has responsibility for HR in the workplace. HR Directors, managers etc. Head of Higgs &amp; Sons’ Employment team, Tim Jones who is an accredited and qualified commercial, civil, employment and workplace mediator, will facilitate this 45 minute interactive seminar which will look at good communication in the workplace and how mediation can help to overcome problems before they escalate to possible claims or tribunals.<\/p>\n<p>Speaker: Tim Jones, Head of Employment, Higgs &amp; Sons<\/p>","longitude":0,"latest_end_local":"05 Oct 2020 16:00:00","earliest_end_local":"05 Oct 2020 16:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"05 Oct 2020 15:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"05\/10\/20"}]}],"description":""},{"earliest_start_utc":"06 Oct 2020 07:00:00","slug":"apprenticeships-2020---government-incentives-standards-the-end-","venue_name":"Private","venue_city":"","latest_end_utc":"06 Oct 2020 09:00:00","earliest_start_local":"06 Oct 2020 08:00:00","url":"https:\/\/bcbf20.ticketleap.com\/apprenticeships-2020---government-incentives-standards-the-end-\/dates\/Oct-06-2020_at_0800AM","venue_street":"","latest_start_local":"06 Oct 2020 08:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/7e0939d1-43b5-465a-9a22-f0567aef92ec\/hero.jpg","latitude":0,"latest_start_utc":"06 Oct 2020 07:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/7e0939d1-43b5-465a-9a22-f0567aef92ec\/full.jpg","name":"Apprenticeships 2020 - Government Incentives, Standards, the End Point Assessment and the Digital Portal ONLINE","id":"17d883e6-dd5e-11ea-847d-22000aa9f9b2","html_description":"<p>Apprenticeships 2020 and the Government Incentives.  What are the government incentives for taking on an apprentice and are you making the most of them?  What are Apprenticeship Standards? How do they differ from Frameworks?  What is the End Point Assessment?  What does it mean for the employer?  How to use the Digital Apprenticeship Service. The event will encourage recruitment in the area by recruiting new apprentices to help post-COVID recovery.  Also businesses could use apprenticeships to upskill existing staff.  Apprentices can bring new and current skills to businesses to help with growth and development<\/p>\n<p>The event is aimed at any business or organisation that has an apprentice or is considering taking on an apprentice. Introduce employers to Apprenticeships and the incentives available.<\/p>\n<p>Attendees will gain knowledge around the latest funding support available for apprenticeships, how to register and use the digital portal, what apprenticeship standards are, and which ones are available for 2020\/21 via the College.  <\/p>\n<p>Attendees will also gain:<\/p>\n<ul><li>An insight of Apprenticeships 2020.<\/li><li>What the new standards are.<\/li><li>What it means to the employer.<\/li><li>What the End Point Assessment is and what it means for the business and the Apprentice.<\/li><li>What the Digital Apprenticeship Service is and how to use it.<\/li><\/ul>","longitude":0,"latest_end_local":"06 Oct 2020 10:00:00","earliest_end_local":"06 Oct 2020 10:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"06 Oct 2020 09:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Education & Skills"}]},{"name":"Date","options":[{"name":"06\/10\/20"}]}],"description":""},{"earliest_start_utc":"06 Oct 2020 08:30:00","slug":"boosting-black-country-business---6-steps-to-great-business-res","venue_name":"Private","venue_city":"","latest_end_utc":"06 Oct 2020 11:30:00","earliest_start_local":"06 Oct 2020 09:30:00","url":"https:\/\/bcbf20.ticketleap.com\/boosting-black-country-business---6-steps-to-great-business-res\/dates\/Oct-06-2020_at_0930AM","venue_street":"","latest_start_local":"06 Oct 2020 09:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/9f6a44ab-3779-4d50-84f2-92810ca59188\/hero.jpg","latitude":0,"latest_start_utc":"06 Oct 2020 08:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/9f6a44ab-3779-4d50-84f2-92810ca59188\/full.jpg","name":"Boosting Black Country Business - 6 Steps to Great Business Results ONLINE","id":"72cb7c3e-6ab0-11ea-8c4d-22000ab736e2","html_description":"<p>Join Business Growth and Finance Specialist Rob Young, for a FREE online seminar that could change the trajectory of your business and results in the achievement of your business and personal goals. The ‘6 Steps to Great Business Results’ seminar is for Entrepreneurs, Business Owners, CEOs, Directors and Managers who are ready to make exhilarating changes in their business and personal lives. <\/p>\n<p><strong>What will I learn?<\/strong><\/p>\n<p>‘6 Steps P.R.O.F.I.T. System’ is a proven framework that will transform your business into a commercial, profitable enterprise that works without you.<\/p>\n<p><strong>During this seminar you will learn how to:<\/strong><\/p>\n<p>• Grow your business<br>• Increase your profits with predictable cashflows<br>• Create more time for yourself<br>• Achieve your business and personal goals<\/p>\n<p><strong>Agenda: <\/strong><\/p>\n<p>09.30am - Seminar presentation starts<br>12:00pm – Q&amp;A<br>12.30pm – Event Finishes<\/p>\n<p><strong>Speaker: <\/strong><\/p>\n<p>Business Growth and Finance Specialist Rob Young will present the seminar, sharing with you the experience and real-life lessons he has learnt through working with and developing leading Midlands business over the last 20 years.<\/p>","longitude":0,"latest_end_local":"06 Oct 2020 12:30:00","earliest_end_local":"06 Oct 2020 12:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"06 Oct 2020 11:30:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"06\/10\/20"}]}],"description":""},{"earliest_start_utc":"06 Oct 2020 09:00:00","slug":"bringing-your-business-alive-online-understanding-vr","venue_name":"Private","venue_city":"","latest_end_utc":"06 Oct 2020 11:00:00","earliest_start_local":"06 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/bringing-your-business-alive-online-understanding-vr\/dates\/Oct-06-2020_at_1000AM","venue_street":"","latest_start_local":"06 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/936fb80f-fbb1-42f3-bc61-fd1e6644df5b\/hero.jpg","latitude":0,"latest_start_utc":"06 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/936fb80f-fbb1-42f3-bc61-fd1e6644df5b\/full.jpg","name":"Bringing your business alive online: Understanding VR ONLINE","id":"e0582e00-e60c-11ea-aa73-22000aed191b","html_description":"<p>Are you already a massive fan of the promotional and experiential opportunities of virtual reality in the business and leisure tourism sectors? Or are you ambivalent about it... wanting to prioritise the lived experience of bringing people together for networking and memorable family times? Perhaps there's a way to do both? Come and find out what the region's leading tourism and hospitality companies are doing and see if there's more you could do to bring your business alive online or in real life...<\/p>\n<p>This event is aimed at leisure and business tourism, retail and hospitality business CEOs, COOs, Marketing and Comms Directors and practitioners.  <\/p>\n<p><strong>What will attendees gain?<\/strong><\/p>\n<ul><li>How VR is being used currently in the tourism and hospitality sectors, and how they might apply this to their business.<\/li><li>Opportunity to consider the benefits and any disadvantages of VR for the industry, and what returns investment might bring.<\/li><\/ul>\n<p><strong>Agenda: <\/strong><\/p>\n<p>10.00am Welcome Becky Frall WMGC<\/p>\n<p>10.05am Compere Joel Blake<\/p>\n<p>10.15am Demonstration of VR as an immersive attraction, to complement a traditional leisure attraction and in an exhibition setting.<\/p>\n<p>11.00am Introduction to panel and facilitated discussion - Kevin Blair<\/p>\n<p>Kevin Blair <br>Fiona Latter – Creative Scale Up programme<br>Tim Luft - Create Central Innovation Lead <\/p>\n<p>Nick Pinks - CEO of Covatic <\/p>\n<p>11.30am Facilitated questions from the audience via the chat - Joel Blake<\/p>\n<p>11.50am Overall thanks and goodbye - Becky Frall<\/p>\n<p><strong>Speakers: <\/strong><\/p>\n<p>Kevin Blair<\/p>\n<p>Becky Frall - WMGC<\/p>\n<p>Fiona Latter - Creative Scale Up Programme WMCA<\/p>\n<p>Tim Luft - Create Central<\/p>\n<p>Nick Pinks - CEO of Covatic <\/p>\n<p>Joel Blake (compere)<\/p>","longitude":0,"latest_end_local":"06 Oct 2020 12:00:00","earliest_end_local":"06 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"06 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Retail, Tourism & Hospitality"}]},{"name":"Date","options":[{"name":"06\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"06 Oct 2020 09:00:00","slug":"business-engagement--energy--resource-efficiency-projects","venue_name":"Private","venue_city":"","latest_end_utc":"06 Oct 2020 11:30:00","earliest_start_local":"06 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/business-engagement--energy--resource-efficiency-projects\/dates\/Oct-06-2020_at_1000AM","venue_street":"","latest_start_local":"06 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/1532bef8-f9cd-4f12-8dc4-af550692e35a\/hero.jpg","latitude":0,"latest_start_utc":"06 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/1532bef8-f9cd-4f12-8dc4-af550692e35a\/full.jpg","name":"Business Engagement – Energy & Resource Efficiency Projects ONLINE","id":"c388902c-5ede-11ea-a83c-22000aec09a6","html_description":"<p>Projects – EnTRESS, Construction Futures Research Centre and BECCI<\/p>\n<p>The event is aimed at:<\/p>\n<p>• Manufacturers looking to minimise costs.<\/p>\n<p>• Developers and innovators of low carbon products and processes looking to validate their products.<\/p>\n<p>• Built Environment Industry professionals &amp; Architects, Energy Advisors, Quantity and Building Surveyors looking to see recent development.  <\/p>\n<p>What will attendees gain?<\/p>\n<p>Keeping up to date with three successful ERDF projects – EnTRESS, Construction Futures Research Centre and BECCI<\/p>\n<p><strong>Speakers: <\/strong><\/p>\n<p>Andrew Stott – EnTRESS<\/p>\n<p>Paul Davies – Construction Futures Research Centre<\/p>\n<p> <\/p>","longitude":0,"latest_end_local":"06 Oct 2020 12:30:00","earliest_end_local":"06 Oct 2020 12:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"06 Oct 2020 11:30:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Property & Construction"}]},{"name":"Date","options":[{"name":"06\/10\/20"}]}],"description":""},{"earliest_start_utc":"06 Oct 2020 09:00:00","slug":"how-to-get-into-uk-rail-session1","venue_name":"Private","venue_city":"","latest_end_utc":"06 Oct 2020 11:00:00","earliest_start_local":"06 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/how-to-get-into-uk-rail-session1\/dates\/Oct-06-2020_at_1000AM","venue_street":"","latest_start_local":"06 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/3d0727eb-051a-4ba2-b886-23a0ce23e061\/hero.jpg","latitude":0,"latest_start_utc":"06 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/3d0727eb-051a-4ba2-b886-23a0ce23e061\/full.jpg","name":"How to Get into UK Rail - Session 1 ONLINE","id":"a9948280-de21-11ea-b614-22000a930ba7","html_description":"<p>How to Supply into the UK Rail Sector.  The event is aimed at manufacturing and engineering SMEs seeking to diversify into the Rail Sector. Suitable for Senior Management, New Product Development professionals and those with responsibility for generating new sales.  Attendees will gain a valuable insight into the structure of the UK Rail Sector, individual consultation by UK Rail specialists and the opportunity to receive 12 hours worth of European funded assistance to help develop your very own Get into Rail Strategy (subject to SME eligibility must be located within Black Country).<\/p>\n<p>Agenda: <\/p>\n<p>The event will be one hour in duration consisting of:<\/p>\n<ul><li>30 Minute Power Point Presentation on Get into Rail<\/li><li>15 Minute Networking and Discussions<\/li><li>1-2-1 Consultations for SMEs and support to sign upnfor Digi Rail support<\/li><\/ul>\n<p>Speakers: <\/p>\n<p>Rachel Eade - Rail Supply Chain Specialist for BCRRE<\/p>\n<p>Alec Gilham - Organisational Development BCRRE<\/p>","longitude":0,"latest_end_local":"06 Oct 2020 12:00:00","earliest_end_local":"06 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"06 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Advanced Manufacturing"}]},{"name":"Date","options":[{"name":"06\/10\/20"}]}],"description":""},{"earliest_start_utc":"06 Oct 2020 09:30:00","slug":"digitising-disability-with-disabled-creative-entrepreneur-and-s","venue_name":"Private","venue_city":"","latest_end_utc":"06 Oct 2020 11:00:00","earliest_start_local":"06 Oct 2020 10:30:00","url":"https:\/\/bcbf20.ticketleap.com\/digitising-disability-with-disabled-creative-entrepreneur-and-s\/dates\/Oct-06-2020_at_1030AM","venue_street":"","latest_start_local":"06 Oct 2020 10:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/39d4468f-569a-4382-b688-1511c15d0d1b\/hero.jpg","latitude":0,"latest_start_utc":"06 Oct 2020 09:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/39d4468f-569a-4382-b688-1511c15d0d1b\/full.jpg","name":"Digitising Disability with disabled creative entrepreneur and speaker Zoe Partington ONLINE","id":"3fa6b364-de2d-11ea-b7fb-22000b3f048f","html_description":"<p>Creative Black Country is hosting a virtual event with Zoe Partington who’ll be discussing digitising things differently in a changing world that includes disabled and Deaf people and ensures inclusion is a key value in digital planning. <br><br>Organisations that make their websites and apps accessible increase their potential market or audience by up to 20%, increase user satisfaction and usability to the general public, decrease ongoing maintenance costs and help themselves meet the requirements of current and future legislation.  <br><br>The event will contain a presentation by Zoe Partington and there’s an opportunity to ask questions in a Q&amp;A. You can email questions in advance of the event to info@creativeblackcountry.co.uk.<\/p>\n<p>This event is for individuals, groups or organisations who wish to make their digital content accessible to disabled and Deaf people. <\/p>\n<p>The event will provide insight, tips and information on how to make any digital engagement with audiences and customers also accessible to disabled and Deaf people.<br><br>It will highlight how inclusion and accessibility can be fun; innovative and improve all your communication, meetings and engagement strategies and customers. <br><br>Participants attending the event will be given access to Zoe’s mini digital booklet 'Deconstructing Disability in a digital age'.<\/p>\n<p>Agenda:<\/p>\n<p>10.20am - 10.30am: Attendees joining Zoom<\/p>\n<p>10.30am - 10.40am: Welcome and introductions<\/p>\n<p>10.40am - 11.20am: presentation by Zoe Partington<\/p>\n<p>11.20am - 12pm: Q&amp;A<\/p>\n<p>Speaker: <\/p>\n<p>Zoe Partington<\/p>","longitude":0,"latest_end_local":"06 Oct 2020 12:00:00","earliest_end_local":"06 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"06 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Creative Industries"}]},{"name":"Date","options":[{"name":"06\/10\/20"}]}],"description":""},{"earliest_start_utc":"06 Oct 2020 09:30:00","slug":"turning-the-black-country-green","venue_name":"Private","venue_city":"","latest_end_utc":"06 Oct 2020 11:00:00","earliest_start_local":"06 Oct 2020 10:30:00","url":"https:\/\/bcbf20.ticketleap.com\/turning-the-black-country-green\/dates\/Oct-06-2020_at_1030AM","venue_street":"","latest_start_local":"06 Oct 2020 10:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/153faaf6-ab13-4584-97ff-a5562b21eb77\/hero.jpg","latitude":0,"latest_start_utc":"06 Oct 2020 09:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/153faaf6-ab13-4584-97ff-a5562b21eb77\/full.jpg","name":"Turning The Black Country Green - Session 1 ONLINE","id":"dfc02daa-62de-11ea-a83c-22000aec09a6","html_description":"<p>Turning The Black Country Green - Taking the region through it's second industrial revolution. Attendees will learn how they can transform their business, become Carbon Neutral certified to PAS2060 and increase their profits. Businesses can gain the competitive advantage by differentiating themselves from their competition by demonstrating their commitment to the environment by reducing Carbon, whilst significantly benefiting their bottom line.  Reduce energy costs by up to 40% &amp; energy consumption by up to 20%, begin to measure, reduce and report their Carbon Footprint on their journey to become Carbon Zero ahead of the UK backstop of 2050.<\/p>\n<p>Carbon Zero Energy, Decentralised Energy, Energy Optimisation, Carbon Measuring &amp; Reporting, Carbon Offsetting.  <\/p>\n<p>The event is aimed at Financial Directors, Managing Directors, Operation Directors\/Managers, Facility Managers of businesses of all sizes and from all industries. It specifically benefits medium to large manufacturers that consume large amounts of energy and produce large amounts of carbon.  <\/p>\n<p>Attendees will be learn how they can measure, reduce, report their carbon footprint on their journey to becoming Carbon Neutral certified to PAS2060. We will demonstrated how decentralised energy can reduce costs by up to 40% and the integration of our energy management systems can reduce consumption by up to 20%. Attendees can integrate a bespoke Carbon dashboard that will measure and report their journey of becoming Zero Carbon. We provide bespoke holistic solutions that can be provided with zero CAPEX requirement and assists businesses in future proofing their business.<\/p>\n<p><strong>AGENDA<\/strong> <strong>- 6th October<\/strong><\/p>\n<p>10.30am - 11.00am – 2050 Net Zero &amp; Carbon Neutral WHAT, WHY, WHEN &amp; HOW<\/p>\n<p>11.00am – 11.30 am – Decentralisation, Optimisation, Decarbonisation <\/p>\n<p>11.30am – 11.50am – PAS2060 Carbon Neutral, Carbon Offsetting, UK School Tree planting program.<\/p>\n<p>11.50am – 12.00pm – Questions<\/p>\n<p><strong>SPEAKERS<\/strong><\/p>\n<p>Envirogy Power Ltd<\/p>\n<p>CBN Expert Ltd<\/p>\n<p> <\/p>","longitude":0,"latest_end_local":"06 Oct 2020 12:00:00","earliest_end_local":"06 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"06 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Advanced Manufacturing"},{"name":"Professional Services"}]},{"name":"Date","options":[{"name":"06\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"06 Oct 2020 10:00:00","slug":"shrink-the-covid19-distress---now-permanently-with-no-disclosur","venue_name":"Private","venue_city":"","latest_end_utc":"06 Oct 2020 10:50:00","earliest_start_local":"06 Oct 2020 11:00:00","url":"https:\/\/bcbf20.ticketleap.com\/shrink-the-covid19-distress---now-permanently-with-no-disclosur\/dates\/Oct-06-2020_at_1100AM","venue_street":"","latest_start_local":"06 Oct 2020 11:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/cb47a2a0-156a-45ac-933a-bfc4fb760aaa\/hero.jpg","latitude":0,"latest_start_utc":"06 Oct 2020 10:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/cb47a2a0-156a-45ac-933a-bfc4fb760aaa\/full.jpg","name":"Shrink the COVID19 Distress - Now, permanently, with no disclosure required ONLINE","id":"13d99a64-dca0-11ea-81b3-22000a65d5a2","html_description":"<p>So I can immediately &amp; permanently reduce the emotional distress my people are feeling? - and learn how to do this for anything else? Yes!  SEE THE VIDEO LINK<a href=\"https:\/\/www.youtube.com\/watch?v=T9KBF3WdKSY\" rel=\"nofollow\" target=\"_blank\"> here <\/a>to see more.  You can be as sceptical as you like - just try it and it will work. See the genuine feedback from my previous session about how everyone recommends this webinar and all reduced their distress level in less than 30 minutes.<\/p>\n<p>I don't need to know what it is that is distressing you. It is completely content free. I will take you through the technique and you will feel the benefit.<\/p>\n<p>Limited places.<\/p>\n<p>Hope to see you there and help you reduce anxiety over something bothering you at this time.  <\/p>\n<p>The event is aimed at anyone concerned about their business, job, family, health can receive immediate and permanent relief from emotional distress.  You will immediately feel lighter, get relief from any kind of emotional distress and learn how to apply the technique at any point in the future.<\/p>\n<p>Speaker: <\/p>\n<p>Mark Wingfield<\/p>","longitude":0,"latest_end_local":"06 Oct 2020 11:50:00","earliest_end_local":"06 Oct 2020 11:50:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"06 Oct 2020 10:50:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Professional Services"}]},{"name":"Date","options":[{"name":"06\/10\/20"}]}],"description":""},{"earliest_start_utc":"06 Oct 2020 11:00:00","slug":"talent-management-what-efforts-are-you-making-to-win-the-war-fo","venue_name":"Private","venue_city":"","latest_end_utc":"06 Oct 2020 12:30:00","earliest_start_local":"06 Oct 2020 12:00:00","url":"https:\/\/bcbf20.ticketleap.com\/talent-management-what-efforts-are-you-making-to-win-the-war-fo\/dates\/Oct-06-2020_at_1200PM","venue_street":"","latest_start_local":"06 Oct 2020 12:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/f08ff358-bf32-4f3c-9291-01312d2cfe08\/hero.jpg","latitude":0,"latest_start_utc":"06 Oct 2020 11:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/f08ff358-bf32-4f3c-9291-01312d2cfe08\/full.jpg","name":"Rethink Talent Management - Being the conscious leader in your talent management strategy? ONLINE","id":"c55c8122-5fa3-11ea-adb8-22000b1e8239","html_description":"<p>This interactive and engaging workshop will challenge the traditional ways of working, educate on the changing landscape of the labour market, your understanding on talent management and how more than ever before conscious leadership can win the war on Talent. Learn proven strategies to support your business, on the power of attracting, recruiting, engaging and developing your top Talent to enable more productivity and growth of the individual which will collectively expand your business and the region as a whole.<\/p>\n<p>This event is aimed at Executive Directors such as Managing Directors, Finance Directors,  Human Resource Directors or Leaders\/Management of any growing SME business who wants to step change their business and wants to attract, recruit, engage and retain their Talent. This would suit businesses with turnover from £1m to £50m. <\/p>\n<p>Attendees will gain vital knowledge on:<\/p>\n<p>1. What is Talent Management and the changing landscape of Talent?<\/p>\n<p>2. How to be a Conscious Leader?<\/p>\n<p>3. Understand what motivates individuals and why developing and meeting the needs of individuals is significant for your business growth.<\/p>\n<p>4. Range of strategies to win the war on talent management, which can be implemented immediately within your business. <\/p>\n<p>By learning and discovering conscious leadership skills combine with having a talent management strategy in this current climate is paramount for a more engaged and motivated workforce. This will empower individuals to grow individually and collectively increased well-being for all, improved production and growth for the business and the wider community.<\/p>\n<p><strong>Agenda: <\/strong><\/p>\n<p>12:00 – 12:15 - Introduction and agenda<\/p>\n<p>Seminar and activities<\/p>\n<p>Questions<\/p>\n<p>13:30 - Close<\/p>\n<p><strong>Speaker: <\/strong><\/p>\n<p>Devya Athwal, Director Athwal Resourcing Limited, Qualified ACMA Accountant, NLP Master Coach and Master Practitioner of NLP<\/p>\n<p> <\/p>","longitude":0,"latest_end_local":"06 Oct 2020 13:30:00","earliest_end_local":"06 Oct 2020 13:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"06 Oct 2020 12:30:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Education & Skills"}]},{"name":"Date","options":[{"name":"06\/10\/20"}]}],"description":""},{"earliest_start_utc":"06 Oct 2020 13:00:00","slug":"protecting-your-business-against-employees-who-leave-to-join-a-","venue_name":"Private","venue_city":"","latest_end_utc":"06 Oct 2020 15:00:00","earliest_start_local":"06 Oct 2020 14:00:00","url":"https:\/\/bcbf20.ticketleap.com\/protecting-your-business-against-employees-who-leave-to-join-a-\/dates\/Oct-06-2020_at_0200PM","venue_street":"","latest_start_local":"06 Oct 2020 14:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/432ff3b3-5d55-4759-8695-067ef2043ddb\/hero.jpg","latitude":0,"latest_start_utc":"06 Oct 2020 13:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/432ff3b3-5d55-4759-8695-067ef2043ddb\/full.jpg","name":"Protecting your business against employees who leave to join a competitor ONLINE","id":"4d923132-62e6-11ea-adb8-22000b1e8239","html_description":"<p>When employees depart, they take with them a great deal of knowledge in terms of customer contacts, technology and strategic business information accumulated during their time within your business. How can business owners and managers ensure that a departing employee is not going to unfairly use the assets they have gained to the advantage of a competitor?  In this seminar, which is aimed at owner-managers, senior managers, directors and all those with a responsibility for running a business, experts from Higgs &amp; Sons’ Dispute Resolution team will look at the various options open to employers in order to protect their business.  From ‘non-compete' to ‘non-poaching' clauses, all aspects of restrictive covenants will be explored in order to identify the right solution for your business.<\/p>","longitude":0,"latest_end_local":"06 Oct 2020 16:00:00","earliest_end_local":"06 Oct 2020 16:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"06 Oct 2020 15:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"06\/10\/20"}]}],"description":""},{"earliest_start_utc":"07 Oct 2020 07:30:00","slug":"repowering-the-black-country","venue_name":"Private","venue_city":"","latest_end_utc":"07 Oct 2020 10:00:00","earliest_start_local":"07 Oct 2020 08:30:00","url":"https:\/\/bcbf20.ticketleap.com\/repowering-the-black-country\/dates\/Oct-07-2020_at_0830AM","venue_street":"","latest_start_local":"07 Oct 2020 08:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/3db9e436-63f0-4ad6-9046-4d519ea12424\/hero.jpg","latitude":0,"latest_start_utc":"07 Oct 2020 07:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/3db9e436-63f0-4ad6-9046-4d519ea12424\/full.jpg","name":"Repowering the Black Country – Economic Opportunities from Accelerated Decarbonisation ONLINE","id":"b5750a36-57d8-11ea-8943-22000a41b279","html_description":"<p>The Black Country has been identified by the government as one of seven strategic industrial<br>clusters in the UK eligible to receive funding to accelerate the transition to net zero while creating<br>local jobs and economic opportunities.<\/p>\n<p>This event will summarise the provisional plans to secure and deploy this funding, inviting<br>feedback and input from the Black Country business community, particularly manufacturers and<br>energy-intense businesses.<\/p>\n<p>The Black Country Industrial Cluster is responsible for carbon emissions of 1.4 M t CO 2 a year.<br>The initial study for Repowering the Black Country has identified that this figure will rise to<br>2.3MtCO 2 by 2030 if we do nothing, but that a focused regional effort could reduce emissions to<br>net zero while creating an additional 20,000 jobs and adding almost £5bn to Black Country GVA.<br>The key elements of the plan are likely to include a new approach to energy infrastructure<br>development, focused on zero-carbon industrial parks; and much wider access to energy<br>efficiency programmes designed specifically to meet the needs of Black Country businesses. We<br>are also exploring tailored financial mechanisms and more collaborative working relationships<br>with energy network providers as well as a proactive approach to securing inward investment in<br>the region.<\/p>\n<p>The target audience is owners and senior managers of manufacturing and other energy intense<br>businesses (e.g. hotels, leisure centres) across the Black Country. It is also relevant to landlords<br>and owners of industrial estates and business parks.<\/p>\n<p>Agenda: <\/p>\n<p>08:30 - 08:40 Welcome &amp; Introduction - Hosts \/ Matthew Rhodes<\/p>\n<p>08:40 - 09:00 Repowering the Black Country - Roadmap Project Overview - Matthew Rhodes, BCLEP<\/p>\n<p>09:00 - 09:20 What a zero carbon generation hub might look like - Mark Johnson, Kew Technologies<\/p>\n<p>09:20 - 09:40 Low carbon process optimisation strategy for the manufacturing sector - Nersi Salehi, Pro Enviro<\/p>\n<p>09:40 - 10:00 New government support for industrial energy efficiency - the Industrial Energy Transformation Fund  - Lily Tozer, BEIS <\/p>\n<p>10:00 - 10:30 Q&amp;A and Panel Discussion - Speakers chaired by Matthew Rhodes<\/p>\n<p>10:30 - 11:00 Networking &amp; Close<\/p>\n<p>Speakers: <\/p>\n<p>Matthew Rhodes - BCLEP<\/p>\n<p>Mark Johnson - Kew Technologies<\/p>\n<p>Nersi Salehi - Pro Enviro<\/p>\n<p>Lily Tozer - BEIS<\/p>","longitude":0,"latest_end_local":"07 Oct 2020 11:00:00","earliest_end_local":"07 Oct 2020 11:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"07 Oct 2020 10:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Advanced Manufacturing"}]},{"name":"Date","options":[{"name":"07\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"07 Oct 2020 07:30:00","slug":"what-is-disability-confident-and-how-can-it-help-your-business","venue_name":"Private","venue_city":"","latest_end_utc":"07 Oct 2020 09:30:00","earliest_start_local":"07 Oct 2020 08:30:00","url":"https:\/\/bcbf20.ticketleap.com\/what-is-disability-confident-and-how-can-it-help-your-business\/dates\/Oct-07-2020_at_0830AM","venue_street":"","latest_start_local":"07 Oct 2020 08:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/af825d0b-208b-41c8-bdaa-a00ed36970a3\/hero.jpg","latitude":0,"latest_start_utc":"07 Oct 2020 07:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/af825d0b-208b-41c8-bdaa-a00ed36970a3\/full.jpg","name":"What is Disability Confident and how can it help your business? ONLINE","id":"76cbd980-5a27-11ea-b88c-22000aec09a6","html_description":"<p>During this online event we will explain the Disability Confident scheme and highlight how it can help your business retain and recruit the right team of people for your business. We will explain the different levels and support options that are available for you to tap into. You will also hear from Employers and employees about their stories and what the support has meant to them.<\/p>\n<p>The Disability employment gap has remained stubbornly high in the UK with only 53.2% per cent of working-age disabled employees currently being in work in comparison with 81.8% per cent of the non-disabled working age population.  <\/p>\n<p>This event is aimed at people who would like to find out more about the Disability Confident scheme or becoming more inclusive but may not be so sure on how to take the first steps. We are targeting small to medium sized employers. This event is suitable for all sectors and is aimed at Directors, owners, line managers, HR and recruitment staff. There will be no judgement at this event and we are happy to support others on their Disability Confident journey.  <\/p>\n<p>Attendees will gain a knowledge of Disability Confident &amp; the Access to Work schemes and what it means, the opportunity to ask questions and hear examples of other organisation's experiences. There will also be ongoing support on offer for any organisation that wants to join the scheme.<\/p>\n<p><strong>Agenda<\/strong><\/p>\n<p>08:00 - Welcome and What is Disability Confident<\/p>\n<p>08:10 - Employer stories<\/p>\n<p>08:55 - Comfort Break<\/p>\n<p>09:05 - Adam Breeze, Sign Solutions. An Employees Story<\/p>\n<p>09:20 - Halesowen Bid and accessibility<\/p>\n<p>09:40 - Access to Work<\/p>\n<p>10:10 - Q&amp;A<\/p>\n<p>10:30 - Close<\/p>","longitude":0,"latest_end_local":"07 Oct 2020 10:30:00","earliest_end_local":"07 Oct 2020 10:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"07 Oct 2020 09:30:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"07\/10\/20"}]}],"description":""},{"earliest_start_utc":"07 Oct 2020 08:00:00","slug":"ensuring-your-premises-is-safe-for-staff","venue_name":"Private","venue_city":"","latest_end_utc":"07 Oct 2020 09:00:00","earliest_start_local":"07 Oct 2020 09:00:00","url":"https:\/\/bcbf20.ticketleap.com\/ensuring-your-premises-is-safe-for-staff\/dates\/Oct-07-2020_at_0900AM","venue_street":"","latest_start_local":"07 Oct 2020 09:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/8d84f0bf-245d-46f7-bdfa-21c954e858a3\/hero.jpg","latitude":0,"latest_start_utc":"07 Oct 2020 08:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/8d84f0bf-245d-46f7-bdfa-21c954e858a3\/full.jpg","name":"Ensuring Your Premises is Safe for Staff ONLINE","id":"6bed91fa-e138-11ea-bdd5-22000b0208fb","html_description":"<p>This event will focus on how firms across the Black Country can ensure that their premises are safe for members of staff, customers and visitors. With a focus on how Covid 19 has changed business practices, we will be inviting Regulatory Service teams from across the four Black Country Local Authorities to discuss how to Covid-proof a workplace with Black Country businesses. We will also be inviting the Health and Safety Executive as a guest speaker, as well as having business support teams from the various local authorities to answer any questions that businesses may have.  <\/p>\n<p>The world has changed, potentially irrevocably, over the last five months. What was considered normal business practice is now seen as unsafe and potentially life threatening to 'at risk' members of staff.<\/p>\n<p>It is crucial that all business owners, of all sizes and from all sectors, fully understand the role they play in ensuring the safety of their staff.<\/p>\n<p>That's why we think it is crucial, that as united Black Country, we ensure the safety of employees in the region.<\/p>\n<p>We will be calling on the Regulatory Services teams from all Black Country local authorities, as well as the Business Support teams and Public Health, to ensure that MDs, FDs and HR Departments understand what must be done, for their firm to operate in a 'post-lockdown' landscape.  <\/p>\n<p>We want to ensure that attendees can ask the necessary questions and seek the advice they need on making their premises safe.<\/p>\n<p>We will have experts in the room that can point to further support, answer the necessary questions and support businesses to make the necessary changes.<\/p>\n<p>Agenda: <\/p>\n<p>An hour long session:<\/p>\n<p>- Welcome &amp; Introductions<\/p>\n<p>- Short Contextual Introduction<\/p>\n<p>- Presentation from Regulatory Services<\/p>\n<p>- Presentation from Health &amp; Safety Executive<\/p>\n<p>- Questions from Delegates- AOB \/ Finish<\/p>","longitude":0,"latest_end_local":"07 Oct 2020 10:00:00","earliest_end_local":"07 Oct 2020 10:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"07 Oct 2020 09:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"07\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"07 Oct 2020 08:00:00","slug":"the-reduced-growth-planning-show---60-minutes-creat-ind","venue_name":"Private","venue_city":"","latest_end_utc":"07 Oct 2020 09:00:00","earliest_start_local":"07 Oct 2020 09:00:00","url":"https:\/\/bcbf20.ticketleap.com\/the-reduced-growth-planning-show---60-minutes-creat-ind\/dates\/Oct-07-2020_at_0900AM","venue_street":"","latest_start_local":"07 Oct 2020 09:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/3ae9d03c-e40c-43cf-ae27-001f99723eec\/hero.jpg","latitude":0,"latest_start_utc":"07 Oct 2020 08:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/3ae9d03c-e40c-43cf-ae27-001f99723eec\/full.jpg","name":"The Reduced Growth Planning Show - 60 minutes to a great Growth Plan - Creative Industries - ONLINE","id":"17c681b8-5a1a-11ea-a83c-22000aec09a6","html_description":"<p>Are you looking to grow your business, increase sales, improve market place penetration, introduce a new product or service or simply improve your bottom line then this fast paced, fun, and interactive introduction to growth planning will be perfect for you. Are you a Wolverhampton business in the creative and digital services sector, forward thinking, actively looking for growth or on the cusp of investing in your growing business.<\/p>\n<p>We will showcase the successes of companies who have implemented successful Growth Plans and secured financial support, and who were in the first cohort of the AIM for GOLD Programme.<\/p>\n<p>We will share with you how you could apply for a grant of up to £20,000 to help unlock your businesses growth potential, and where else you could get funding.<\/p>\n<p>You will meet some of the businesses who have already been awarded their funding, learn about the different elements of the programme, and be given the opportunity to register your interest in being part of cohort 3.  <\/p>\n<p>The event is aimed at owners and Directors of SMEs in the creative and digital sector.  SMEs in this sector are eligible for a free growth Planning workshop programme and for grant support to implement their Growth Plans.  <\/p>\n<p>Attendees will gain:<\/p>\n<ul><li>An understanding of the value of Growth PlanningnWhat makes a great Growth Plan - increase sales, secure new markets, and or develop new products and services.<\/li><li>Details of the AIM for GOLD Growth and Grant Programme.<\/li><li>Options to finance growth.<\/li><\/ul>\n<p>Agenda: <\/p>\n<p>9.00am - Start<\/p>\n<p>Growth Planning, the key elements - Glenn Watts<\/p>\n<p>Growth Planning, the value to a business - Stones Throw Media and Eighty 3 Creative<\/p>\n<p>Finance support and the AIM for GOLD Growth Planning Programme - Glenn Watts<\/p>\n<p>Q and A <\/p>\n<p>10.00am - Close  <\/p>\n<p>Speakers: <\/p>\n<p>Glenn Watts - Growth Specialist City of Wolverhampton Council<\/p>\n<p>Matt Weston Director Stones Throw Media<\/p>\n<p>Amie Whale Director Eighty 3 Creative<\/p>","longitude":0,"latest_end_local":"07 Oct 2020 10:00:00","earliest_end_local":"07 Oct 2020 10:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"07 Oct 2020 09:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Creative Industries"}]},{"name":"Date","options":[{"name":"07\/10\/20"}]}],"description":""},{"earliest_start_utc":"07 Oct 2020 08:30:00","slug":"are-your-ideas-and-brands-protected-demystifying-patents-and-tr","venue_name":"Private","venue_city":"","latest_end_utc":"07 Oct 2020 10:00:00","earliest_start_local":"07 Oct 2020 09:30:00","url":"https:\/\/bcbf20.ticketleap.com\/are-your-ideas-and-brands-protected-demystifying-patents-and-tr\/dates\/Oct-07-2020_at_0930AM","venue_street":"","latest_start_local":"07 Oct 2020 09:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/b34b08d6-c1f9-45b7-8574-c441905910c8\/hero.jpg","latitude":0,"latest_start_utc":"07 Oct 2020 08:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/b34b08d6-c1f9-45b7-8574-c441905910c8\/full.jpg","name":"Are your ideas and brands protected? Demystifying Patents and Trade Marks ONLINE","id":"d45652e0-5e1b-11ea-b88c-22000aec09a6","html_description":"<p>Possessing IP rights (patents, trade marks, copyright) is a source of competitive advantage and a reward for creativity. Protection of those rights is critical for your business and can mean the difference between success and failure. Your rights may be affected post Brexit. Forresters will provide clear guidance on these topics, using examples of client success stories.<\/p>\n<p>The event is aimed at business owners, manufacturers, marketing directors and managers, technical directors and managers, product designers, branding consultants, solicitors, law firms, accountants, educational sectors, all levels from all types of business. We will help attendees identify the many aspects of their business that can be protected (for example, their name and logo, designs, inventions, trade marks, creative works) to appreciate the value of those assets and to protect themselves from their competitors.  <\/p>\n<p>Attendees will learn about the different types of intellectual property (IP), identify what IP they have themselves (ALL businesses will have some form of IP) and, will appreciate the importance of protecting these valuable assets, particularly in a post-Brexit world  With clear and jargon-free advice, Forresters will explain the steps they need to take to get protection in place. <\/p>\n<p>Agenda: <\/p>\n<p>Presentation and Q&amp;A session<\/p>\n<p>Speaker: <\/p>\n<p>Emma Johnson, Partner<\/p>\n<p>Emma Johnson is a Partner at Forresters and has been with the firm for over 15 years. Emma is a UK and European patent and trade mark attorney and her work is focused on mechanical and electrical inventions, but covers a broad spectrum of technologies. Emma is able to offer an ‘all round’ service to clients. Emma lives near Wolverhampton and is a regular supporter of Black Country Events, for example the BCCoC Expo and Wolverhampton Business Forum networking events.<\/p>","longitude":0,"latest_end_local":"07 Oct 2020 11:00:00","earliest_end_local":"07 Oct 2020 11:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"07 Oct 2020 10:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Professional Services"}]},{"name":"Date","options":[{"name":"07\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"07 Oct 2020 09:00:00","slug":"the-mindfullness-advantage","venue_name":"Private","venue_city":"","latest_end_utc":"07 Oct 2020 10:10:00","earliest_start_local":"07 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/the-mindfullness-advantage\/dates\/Oct-07-2020_at_1000AM","venue_street":"","latest_start_local":"07 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/eecacb93-46e9-409f-936f-0fd038716208\/hero.jpg","latitude":0,"latest_start_utc":"07 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/eecacb93-46e9-409f-936f-0fd038716208\/full.jpg","name":"The Mindfullness Advantage ONLINE","id":"fa606380-cfff-11ea-ab6b-22000a10e25c","html_description":"<p>As we slowly navigate our way through the COVID-19 pandemic, our world and our working lives have changed substantially.  A move towards a ‘new normal’ comes with additional responsibilities and pressures for leaders.  So, how can you keep performing at your peak and avoid burnout during tough times?  The event is aimed at business leaders who want to find a better way to cope with the pressures of managing a team of people. <\/p>\n<p>What will attendees gain?  <\/p>\n<p>• Unlock your capabilities while minimising or eliminating stress<\/p>\n<p>• Get on top of overwhelm and anxiety<\/p>\n<p>• Unleash new levels of energy that you never thought possible<\/p>\n<p>• Release your inner fears and dissolve limiting beliefs<\/p>\n<p>• Discover and understand your master mind and the extraordinary powers it holds<\/p>\n<p>• Learn the daily habits to help you create your dream life<\/p>\n<p>Agenda: <\/p>\n<p>10 - 11am: Workshop<\/p>\n<p>11 - 11.10am - Q&amp;A<\/p>\n<p>Speaker: Karrie-Ann Fox<\/p>","longitude":0,"latest_end_local":"07 Oct 2020 11:10:00","earliest_end_local":"07 Oct 2020 11:10:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"07 Oct 2020 10:10:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"07\/10\/20"}]}],"description":""},{"earliest_start_utc":"07 Oct 2020 09:00:00","slug":"the-workplace---how-can-we-help-you-to-recruit-graduate-talent","venue_name":"Private","venue_city":"","latest_end_utc":"07 Oct 2020 10:00:00","earliest_start_local":"07 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/the-workplace---how-can-we-help-you-to-recruit-graduate-talent\/dates\/Oct-07-2020_at_1000AM","venue_street":"","latest_start_local":"07 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/63474068-0f3e-4d27-83c4-012e257812b7\/hero.jpg","latitude":0,"latest_start_utc":"07 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/63474068-0f3e-4d27-83c4-012e257812b7\/full.jpg","name":"The Workplace - how can we help you to recruit Graduate talent? ONLINE","id":"82c3f84a-dd61-11ea-bbd6-22000bc0c1de","html_description":"<p>An overview of the Workplace services. How we can support you in offering Micro Placements, Sandwich Placements and Graduate Employment. Learn how working with The Workplace team can help reduce your recruitment costs.  The event is aimed at employers in the region looking to expand\/recruit or to just work more closely with the University and its students. Learn more about how the team can support you with this.  Attendees will gain a full understanding of the services on offer.<\/p>\n<p><strong>Agenda: <\/strong><\/p>\n<p>10am - 10.20am: Presentation<\/p>\n<p>10.20am - 11am: Q&amp;A<\/p>\n<p><strong>Speakers: <\/strong><\/p>\n<p>Kam Atwal, Employer Liaison Co-ordinator<\/p>\n<p>Andrea Woolley Employer Liaison Officer<\/p>","longitude":0,"latest_end_local":"07 Oct 2020 11:00:00","earliest_end_local":"07 Oct 2020 11:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"07 Oct 2020 10:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"07\/10\/20"}]}],"description":""},{"earliest_start_utc":"07 Oct 2020 09:30:00","slug":"lets-create--funding-and-project-support-for-black-country-7o-am","venue_name":"Private","venue_city":"","latest_end_utc":"07 Oct 2020 11:00:00","earliest_start_local":"07 Oct 2020 10:30:00","url":"https:\/\/bcbf20.ticketleap.com\/lets-create--funding-and-project-support-for-black-country-7o-am\/dates\/Oct-07-2020_at_1030AM","venue_street":"","latest_start_local":"07 Oct 2020 10:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/c7fdee35-5531-4000-afd4-9f0a872c90ed\/hero.jpg","latitude":0,"latest_start_utc":"07 Oct 2020 09:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/c7fdee35-5531-4000-afd4-9f0a872c90ed\/full.jpg","name":"Let’s Create – Funding and Project Support for Black Country Creative Projects ONLINE","id":"f994a286-6f6f-11ea-a53e-22000b0c84ea","html_description":"<p>Let’s Create – Funding and Project Support for Black Country Creative Projects. An introduction into Arts Council England's Project Grants.<\/p>\n<p>Do you have an idea for a creative project but need some advice?<\/p>\n<p>This October, Creative Black Country is hosting a virtual event with Arts Council England, on how to apply for Arts Council Project Grants. <\/p>\n<p>The event will contain a presentation on applying for Project Grants from Arts Council England and the opportunity to ask questions to a Arts Council representative.  You can email questions in advance of the event to info@creativeblackcountry.co.uk        <\/p>\n<p>This event is for individuals, groups or organisations who are interested in finding out more about Arts Council's Project grants work and bringing creative work\/activity to the Black Country.  It's a good opportunity for Black Country creatives to meet with a representative from the Arts Council and connect with Creative Black Country. <\/p>\n<p>Attendees will be given valuable insight and advice into the application process for Arts Council Project grants.   <\/p>\n<p><strong>Agenda:<\/strong><\/p>\n<p>10.20am - 10.30am: attendees joining Zoom<br>10.30am - 10.40am: welcome and introduction to Creative Black Country<br>10.40am - 11.20am: presentation by Arts Council England representative<br>11.20am - 12pm: Q&amp;A<\/p>","longitude":0,"latest_end_local":"07 Oct 2020 12:00:00","earliest_end_local":"07 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"07 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Creative Industries"}]},{"name":"Date","options":[{"name":"07\/10\/20"}]}],"description":""},{"earliest_start_utc":"07 Oct 2020 11:00:00","slug":"creating-a-mentally-healthy-workplace","venue_name":"GTG Training","venue_city":"Willenhall, Wolverhampton","latest_end_utc":"07 Oct 2020 13:30:00","earliest_start_local":"07 Oct 2020 12:00:00","url":"https:\/\/bcbf20.ticketleap.com\/creating-a-mentally-healthy-workplace\/dates\/Oct-07-2020_at_1200PM","venue_street":"Bearing Drive","latest_start_local":"07 Oct 2020 12:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/ab21548f-30f8-4912-877b-e462d7494abf\/hero.jpg","latitude":0,"latest_start_utc":"07 Oct 2020 11:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/ab21548f-30f8-4912-877b-e462d7494abf\/full.jpg","name":"Creating a mentally healthy workplace","id":"bfba11ae-5f93-11ea-a83c-22000aec09a6","html_description":"<p>Our relaxed lunchtime event will provide local employers with the understanding and actions they need to proactively create a mentally healthy workplace using positive and measurable business benefits.<\/p>\n<p>Sandra Vaughan, Chief Executive of Dudley Mind, will talk through workplace mental health. Mental health problems affect every employer, regardless of size or sector.<\/p>\n<p>This event will provide delegates with an understanding of how they can create and use a framework to create a mentally healthy workplace. Mental health problems are the leading cause of sickness absence in the UK and affect every organisation regardless of size or sector, costing UK businesses almost £35 billion per year.<\/p>\n<p>Attendees will gain a clear understanding of mental health in the workplace allowing them to promote and enable better mental health within their own organisation.Agenda: <\/p>\n<p>Lunchtime event running from 12 noon to 2:30 pm. There will be light refreshments.<\/p>\n<p>Speaker: Sandra Vaughan, Chief Executive, Dudley Mind. <\/p>\n<p> <\/p>\n<p> <\/p>","longitude":0,"latest_end_local":"07 Oct 2020 14:30:00","earliest_end_local":"07 Oct 2020 14:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"07 Oct 2020 13:30:00","venue_postal_code":"WV11 3SZ","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Wolverhampton"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"07\/10\/20"}]}],"description":""},{"earliest_start_utc":"07 Oct 2020 12:00:00","slug":"dealing-with-terminal-illness-in-the-workplace","venue_name":"Private","venue_city":"","latest_end_utc":"07 Oct 2020 14:00:00","earliest_start_local":"07 Oct 2020 13:00:00","url":"https:\/\/bcbf20.ticketleap.com\/dealing-with-terminal-illness-in-the-workplace\/dates\/Oct-07-2020_at_0100PM","venue_street":"","latest_start_local":"07 Oct 2020 13:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/6f407c8d-d90e-4281-af00-7e12ec21d8e3\/hero.jpg","latitude":0,"latest_start_utc":"07 Oct 2020 12:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/6f407c8d-d90e-4281-af00-7e12ec21d8e3\/full.jpg","name":"Dealing with terminal illness in the workplace ONLINE","id":"527c5cc0-5d48-11ea-8aca-22000b6d80dc","html_description":"<p>For someone receiving a terminal diagnosis, it can feel like their life has flipped upside down. This time can also be difficult for the people surrounding them including their employers. This dealing with terminal illness in the workplace seminar will look to equip employers with the skills to support their staff post diagnosis. Topics explored will include; how to have difficult conversations, how to help them stay in employment longer and advice on additional services available in the area.  <\/p>\n<p>The event is aimed at SME business owners, HR Managers, Team leaders and all sectors.  <\/p>\n<p>Attendees will gain a deeper understanding of terminal illnesses. An understanding of what the employer could and should offer an employee living with a terminal diagnosis or caring for someone with a terminal illness. Better understanding of local services available.  <\/p>\n<p><strong>Agenda:<\/strong> The event will be split into 2 parts. Section one (1:15pm-2:00pm) will be a presentation and discussion with our panelists discussing some key themes surrounding supporting someone diagnosed with a life limiting condition and answering questions from the audience. After a short break we will then run a short Dementia friends session (2:15pm-3:00pm).<\/p>\n<p><strong>Speakers: <\/strong><\/p>\n<p>Care staff from Compton Care will discuss:<\/p>\n<p>- The practical side of receiving terminal diagnosis - what employers need to be aware of.<\/p>\n<p>- The emotional support employers can offer, offer advice on how to broach difficult conversations and offer advice on local services available.<\/p>\n<p> <\/p>","longitude":0,"latest_end_local":"07 Oct 2020 15:00:00","earliest_end_local":"07 Oct 2020 15:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"07 Oct 2020 14:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"07\/10\/20"}]}],"description":""},{"earliest_start_utc":"07 Oct 2020 12:00:00","slug":"the-solopreneur-mindset--media-meetup","venue_name":"Private","venue_city":"","latest_end_utc":"07 Oct 2020 13:30:00","earliest_start_local":"07 Oct 2020 13:00:00","url":"https:\/\/bcbf20.ticketleap.com\/the-solopreneur-mindset--media-meetup\/dates\/Oct-07-2020_at_0100PM","venue_street":"","latest_start_local":"07 Oct 2020 13:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/eac8a684-a7b5-45d5-a63d-b343bc25f238\/hero.jpg","latitude":0,"latest_start_utc":"07 Oct 2020 12:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/eac8a684-a7b5-45d5-a63d-b343bc25f238\/full.jpg","name":"The Solopreneur 'Mindset & Media' Meetup ONLINE","id":"e83c747a-5960-11ea-adb8-22000b1e8239","html_description":"<p>The afternoon will be focused on \"Mindset &amp; Media\" and will feature short presentations on Personal Development and how to effectively use all forms of Media to grow your business.<\/p>\n<p>The event is primarily aimed at solopreneurs, small business owners, freelancers and stay-at-homers.<\/p>\n<p>Attendees will gain valuable information on growing their business through utilising the media and also personal development tips and techniques.  <\/p>\n<p>Agenda: <\/p>\n<p>1:00 - Event Start <\/p>\n<p>Welcome<\/p>\n<p>Presentation - 7 Steps to Solopreneur Success<\/p>\n<p>Presentation - Brand Yourself Using Social Media<\/p>\n<p>2:30 - Close <\/p>\n<p>Speakers: <\/p>\n<p>Simone Bell, Award Winning Entreprenuer, Success Coach and Public Speaker<\/p>\n<p>Chris Green, Expert Strategic Internet Marketer<\/p>","longitude":0,"latest_end_local":"07 Oct 2020 14:30:00","earliest_end_local":"07 Oct 2020 14:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"07 Oct 2020 13:30:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"07\/10\/20"}]}],"description":""},{"earliest_start_utc":"07 Oct 2020 13:00:00","slug":"intellectual-property-protection-for-innovations","venue_name":"Private","venue_city":"","latest_end_utc":"07 Oct 2020 13:30:00","earliest_start_local":"07 Oct 2020 14:00:00","url":"https:\/\/bcbf20.ticketleap.com\/intellectual-property-protection-for-innovations\/dates\/Oct-07-2020_at_0200PM","venue_street":"","latest_start_local":"07 Oct 2020 14:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/b1ecd9bb-150e-4dc4-9340-b957458b14bf\/hero.jpg","latitude":0,"latest_start_utc":"07 Oct 2020 13:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/b1ecd9bb-150e-4dc4-9340-b957458b14bf\/full.jpg","name":"Intellectual Property Protection for Innovations ONLINE","id":"894a437c-b471-11ea-96f2-22000b2a8a30","html_description":"<p>Come and join us for a virtual IP and product development workshop run by the Science in Industry Research Centre (SIRC).  The virtual session will cover Intellectual Property Protection for Innovations , Product Development and University Collaborations. nnThe Science in Industry Research Centre (SIRC) is an ERDF project based at the Wolverhampton Science Park and run by the University of Wolverhampton. SIRC will support businesses to develop new science based products and processes. The centre will support SMEs in the Black Country, Greater Birmingham and Solihull, The Marches as well as Stoke on Trent &amp; Staffordshire. Eligible applicants benefit from initial fully-funded support to refine their product concept and its development requirements (typically a minimum of 12 hours support from SIRC specialist staff).<\/p>\n<p>This work shop is free to attend and is part-funded by the European Regional Development Fund (ERDF).<\/p>\n<p>Before the workshop you will be sent a link to join the session.  <\/p>\n<p>Who is the event aimed at:<\/p>\n<p>Businesses interested in product development or IP.   Attendees will find out more about how SIRC can support product or process development and what to consider when it comes to IP.  <\/p>\n<p>What will attendees gain?<\/p>\n<p>Develop knowledge around IP and your rights. Learn about how SIRC can support you to develop a new product or process.<\/p>\n<p><strong>Agenda and Speakers<\/strong><\/p>\n<p>14:00 Welcome and Introduction to SIRC<\/p>\n<p>Andrew Pollard, SIRC Project Director<\/p>\n<p>14:15 Intellectual Property Protection for Scientific innovations<\/p>\n<p>Gavin Smeilus, Senior Consultant<\/p>\n<p>14:30 Research Collaborations<\/p>\n<p>Andrew Pollard, SIRC Project Director<\/p>\n<p>14:40 FabLab and Prototyping Facilities<\/p>\n<p>Jon Lester, Knowledge Transfer Lead<\/p>\n<p>14:50 Q&amp;A’s<\/p>\n<p>15:00 Event Close<\/p>","longitude":0,"latest_end_local":"07 Oct 2020 14:30:00","earliest_end_local":"07 Oct 2020 14:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"07 Oct 2020 13:30:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"07\/10\/20"}]}],"description":""},{"earliest_start_utc":"08 Oct 2020 07:00:00","slug":"your-skills-your-future","venue_name":"Private","venue_city":"","latest_end_utc":"08 Oct 2020 08:00:00","earliest_start_local":"08 Oct 2020 08:00:00","url":"https:\/\/bcbf20.ticketleap.com\/your-skills-your-future\/dates\/Oct-08-2020_at_0800AM","venue_street":"","latest_start_local":"08 Oct 2020 08:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/3fa922f9-df65-41b6-86b7-13c5eab2abca\/hero.jpg","latitude":0,"latest_start_utc":"08 Oct 2020 07:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/3fa922f9-df65-41b6-86b7-13c5eab2abca\/full.jpg","name":"Your Skills, Your Future ONLINE","id":"c0af5710-5a1e-11ea-a169-22000b0c01fa","html_description":"<p>We all know that these are challenging times for business and if we are to emerge from the impact of COVID-19, protect jobs and create long term stability for the West Midlands economy, we will have to take the long view whilst managing the immediate effects on day-to-day business.<\/p>\n<p>This event will outline all of the support that Dudley College of Technology can bring to bear to support the skills base of your business.<\/p>\n<p>We will be talking about:<\/p>\n<p><strong>Fully funded Apprenticeship Training<\/strong> for non-levy employers. We will share how we can cover the cost of training due to our partnerships with the West Midlands Combined Authority, Dudley Council and others.<\/p>\n<p><br><strong>Incentives for newly hired Apprentices.<\/strong> We will explain how you can access up to £3,000 for every new apprentice that you hire before January 31st 2021.<\/p>\n<p><br><strong>Traineeships.<\/strong> This new programme means you can receive up to £1,000 each for up to 10 trainees you welcome into your business.<\/p>\n<p><br><strong>Kickstart.<\/strong> We will explain how your business can receive 100% of the National Minimum Wage for 6 months for every unemployed person that you hire.<\/p>\n<p><br><strong>Free Recruitment Service.<\/strong> Be it apprentice or trainee, we will explain how we can enable you to access the talent of the future.<\/p>\n<p><br><strong>Academies.<\/strong> The launch of the Dudley Engineering and Manufacturing Academy has been a huge success. A new way to find the engineers of the future, we have repeated this innovative model of recruitment out to new sectors in the launch of our Advanced Construction and Hairdressing Academies. Find out how you can recruit tried and tested young Apprentices into your business.<\/p>\n<p><br><strong>T' Levels.<\/strong> This brand new qualification went 'live' in September 2020 and will provide a high quality technical option alongside an academic route for students aged 16 to 19. Find out how your business can be part of the future success of T Levels.<\/p>\n<p><br><strong>Sector Based Work Academies. <\/strong>If you need to recruit a skilled workforce with the right skills to sustain and grow your business, we will explain how we can work with you to create a programme bespoke to the needs of your organisation.<\/p>\n<p><br><strong>English as a 2nd Language.<\/strong> We can improve your employee’s English speaking, reading and writing skills by offering specialised English language lessons in your workplace. Find out how.<\/p>\n<p><br><strong>The Black Country &amp; Marches Institute of Technology<\/strong> is taking shape next door to the Black Country Living Museum. This major new £32.5m development will provide high-quality training opportunities with clear pathways to skilled jobs in the following sectors: Advanced manufacturing, Modern construction methodologies, Medical engineering and Digital Technologies. Come and learn about the future of Higher Level Technical education in the Black Country. <\/p>\n<p>The event is aimed at Business Owners and Directors, L&amp;D and HR Professionals. <\/p>\n<p>Attendees will leave with a clear understanding of the new routes their business will be able to access to reach the skilled workforce of the future. Employers will also learn how they can access the skills of Dudley College of Technology students for free, to support projects, add capacity or trial what it might be like to employ an apprentice. <\/p>\n<p><strong>Agenda:<\/strong><br>08.00am - 09.00am:<\/p>\n<p>Presentations and Q&amp;A<\/p>\n<p><strong>Speakers: <\/strong><\/p>\n<p>Georgina Barnard - Managing Director of Black Country &amp; Marches Institute of Technology<\/p>\n<p>Nick Thompson – Head of Employer Engagement, Dudley College of Technology<\/p>","longitude":0,"latest_end_local":"08 Oct 2020 09:00:00","earliest_end_local":"08 Oct 2020 09:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"08 Oct 2020 08:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Education & Skills"}]},{"name":"Date","options":[{"name":"08\/10\/20"}]}],"description":""},{"earliest_start_utc":"08 Oct 2020 08:30:00","slug":"midland-metropolitan-university-hospital-with-balfour-beatty","venue_name":"Private","venue_city":"","latest_end_utc":"08 Oct 2020 10:00:00","earliest_start_local":"08 Oct 2020 09:30:00","url":"https:\/\/bcbf20.ticketleap.com\/midland-metropolitan-university-hospital-with-balfour-beatty\/dates\/Oct-08-2020_at_0930AM","venue_street":"","latest_start_local":"08 Oct 2020 09:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/2d990ddd-7b85-43b7-bac0-cd306a7d6118\/hero.jpg","latitude":0,"latest_start_utc":"08 Oct 2020 08:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/2d990ddd-7b85-43b7-bac0-cd306a7d6118\/full.jpg","name":"Midland Metropolitan University Hospital Special with Balfour Beatty: ONLINE","id":"c084b87a-dc9b-11ea-b614-22000a930ba7","html_description":"<p>This virtual ‘meet the buyer’ event on Thursday 8 October is your chance to meet tier-one contractors for Balfour Beatty Plc, principal contractor for the Midland Metropolitan University Hospital (MMUH).<\/p>\n<p>Hosted by Sandwell Council and Sandwell Business Ambassadors (<a href=\"https:\/\/www.sandwellbusinessambassadors.co.uk\" rel=\"nofollow\" target=\"_blank\">www.sandwellbusinessambassadors.co.uk<\/a>), this interactive event will give you insight and guidance on winning work on the £267m project – as well as Balfour Beatty’s other regional projects, including the redevelopment of the Black Country Living Museum.<\/p>\n<p>Taking place from 9:30am to 11.00am, it is suitable for business owners, business development professionals, directors who would like their businesses to be in with a chance of supplying the landmark MMUH development. It will show you the types of subcontract works packages, components and ancillary services needed by Balfour Beatty’s tier-one suppliers. The event is also a great networking opportunity, allowing you to connect with buyers directly involved in the project and find out what they look for in suppliers.<\/p>\n<p>Attendees will hear from Bob Hallam-Allsop, Balfour Beatty’s MMUH Project Director and Corin Godsmark, Account Director. Bob and Corin will give a background to Balfour Beatty, talk about the story of MMUH, and share images of internal designs – including a virtual tour of the site. You will also hear about MMUH procurement timelines and the likely lower-tier contracts coming up for grabs.<\/p>\n<p>Corin will talk more generally about supplying to Balfour Beatty on other Midlands- based contracts, such as the Black Country Living Museum, HS2 in the region, new schools and building improvement programme and the M6 Junction 10 development. He will give advice on working for Balfour Beatty post-COVID, offering an overview of supplier approvals, the provision of safe and productive workplaces, accreditations and COVID-19 audits needed by suppliers working on major infrastructure projects.<\/p>\n<p>This is a valuable opportunity to hear about supply chain assessments and the different levels of approvals needed for high-risk trades.<\/p>\n<p><strong>Agenda<\/strong><\/p>\n<p>09:30am Welcome and introduction to Sandwell Business Ambassadors from Alan Taylor, chair of Sandwell Business Ambassadors<br>10.10am Bob Hallam-Allsop and Corin Godsmark on:<\/p>\n<ul><li>The story of MMUH<\/li><li>Key facts and figures<\/li><li>Virtual tour<\/li><li>Key dates &amp; project milestones<\/li><li>Sandwell &amp; West Birmingham NHS Trust – employment opportunities<\/li><li>Supply chain partners – key trades (Flynn Interiors)<\/li><li>Social Value<\/li><li>Project opportunities with Sandwell<\/li><li>Project opportunities with Balfour Beatty<\/li><li>Becoming a Balfour Beatty supplier<\/li><\/ul>\n<p>10.50am Event summary and close.<\/p>\n<p><strong>Speakers: <\/strong><\/p>\n<p>Alan Taylor – Sandwell Business Ambassadors<\/p>\n<p>Corin Godsmark – Account Director – Balfour Beatty Construction (Midlands)<\/p>\n<p>Bob Hallam-Allsop - MMUH Project Director - Balfour Beatty Construction (Midlands)<\/p>","longitude":0,"latest_end_local":"08 Oct 2020 11:00:00","earliest_end_local":"08 Oct 2020 11:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"08 Oct 2020 10:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Property & Construction"}]},{"name":"Date","options":[{"name":"08\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"08 Oct 2020 09:00:00","slug":"emc-presents-empowering-social-enterprise--entrepreneurs","venue_name":"Private","venue_city":"","latest_end_utc":"08 Oct 2020 11:00:00","earliest_start_local":"08 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/emc-presents-empowering-social-enterprise--entrepreneurs\/dates\/Oct-08-2020_at_1000AM","venue_street":"","latest_start_local":"08 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/659f9e9e-8c0f-4b2b-afac-67a0ec4617f1\/hero.jpg","latitude":0,"latest_start_utc":"08 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/659f9e9e-8c0f-4b2b-afac-67a0ec4617f1\/full.jpg","name":"EMC presents: Empowering Social Enterprise & Entrepreneurs Event ONLINE","id":"3bc749b0-de24-11ea-81b3-22000a65d5a2","html_description":"<p>Do you dream about starting your own social enterprise? Are you a budding social entrepreneur?<\/p>\n<p>Would you like to find out more about having a social aim and understanding of the social enterprise arena?<\/p>\n<p>Join us to learn more about this unique type of business that uses income-generating activities to accomplish social, environmental or cultural community aims. Hear from established social enterprises, learn how you can access funds, plus be a part of a supportive network specifically for social enterprises. We also explain how you can put your passion and unique selling point into a social vision and into the heart of your business.<\/p>\n<p>If you want to start up, develop or grow your social enterprise and meet like-minded entrepreneurs, this event is for you! This event is also for entrepreneurs who want support with capacity building, networking, training and collaboration.<\/p>\n<p>EMC is a social enterprise infrastructure organisation. We aim to provide support and guidance for all equality groups, especially the BAME community.<\/p>\n<p>This event will inform attendees about the social enterprise arena, help them find inspiration and learn from existing social enterprises.<\/p>\n<p>Attendees also have the chance to join a social enterprise and entrepreneurs network and community.<\/p>\n<p>EMC presents: Empowering Social Enterprise &amp; Entrepreneurs Conference<\/p>\n<p><strong>Agenda<\/strong><\/p>\n<p><strong>1. Welcome and Introductions – Sophie Hipgrave, Communications and Marketing Manager at EMC<\/strong><\/p>\n<p><strong>2. Empowering Social Enterprise &amp; Entrepreneurs – Suffia Perveen, lead at EMC<\/strong><\/p>\n<ul><li>What is a social enterprise?<\/li><li>Developing stronger organisations and capacity-building.<\/li><li>Supporting entrepreneurs in mindset, mental health and more.<\/li><li>Supporting entrepreneurs to transform the economy, environment, social life and culture.<\/li><\/ul>\n<p><strong>3. How We Did It: Brand Me CIC – Founders Syrona Nelson &amp; Derrick Buchanan<\/strong><\/p>\n<p>Brand Me CIC is a creative talented duo who create a range of video production, sound recording and music publishing.<\/p>\n<p>They teach and inspire through performing arts to disadvantaged young people and families.<\/p>\n<p>They’ll cover:<\/p>\n<ul><li>Who they are and how and why they started working together.<\/li><li>How they built their name and worked with household names in the industry.<\/li><li>The journey: practical, physical, emotional<\/li><li>BrandMe asks: How much are you willing to invest in yourself, and believe in yourself?<\/li><li>Q&amp;A<\/li><\/ul>\n<p><strong>BREAK<\/strong><\/p>\n<p><strong>4. Aspiring Futures CIC, founder Sofia Haider<\/strong><\/p>\n<p>Aspiring Futures is a not-for-profit women-led social enterprise committed to inspire women to have the confidence, skills and courage to follow their aspirations.<\/p>\n<ul><li>Explains the biggest lessons she has learnt<\/li><li>The journey: the highs and lows<\/li><li>Practical tips and tricks for your social enterprise, and what works for her.<\/li><li>Q&amp;A<\/li><\/ul>\n<p><strong>5. How to build your digital marketing strategy – Sophie Hipgrave, EMC<\/strong><\/p>\n<p>Discover how to build your brand online, get noticed by customers and collaborators alike, cut through the noise and create a name for yourself.<\/p>\n<p>We will cover:<\/p>\n<ul><li>Setting goals and measuring success<\/li><li>Building your customer avatar – Where are your customers? How will you reach them?<\/li><li>Choose which platforms are right for you.<\/li><li>Discover your USP.<\/li><li>Why you should be social listening.<\/li><li>Build your customer journey and funnels.<\/li><li>Consider your wider responsibility, e.g. diversity, inclusion, environmental sustainability.<\/li><li>Q&amp;A<\/li><\/ul>\n<p><strong>6. Future of Social Enterprise: Special Guest to launch the new Social Enterprise and Entrepreneurs Network (EMC2)<\/strong><\/p>\n<ul><li>The EMC2 goal is to help and support existing and emerging social enterprises and entrepreneurs.<\/li><li>We provide you with a platform to share your business with others and be a part of the EMC2 network.<\/li><li>We want to support and nurture CICs to flourish by providing resources, promotion, networking, business support and representation of our membership.<\/li><\/ul>\n<p><strong>Panel Q&amp;A<\/strong><\/p>\n<p><strong>Panel line-up:<\/strong><\/p>\n<p>Josie Kelly, CEO, Access To Business <\/p>\n<p>Access To Business is a Wolverhampton charity providing professional services supporting local people into employment and self-employment, as well as offering training and office services.<\/p>\n<p><strong>Speakers:<\/strong><\/p>\n<p>Suffia Perveen (EMC),<\/p>\n<p>Sofia Haider (Aspiring Futures),<\/p>\n<p>Syrona Nelson (BrandMe CIC),<\/p>\n<p>Derrick Buchanan (BrandMe CIC)<\/p>\n<p> <\/p>\n<p> <\/p>\n<p> <\/p>\n<p> <\/p>","longitude":0,"latest_end_local":"08 Oct 2020 12:00:00","earliest_end_local":"08 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"08 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"08\/10\/20"}]}],"description":""},{"earliest_start_utc":"08 Oct 2020 09:00:00","slug":"emissions-reduction-and-fuel-quality-open-day--demonstration","venue_name":"Private","venue_city":"","latest_end_utc":"08 Oct 2020 11:00:00","earliest_start_local":"08 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/emissions-reduction-and-fuel-quality-open-day--demonstration\/dates\/Oct-08-2020_at_1000AM","venue_street":"","latest_start_local":"08 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/d714c263-b667-4fba-a7b6-0c7a4b91562b\/hero.jpg","latitude":0,"latest_start_utc":"08 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/d714c263-b667-4fba-a7b6-0c7a4b91562b\/full.jpg","name":"Emissions Reduction and Fuel Quality Open Day & Demonstration ONLINE","id":"213685d6-5ee8-11ea-be07-22000b228098","html_description":"<p>It's a fully interactive session which provides an ideal forum for you to quiz IPU on everything involving emissions and fuel contamination, along with sharing ideas and opinions with a knowledgeable audience. We will cover legislation, emissions technology, fuel contamination and solutions, open dialogue and a showcase of our exhaust aftertreatment system and fuel products in action.  <\/p>\n<p><strong>Who is the event aimed at? <\/strong>Anyone with a diesel genset!<\/p>\n<p>You may have one on site for backup power (the fuel you have stored is likely degrading). If you run it for over 50 hours a year, it needs to be compliant with new legislation. Every single diesel genset (regardless of it's use or application or age), also needs a permit. This will also be extremely useful for Facilities Management Companies, Generator Service Companies, or anyone else who has a keen interest in the changing world of emissions and the growing problem of fuel contamination.  <\/p>\n<p>Guests will be clued up on the latest fuel issues and how they can be tackled. They will also have an introduction into the minefield of emissions legislation and depending on the audience, we can go into as much detail as necessary! Attendees will also learn the basic technology used to tackle emissions and when\/where they should be used.  <\/p>\n<p><strong>Timings:<\/strong><\/p>\n<p>10am – 11:15am – Presentation<\/p>\n<p>11:15am – 12pm – Q&amp;A<\/p>\n<p><strong>Speakers: <\/strong><\/p>\n<p>David Caddick - IPU Sales &amp; Technical Director<\/p>\n<p>Mike Benzies  - IPU Business Development Director (Fuel Expert)<\/p>\n<p>Ian Brewin - IPU Area Sales Manager<\/p>","longitude":0,"latest_end_local":"08 Oct 2020 12:00:00","earliest_end_local":"08 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"08 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Property & Construction"}]},{"name":"Date","options":[{"name":"08\/10\/20"}]}],"description":""},{"earliest_start_utc":"08 Oct 2020 09:00:00","slug":"photonic-technologies-for-food-and-drink","venue_name":"Private","venue_city":"","latest_end_utc":"08 Oct 2020 11:00:00","earliest_start_local":"08 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/photonic-technologies-for-food-and-drink\/dates\/Oct-08-2020_at_1000AM","venue_street":"","latest_start_local":"08 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/ef97dc92-3fb7-48c5-9941-c89a53975b45\/hero.jpg","latitude":0,"latest_start_utc":"08 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/ef97dc92-3fb7-48c5-9941-c89a53975b45\/full.jpg","name":"Photonic Technologies for Food & Drink and Agriculture Industries ONLINE","id":"ddd0a028-e070-11ea-b614-22000a930ba7","html_description":"<p>This interactive webinar is hosted by Aston University as part of the Enabling Technologies &amp; Innovation Competences Challenge Project. ETICC project is part-funded by the European Regional Development Fund (ERDF) and offers FREE support and expertise in photonics, materials and computer science\/AI to 50 small and medium businesses from Black Country and Greater Birmingham &amp; Solihull areas; this support is available until the end of July 2021.<\/p>\n<p>This webinar was developed for the companies in Food &amp; Drink industry, the UK's largest manufacturing sector. Photonics technologies have wide application in food processing and help improve hygiene and food security, reduce food waste and enhance the information received by the consumer. The workshop will cover methods for:<\/p>\n<p>- Real time monitoring of food quality critical parameters<\/p>\n<p>- Detection of food chemical composition<\/p>\n<p>- Detection of pathogen bacteria, residues, and other contaminants in food matrices<\/p>\n<p>- Real time measurement of fruit\/produce maturity.<\/p>\n<p><strong>Agenda:<\/strong><\/p>\n<p>10am - ETICC Project overview and webinar participants introduction<\/p>\n<p>10:15 - Mid-IR Spectroscopy for Detection of Food Chemical Composition<\/p>\n<p>10:35 - Aston Institute of Materials Research: Testing Capabilities<\/p>\n<p>10:45 - Photonics Technology for Agriculture sector<\/p>\n<p>11:00 - Application of Photonic Sensors in Food Industry<\/p>\n<p>11:15 - Demo: Fourier-Transform Infrared Spectrometer<\/p>\n<p>11:30 - Demo: Hyperspectral Imaging System<\/p>\n<p>11:45 - Q&amp;A<\/p>\n<p>12:00 - End<\/p>\n<p><strong>Speakers:<\/strong> Dr Kaiming Zhou, Dr Vlad Dvoyrin, Dr Alex Rozhin, Dr Payal Baheti, industry guests - Milling Trade Ltd<\/p>\n<p> <\/p>","longitude":0,"latest_end_local":"08 Oct 2020 12:00:00","earliest_end_local":"08 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"08 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Advanced Manufacturing"}]},{"name":"Date","options":[{"name":"08\/10\/20"}]}],"description":""},{"earliest_start_utc":"08 Oct 2020 09:00:00","slug":"starting-a-business-heres-where-to-start","venue_name":"Private","venue_city":"","latest_end_utc":"08 Oct 2020 11:30:00","earliest_start_local":"08 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/starting-a-business-heres-where-to-start\/dates\/Oct-08-2020_at_1000AM","venue_street":"","latest_start_local":"08 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/be6e728e-5f11-4a4b-aa3d-8daae1b7c7be\/hero.jpg","latitude":0,"latest_start_utc":"08 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/be6e728e-5f11-4a4b-aa3d-8daae1b7c7be\/full.jpg","name":"Starting a business? Here's where to start ONLINE","id":"3a9bc472-de23-11ea-9044-22000b928799","html_description":"<p>Have you considered starting your own business?  Why not listen to our industry experts and professionals who have all the answers to your questions.  Whether it is about how to set up, sourcing finance, building a brand or whether you require planning permission, we will be able to help.  This informal webinar will get you started when starting you business!  The event is aimed at delegates who are interested in, currently in the process or have recently started their own business and want to gain a greater knowledge of the how's and why's of being a business owner.  This could be people who have been in their industry for 30 years and now want to branch off on their own, or those who want to turn their passion\/hobby into something more.  <\/p>\n<p>Attendees will learn the in's and out's of starting a business, the legalities of registering your company, basics on how to develop a brand, how to protect your intellectual property and will have an opportunity to ask questions to experts within the business support industry.<\/p>","longitude":0,"latest_end_local":"08 Oct 2020 12:30:00","earliest_end_local":"08 Oct 2020 12:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"08 Oct 2020 11:30:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"08\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"08 Oct 2020 09:00:00","slug":"the-black-country-rocks-international-tourism-opportunities-for","venue_name":"Private","venue_city":"","latest_end_utc":"08 Oct 2020 11:00:00","earliest_start_local":"08 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/the-black-country-rocks-international-tourism-opportunities-for\/dates\/Oct-08-2020_at_1000AM","venue_street":"","latest_start_local":"08 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/d7f47053-35b5-4fbf-a300-4f33b1fb63e5\/hero.jpg","latitude":0,"latest_start_utc":"08 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/d7f47053-35b5-4fbf-a300-4f33b1fb63e5\/full.jpg","name":"The Black Country rocks: International tourism opportunities for the region ONLINE","id":"41ef9894-ed0e-11ea-b545-22000a66940f","html_description":"<p>From its UNESCO Geopark designation to the new 2022 Commonwealth Games Aquatics Centre, the Black Country’s tourism sector has plenty to look forward to. This digital round table event features speakers from the VisitEngland Advisory Board, UNESCO and the region to discuss the steps needed to make the most of major events and the region’s renowned attractions.  The event is aimed at Leaders, CEOs, policy-makers, marketers &amp; professionals in tourism, hospitality, marketing and communications, place-making, economic development, regeneration and BIDs.<\/p>\n<p><strong>What will attendees gain? <\/strong><\/p>\n<p>Latest national and regional thinking on how tourism contributes to the places we love and share so that they thrive and give pride to our residents, visitors and investors.<\/p>\n<p><strong>Agenda: <\/strong><\/p>\n<p>10am: Welcome<\/p>\n<p>10.15 - 11.15am: Speakers<\/p>\n<p>11.15 -11.45am: Questions and discussion<\/p>\n<p>11.45am: Learning and wrap up<\/p>\n<p><strong>Speakers: <\/strong><\/p>\n<p>Nick de Bois, Chair of the Visit England Advisory Board<\/p>\n<p>Neil Rami, CEO West Midlands Growth Company<\/p>","longitude":0,"latest_end_local":"08 Oct 2020 12:00:00","earliest_end_local":"08 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"08 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Retail, Tourism & Hospitality"}]},{"name":"Date","options":[{"name":"08\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"08 Oct 2020 09:30:00","slug":"the-black-country-funding-network-for-arts-and-culture--partner","venue_name":"Private","venue_city":"","latest_end_utc":"08 Oct 2020 11:00:00","earliest_start_local":"08 Oct 2020 10:30:00","url":"https:\/\/bcbf20.ticketleap.com\/the-black-country-funding-network-for-arts-and-culture--partner\/dates\/Oct-08-2020_at_1030AM","venue_street":"","latest_start_local":"08 Oct 2020 10:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/9203a415-b32a-417e-91ec-8782bc957f49\/hero.jpg","latitude":0,"latest_start_utc":"08 Oct 2020 09:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/9203a415-b32a-417e-91ec-8782bc957f49\/full.jpg","name":"The Black Country Funding Network for Arts and Culture – partnership funding session ONLINE","id":"35082954-de2f-11ea-919f-22000a3fd8f5","html_description":"<p>The Black Country Funding Network for Arts and Culture – partnership funding session. For individuals, groups or organisations who are interested in finding out more about working in partnership to fundraise for creative work\/activity in the Black Country.  This will be co-hosted by Yvonne Gregory, Fundraising Manager at CBC, Sam Hope, Wolverhampton Cultural Compact Champion and Heather Clark, Manager Strategic Project Funding Wolverhampton City Council.<br><br>This event is for individuals, groups or organisations who are interested in finding out more about working in partnership to fundraise for creative work\/activity in the Black Country - Arts Fundraisers and those who need to fundraise as part of their role.  <\/p>\n<p>Participants will find out about the new arts funding network and how to be involved. We will be discussing the ideas such as:<\/p>\n<ul><li>is partnership working and fundraising the way forward?<\/li><li>what are the advantages?<\/li><li>what are the considerations?<\/li><\/ul>\n<p><br>It's also a good opportunity for Black Country creatives to connect with Creative Black Country. Plus a chance to connect with other creatives and fundraisers in the region.<\/p>\n<p>Agenda: <\/p>\n<p>10.20am - 10.30am: Attendees joining Zoom<br>10.30am - 12pm: A combination of short presentations, Q and A and discussions, in an informal style<\/p>\n<p>Speakers: <\/p>\n<p>Yvonne Gregory, Fundraising Manager at Creative Black Country<\/p>\n<p>Sam Hope, Wolverhampton Cultural Compact Champion<\/p>\n<p>Heather Clark, Manager Strategic Project Funding Wolverhampton City Council<\/p>","longitude":0,"latest_end_local":"08 Oct 2020 12:00:00","earliest_end_local":"08 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"08 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Creative Industries"}]},{"name":"Date","options":[{"name":"08\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"08 Oct 2020 10:00:00","slug":"using-open-source-software-for-your-business","venue_name":"NMC Venue","venue_city":"West Bromwich","latest_end_utc":"08 Oct 2020 11:00:00","earliest_start_local":"08 Oct 2020 11:00:00","url":"https:\/\/bcbf20.ticketleap.com\/using-open-source-software-for-your-business\/dates\/Oct-08-2020_at_1100AM","venue_street":"47 Birmingham Road","latest_start_local":"08 Oct 2020 11:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/b49605c6-52fb-4fb9-957f-57b1590de21b\/hero.jpg","latitude":0,"latest_start_utc":"08 Oct 2020 10:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/b49605c6-52fb-4fb9-957f-57b1590de21b\/full.jpg","name":"Using Open Source Software for your business","id":"a889ed72-5fa9-11ea-a83c-22000aec09a6","html_description":"<p>Open Source Software (OSS) offers much to business in terms of reducing cost and adding considerably to the capability of your organisation. Come and find out what OSS is and how your can maximize your ROI.  The event is aimed at all business decision makers. Attendees will learn how to reduce cost in business - data protection - increased productivity - flexibility in using Information Technology.<\/p>\n<p>Agenda: <\/p>\n<p>1. Introduction and Welcome<\/p>\n<p>2. What is OSS?<\/p>\n<p>3. GPLv3 Licensing<\/p>\n<p>4. Examples of OSS in use<\/p>\n<p>5. Wash up and discussion<\/p>\n<p>Speaker: Andrew G Morris<\/p>","longitude":0,"latest_end_local":"08 Oct 2020 12:00:00","earliest_end_local":"08 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"08 Oct 2020 11:00:00","venue_postal_code":"B70 6PY","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Sandwell"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"08\/10\/20"}]}],"description":""},{"earliest_start_utc":"08 Oct 2020 13:00:00","slug":"double-your-sales-with-an-optimised-customer-value-journey-work","venue_name":"Private","venue_city":"","latest_end_utc":"08 Oct 2020 14:30:00","earliest_start_local":"08 Oct 2020 14:00:00","url":"https:\/\/bcbf20.ticketleap.com\/double-your-sales-with-an-optimised-customer-value-journey-work\/dates\/Oct-08-2020_at_0200PM","venue_street":"","latest_start_local":"08 Oct 2020 14:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/cce53d0b-ce18-471b-b10f-189e51268bb3\/hero.jpg","latitude":0,"latest_start_utc":"08 Oct 2020 13:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/cce53d0b-ce18-471b-b10f-189e51268bb3\/full.jpg","name":"Double Your Sales With An Optimised Customer Value Journey Workshop ONLINE","id":"415433ec-5fae-11ea-b7ab-22000b6902b0","html_description":"<p>Have you ever been on the phone to a sales person and felt dirty, abused or even assaulted at the end of it? Are you worried that your sales process is a bit pushy? Imagine if you could turn complete strangers into raving fans of your business... then imagine that you could turn that business into one double the size! Our scientifically proven method creates a proven customer value journey that will help you grow your business by having the right processes and structures in place. Come and see us to discover how you can increase your revenue and stop your marketing budget just being a leaky bucket!<\/p>\n<p>The event is aimed at company owners, marketing managers, managing directors, entrepreneurs and sales directors.  <\/p>\n<p>Attendees of this workshop will get a clear path that can help them double the size of their business through a proven scientific methodology of a trackable customer value journey.  <\/p>\n<p>Agenda: <\/p>\n<p>2pm: Steve Hooper, Chief Trainer - Customer Value Journey Workshop<\/p>\n<p>3.30pm: Close<\/p>\n<p> <\/p>\n<p> <\/p>","longitude":0,"latest_end_local":"08 Oct 2020 15:30:00","earliest_end_local":"08 Oct 2020 15:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"08 Oct 2020 14:30:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Education & Skills"}]},{"name":"Date","options":[{"name":"08\/10\/20"}]}],"description":""},{"earliest_start_utc":"08 Oct 2020 13:00:00","slug":"electric-vehicles-for-business","venue_name":"Autobase Citroen & MG","venue_city":"Darlaston, Walsall","latest_end_utc":"08 Oct 2020 15:00:00","earliest_start_local":"08 Oct 2020 14:00:00","url":"https:\/\/bcbf20.ticketleap.com\/electric-vehicles-for-business\/dates\/Oct-08-2020_at_0200PM","venue_street":"Walsall Road","latest_start_local":"08 Oct 2020 14:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/31bfdd0a-89fb-4d09-842b-3e92997eddaf\/hero.jpg","latitude":0,"latest_start_utc":"08 Oct 2020 13:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/31bfdd0a-89fb-4d09-842b-3e92997eddaf\/full.jpg","name":"Electric Vehicles for Business","id":"083882ea-dca2-11ea-847d-22000aa9f9b2","html_description":"<p>Autobase Citroen &amp; MG is hosting an event to present the benefit of Electric Cars and Vans for their Business. As the government’s environmental initiative of The Clean Growth Strategy and it’s plan to ban sale of all polluting vehicles by 2035, they are offering great benefits that companies can capitalize on and switch to electric vehicles. During the seminar we will highlight the key benefits not only for Businesses both big and small but also the employees with company cars. Topic like BIK tax, savings on daily running cost, writing down the cost as expenses and much more will be discussed. We will have specialist on site to answer any questions you may have specific to your business needs.  <\/p>\n<p>The event is aimed for both private individuals and corporate sector. Fleet Managers, Financial directors, Entrepreneurs, SME business owners or decision makers will benefit vastly with the contents discussed.  Electric vehicles and its benefits is new and there is a lot of information out there.  We intend to consolidate them into easy to follow guides and answer anything specific questions they may have pertinent to their business.  <\/p>\n<p>Speaker: <\/p>\n<p>Ali Allibhai (Director - Autobase Citroen &amp; MG)<\/p>\n<p>Adam Page (Business Development Manager - Autobase)<\/p>\n<p>Industry expert\/Rep from Manufacturer - TBC<\/p>","longitude":0,"latest_end_local":"08 Oct 2020 16:00:00","earliest_end_local":"08 Oct 2020 16:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"08 Oct 2020 15:00:00","venue_postal_code":"WS10 9SS","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Walsall"}]},{"name":"Sector","options":[{"name":"Automotive"}]},{"name":"Date","options":[{"name":"08\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"08 Oct 2020 17:00:00","slug":"wbbn-annual-business-conference-2020","venue_name":"Private","venue_city":"","latest_end_utc":"08 Oct 2020 20:00:00","earliest_start_local":"08 Oct 2020 18:00:00","url":"https:\/\/bcbf20.ticketleap.com\/wbbn-annual-business-conference-2020\/dates\/Oct-08-2020_at_0600PM","venue_street":"","latest_start_local":"08 Oct 2020 18:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/7de03ede-dc60-4498-8eff-8e5065a3caac\/hero.jpg","latitude":0,"latest_start_utc":"08 Oct 2020 17:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/7de03ede-dc60-4498-8eff-8e5065a3caac\/full.jpg","name":"WBBN Annual Business Conference 2020 ONLINE","id":"61f33c4c-57c0-11ea-b6cc-22000bbd30be","html_description":"<p>This event will engage with high level entrepreneurs and leaders of organisations to appear as guest speakers on various business topics. Speakers will be from the DIT, Wolverhampton University, a local business, the Fire Service, the City Council and a Local Bank.  Local politicians will also be involved to give some overview on topical issues concerning business of the minorities in our area.  We also invite Black Country businesses to display their goods and Services at the event, however please contact WBBN for details. <\/p>\n<p>This event is aimed at Black Country businesses to showcase themselves in our area, along with learning from local expert speakers. Attendance will open up various opportunities for trade and future engagements.  <\/p>\n<p>What will attendees gain from attending this event?<\/p>\n<p>Grow your business and learn from the expert speakers who will be attending the event: DIT, Wolverhampton University, a local business, the Fire Service, the City Council, a local bank.<\/p>\n<p>Agenda:<\/p>\n<p>6.00 - 6.10pm - Introduction of speakers by Janet Smith - JS Associates <\/p>\n<p>6.10 - 6.15pm - Welcome remark by WBBN Executive Director, Sam Duru <\/p>\n<p>6.15 - 6.35pm - Ms Samantha Samuels – Station Commander Fallings Park Fire Station, West Midlands Fire Service (WMFS)   <\/p>\n<p>6.35 - 6.55pm - Mr Gerald La Touche JP, MA, MIEX– International Trade Adviser (DIT) West Midlands <\/p>\n<p>6.55 - 7.15pm - Dr Paschal Anosike Associate Professor for Entrepreneurship &amp; Innovation; Director Centre for African Entrepreneurship &amp; Leadership (CEAL), University of Wolverhampton<\/p>\n<p>7.15 - 7.25pm - Comfort break <\/p>\n<p>7.25 - 7.45pm - Mr Demo Andu LLB (Hon.) LLM. MBA. Local Entrepreneur <\/p>\n<p>7.45 - 8.05pm - Mr Lakhbir Singh–Local Director Metro Bank, Wolverhampton   <\/p>\n<p>8.05 - 8.25pm - City of Wolverhampton Representation (to be confirmed)<\/p>\n<p>8.25 - 8.50pm - Panel Discussion <\/p>\n<p>8.50 - 9.00pm - Vote of thanks by Mr Michael Bolorunduro, WBBN Director.<\/p>","longitude":0,"latest_end_local":"08 Oct 2020 21:00:00","earliest_end_local":"08 Oct 2020 21:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"08 Oct 2020 20:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"08\/10\/20"}]}],"description":""},{"earliest_start_utc":"09 Oct 2020 08:00:00","slug":"protecting-your-business-against-cyber-threats","venue_name":"Private","venue_city":"","latest_end_utc":"09 Oct 2020 10:00:00","earliest_start_local":"09 Oct 2020 09:00:00","url":"https:\/\/bcbf20.ticketleap.com\/protecting-your-business-against-cyber-threats\/dates\/Oct-09-2020_at_0900AM","venue_street":"","latest_start_local":"09 Oct 2020 09:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/05bc57cb-857b-4ec9-ac28-53438db4f0d5\/hero.jpg","latitude":0,"latest_start_utc":"09 Oct 2020 08:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/05bc57cb-857b-4ec9-ac28-53438db4f0d5\/full.jpg","name":"Protecting your business against cyber threats ONLINE","id":"b1edeb66-5f9f-11ea-a5ab-22000b228098","html_description":"<p>This workshop unmasks the cyber challenges faced by businesses by sharing trends in cyber security threats and the current state-of-the-art approaches to boost businesses readiness.  Last year, 12.5 million UK records were compromised in a single cyberattack, and it took a major online service provider in the USA up to 3 years to realise that 3 Billion customers account details were accessed by attackers. Modern business operations connected to the cyberspace are facing challenges including but not limited to Ransomware, Cryptojacking, Distributed Denial of Service (DDoS), Malware, and Phishing.<\/p>\n<p>Cyber security is something that every business needs to be aware of and experts from the Wolverhampton Cyber Research Institute will unmask some of the cyber challenges faced by businesses and individuals. This workshop will discuss trending cyber security threats and the current state-of-the-art approaches to boost businesses readiness.  <\/p>\n<p>Speaker: Professor Prashant Pillai, University of Wolverhampton<\/p>","longitude":0,"latest_end_local":"09 Oct 2020 11:00:00","earliest_end_local":"09 Oct 2020 11:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"09 Oct 2020 10:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"09\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"09 Oct 2020 08:00:00","slug":"planning-for-success-within-a-family-business","venue_name":"Private","venue_city":"","latest_end_utc":"09 Oct 2020 10:00:00","earliest_start_local":"09 Oct 2020 09:00:00","url":"https:\/\/bcbf20.ticketleap.com\/planning-for-success-within-a-family-business\/dates\/Oct-09-2020_at_0900AM","venue_street":"","latest_start_local":"09 Oct 2020 09:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/ac02aba1-b988-43fa-a02a-001edf811758\/hero.jpg","latitude":0,"latest_start_utc":"09 Oct 2020 08:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/ac02aba1-b988-43fa-a02a-001edf811758\/full.jpg","name":"Planning for Success within a Family Business ONLINE","id":"348d067a-62dd-11ea-b7ab-22000b6902b0","html_description":"<p>Family businesses should be applauded as they make up around 85% of UK Businesses, employ 13.4 million people and typically demonstrate strong values and a commitment to local communities. However, anyone in a Family Business knows that they face unique performance and governance challenges and many of the problems that exist in corporate business environments can be exaggerated.  Properly documenting and structuring the family business requires consensus on the key issues and we will hear from three experts who are experienced in supporting families, helping the business grow. We will also explore solutions where consensus proves difficult, or when disputes are well entrenched.  <\/p>\n<p>Whilst open to everyone, this event will add benefit to those in Family Businesses as well as all those who advise them in some capacity.  <\/p>\n<p>Attendees will get a better understanding of:<\/p>\n<p>• The importance of planning, good housekeeping and governance<\/p>\n<p>• Issues relevant to the ownership and management of the company, now and in the future<\/p>\n<p>• Getting the constitutional documents right<\/p>\n<p>• Joining up with personal affairs<\/p>\n<p>• Mediation and how successful it is in resolving conflict<\/p>\n<p>Attendees will also hear from George Bryan who has first-hand experience of growing up in a Family Business and is a certified Family Business Consultant, supporting other families in business.<\/p>\n<p><strong>Speakers: <\/strong><\/p>\n<p>Paul Hunt, Partner at Higgs &amp; Sons and Head of Business Succession Planning<\/p>\n<p>George Bryan, Director at Drayton Manor Park and a certified Family Business Consultant<\/p>\n<p>Tim Jones, Partner at Higgs &amp; Sons and recognised by Chambers and Partners as one of the Top 35 Mediators in the UK with a wealth of experience in resolving family business disputes<\/p>","longitude":0,"latest_end_local":"09 Oct 2020 11:00:00","earliest_end_local":"09 Oct 2020 11:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"09 Oct 2020 10:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"09\/10\/20"}]}],"description":""},{"earliest_start_utc":"09 Oct 2020 08:00:00","slug":"the-reduced-growth-planning-show---60-minutes-adv-manuf","venue_name":"Private","venue_city":"","latest_end_utc":"09 Oct 2020 09:00:00","earliest_start_local":"09 Oct 2020 09:00:00","url":"https:\/\/bcbf20.ticketleap.com\/the-reduced-growth-planning-show---60-minutes-adv-manuf\/dates\/Oct-09-2020_at_0900AM","venue_street":"","latest_start_local":"09 Oct 2020 09:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/3942499d-acda-4ff6-bd9b-bb4e2ec0e023\/hero.jpg","latitude":0,"latest_start_utc":"09 Oct 2020 08:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/3942499d-acda-4ff6-bd9b-bb4e2ec0e023\/full.jpg","name":"The Reduced Growth Planning Show - 60 minutes to a great Growth Plan - Advanced Manufacturing ONLINE","id":"872031d4-dd4c-11ea-bbd6-22000bc0c1de","html_description":"<p>Are you looking to grow your business, increase sales, improve market place penetration, introduce a new product or service or simply improve your bottom line then this fast paced, fun, and interactive introduction to growth planning will be perfect for you.  Are you a Wolverhampton business in the manufacturing sector, forward thinking, actively looking for growth or on the cusp of investing in your growing business.<\/p>\n<p>We will showcase the successes of companies who have implemented successful Growth Plans and secured financial support, and who were in the first cohort of the AIM for GOLD Programme.<\/p>\n<p>We will share with you how you could apply for a grant of up to £20,000 to help unlock your businesses growth potential, and where else you could get funding.<\/p>\n<p>You will meet some of the businesses who have already been awarded their funding, learn about the different elements of the programme, and be given the opportunity to register your interest in being part of cohort 3.  <\/p>\n<p>The event is aimed at manufacturing SMEs in Wolverhampton.  <\/p>\n<p>What will attendees gain?<\/p>\n<ul><li>An understanding of the value of Growth Planning<\/li><li>What makes a great Growth Plan - increase sales, secure new markets, and or develop new products and services<\/li><li>Details of the AIM for GOLD Growth and Grant Programme<\/li><li>Options to finance growth<\/li><\/ul>\n<p>Agenda: <\/p>\n<p>9.00am - Event commences<\/p>\n<p>Growth Planning: the key elements - Glenn Watts<\/p>\n<p>Growth Planning: value to the business - Gabitie and PGO Ltd<\/p>\n<p>Finance options and the AIM for GOLD Growth Planning Programme - Jay Patel<\/p>\n<p>10.00am Close<\/p>\n<p>Speakers: <\/p>\n<p>Glenn Watts - Growth Specialist<\/p>\n<p>Grant Bond - owner Gabitie<\/p>\n<p>Ian Dixon - MD PGO Ltd<\/p>\n<p>Jay Patel - Finance Specialist<\/p>","longitude":0,"latest_end_local":"09 Oct 2020 10:00:00","earliest_end_local":"09 Oct 2020 10:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"09 Oct 2020 09:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Advanced Manufacturing"}]},{"name":"Date","options":[{"name":"09\/10\/20"}]}],"description":""},{"earliest_start_utc":"09 Oct 2020 08:30:00","slug":"the-future-of-manufacturing-make-uk","venue_name":"Private","venue_city":"","latest_end_utc":"09 Oct 2020 10:30:00","earliest_start_local":"09 Oct 2020 09:30:00","url":"https:\/\/bcbf20.ticketleap.com\/the-future-of-manufacturing-make-uk\/dates\/Oct-09-2020_at_0930AM","venue_street":"","latest_start_local":"09 Oct 2020 09:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/8b68db7b-05e5-4aa5-a774-65b320b66f05\/hero.jpg","latitude":0,"latest_start_utc":"09 Oct 2020 08:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/8b68db7b-05e5-4aa5-a774-65b320b66f05\/full.jpg","name":"The Future of Manufacturing – Make UK in Conversation with Sector Leaders ONLINE","id":"40d9787c-e074-11ea-919f-22000a3fd8f5","html_description":"<p>What is the future of manufacturing? What is your business doing to recover? How are you improving productivity? What are West Midlands Manufacturers growth plans? These are just some of the questions that we will be exploring at the Make UK hosted virtual West Midlands Regional Advisory Board Black Country Special. We will be joined by over 30 Make UK members and senior manufacturing leaders, which will be chaired by the Chief Executive Officer of James Lister and Sons a Black Country manufacturing business. We will also be specially joined by industry leading speakers from Make UK, The Manufacturing Technology Centre, Warwick Manufacturing Group and Midlands Manufacturing Commission.  <\/p>\n<p><strong>This event is exclusively aimed at Director and Board level manufacturing leaders of all sized businesses of Make UK members and other Black Country Manufacturers. <\/strong>Attendants will have the opportunity to hear from industry leading experts and manufacturing business leaders on the future of manufacturing, overcoming contemporary challenges and their longer term growth plans. Make UK reserves the right approve your attendance, in order to ensure a manufacturing and business leader cohort is present.  <\/p>\n<p>In hearing from Make UK, industry experts and manufacturing business leaders you will learn:<\/p>\n<ul><li>An insight into Make UK's work with Government and Regional governing bodies<\/li><li>Hear Industry wide insight into contemporary challenges and future growth strategies<\/li><li>Learn manufacturing business best practice<\/li><li>Create Manufacturing leaders peer-to-peer connections<\/li><li>West Midlands Manufacturing plans and capabilities<\/li><\/ul>\n<p><strong>Agenda: <\/strong><\/p>\n<p>- Welcome from Make UK's Midlands &amp; East Regional Director Charlotte Horobin and West Midlands member Chair Pete Davies Chief Executive Officer of James Lister and Sons.<\/p>\n<p>- Hear from a panel of Industry experts from Make UK, The Manufacturing Technology Centre, Warwick Manufacturing Group and Midlands Manufacturing Commission. <\/p>\n<p>-Roundtable discussion with senior manufacturing leaders in the West Midlands and Black Country.<\/p>\n<p><strong>Hosts: <\/strong><\/p>\n<p>Charlotte Horobin, Region Director, Midlands and East of England at Make UK<\/p>\n<p>Chris Corkan, Regional Membership Manager, Midlands and East of England at Make UK<\/p>\n<p>Peter Davies, Chief Executive Officer at James Lister and Sons and Chair of the Make UK West Midlands Regional Advisory Board<\/p>\n<p>Rowan Crozier, Chief Executive Officer at Brandauer and Vice-Chair of the Make UK West Midlands Regional Advisory Board<\/p>\n<p><strong>Guest Speakers:<\/strong><\/p>\n<p>Stephen Phipson, Make UK, CEO<\/p>\n<p>Stephen Phipson is the Chief Executive of Make UK, the manufacturers’ organisation. Stephen became Chief Executive of Make UK in 2017 having previously held the position of Head of the Defence and Security Organisation within the Department for International Trade delivering support to UK defence and security businesses. Prior to this Stephen held the position of Director for Security Industry Engagement within the Office for Security and Counter Terrorism at the Home Office where he was the Senior Responsible Owner within Government for the UK security industry.<\/p>\n<p>Professor David Bailey, Senior Fellow, UK in a Changing Europe Programme ad Birmingham Business School<\/p>\n<p>Chris White, Director of Industrial Policy and Insight Executive at The Manufacturing Technology Centre<\/p>\n<p>Professor Jan Godsell, Operations and Supply Chain Strategy, at Warwick Manufacturing Group (WMG)<\/p>","longitude":0,"latest_end_local":"09 Oct 2020 11:30:00","earliest_end_local":"09 Oct 2020 11:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"09 Oct 2020 10:30:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Advanced Manufacturing"}]},{"name":"Date","options":[{"name":"09\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"09 Oct 2020 09:00:00","slug":"commercial-contracts--common-pitfalls-and-how-to-avoid-them","venue_name":"Private","venue_city":"","latest_end_utc":"09 Oct 2020 10:00:00","earliest_start_local":"09 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/commercial-contracts--common-pitfalls-and-how-to-avoid-them\/dates\/Oct-09-2020_at_1000AM","venue_street":"","latest_start_local":"09 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/3631af1c-2b68-4fb2-ad3c-e63596099602\/hero.jpg","latitude":0,"latest_start_utc":"09 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/3631af1c-2b68-4fb2-ad3c-e63596099602\/full.jpg","name":"Commercial contracts – common pitfalls and how to avoid them ONLINE","id":"97c70ca2-6465-11ea-b4c2-22000a41f88b","html_description":"<p>Contracts are the life blood of your business, but given the vital nature of these documents you need to be sure they are delivering exactly what you require. The event is aimed at owner-managers, senior managers, directors , contracts managers and all those with a responsibility for running a business in any sector. This key seminar facilitated by experts from Higgs &amp; Sons’ Commercial team drills into what makes a good contract, whilst highlighting some of the common pitfalls you need to be aware of before signing on the dotted line.<\/p>\n<p>Speakers: Laura Pearson, Higgs &amp; Sons<\/p>","longitude":0,"latest_end_local":"09 Oct 2020 11:00:00","earliest_end_local":"09 Oct 2020 11:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"09 Oct 2020 10:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Professional Services"}]},{"name":"Date","options":[{"name":"09\/10\/20"}]}],"description":""},{"earliest_start_utc":"09 Oct 2020 09:00:00","slug":"improving-business-through-structured-project-management--lean-","venue_name":"Private","venue_city":"","latest_end_utc":"09 Oct 2020 11:00:00","earliest_start_local":"09 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/improving-business-through-structured-project-management--lean-\/dates\/Oct-09-2020_at_1000AM","venue_street":"","latest_start_local":"09 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/075ed2dc-5c17-4b5c-9f27-37ae40a1fc9b\/hero.jpg","latitude":0,"latest_start_utc":"09 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/075ed2dc-5c17-4b5c-9f27-37ae40a1fc9b\/full.jpg","name":"Improving business through structured Project Management & LEAN Six Sigma","id":"0d394366-6dbb-11ea-80c0-22000bb24b5c","html_description":"<p>Many businesses face ongoing challenges delivering projects successfully, from planning the Scope, to deliver it within Schedule and Costs agreed. A structured project management framework will help plan and deliver projects successfully. Also, applying principles of LEAN and Six Sigma will help businesses deliver their objectives cost efficiently and effectively, with great customer focus. This masterclass with provide businesses with a overview on Key Project Management principles to implement\/improve, along with easy to apply LEAN Six Sigma techniques for every day business. <\/p>\n<p>This event can be attended by delegates from every sector, at every level of the organization, who is keen to get better. <\/p>\n<p>This masterclass with provide delegates with a overview on Key Project Management principles to implement\/improve, along with easy to apply LEAN Six Sigma techniques for every day business.<\/p>\n<p>Delegates will also receive top tips helping them in defining a roadmap for the improvement journey.<\/p>\n<p><strong>Agenda:<\/strong><\/p>\n<p>10:00 - 10:10am - Presentation: Introduction and typical challenges faced<\/p>\n<p>10:10 - 10:55am - Structured Project Management framework principles<\/p>\n<p>10:55 - 11:05am - Break<\/p>\n<p>11:05 - 11:50am - Presentation: LEAN and Six Sigma<\/p>\n<p>11:50 - 12:00 noon - Q&amp;A and closure<\/p>\n<p><strong>Speaker: <\/strong><\/p>\n<p>Ravi Vetsa, Director<\/p>\n<p>Ravi is an experienced and Certified Project Management Practitioner, Six Sigma Coach\/Mentor\/Trainer.<\/p>","longitude":0,"latest_end_local":"09 Oct 2020 12:00:00","earliest_end_local":"09 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"09 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Professional Services"}]},{"name":"Date","options":[{"name":"09\/10\/20"}]}],"description":""},{"earliest_start_utc":"09 Oct 2020 10:00:00","slug":"the-time-is-now---invest-dudley","venue_name":"Private","venue_city":"","latest_end_utc":"09 Oct 2020 11:00:00","earliest_start_local":"09 Oct 2020 11:00:00","url":"https:\/\/bcbf20.ticketleap.com\/the-time-is-now---invest-dudley\/dates\/Oct-09-2020_at_1100AM","venue_street":"","latest_start_local":"09 Oct 2020 11:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/c0d1c28e-4700-4aa1-8af8-c7febb15f6d8\/hero.jpg","latitude":0,"latest_start_utc":"09 Oct 2020 10:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/c0d1c28e-4700-4aa1-8af8-c7febb15f6d8\/full.jpg","name":"The Time is Now - Invest Dudley ONLINE","id":"ff279778-dd63-11ea-bd47-22000a71d448","html_description":"<p>Find out why ‘The Time is Now’ to Invest in Dudley, from the council's director of regeneration and enterprise.  This event will promote opportunities across the borough of Dudley, and demonstrate the multitude of projects coming to fruition which will improve Dudley and the Black County. This event is aimed at investors and local businesses who want to know more about regeneration projects and investment opportunities across the borough.  Be the first to hear about projects and find out how you can get involved.<\/p>\n<p><strong>Speakers: <\/strong><\/p>\n<p>Helen Martin - Director of Regeneration and Enterprise, Dudley Council<\/p>\n<p>Paul Mountford - Head of Planning and Regeneration, Dudley Council<\/p>\n<p> <\/p>","longitude":0,"latest_end_local":"09 Oct 2020 12:00:00","earliest_end_local":"09 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"09 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Property & Construction"}]},{"name":"Date","options":[{"name":"09\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"09 Oct 2020 13:30:00","slug":"going-paperless-buzzword-or-reality","venue_name":"Private","venue_city":"","latest_end_utc":"09 Oct 2020 15:30:00","earliest_start_local":"09 Oct 2020 14:30:00","url":"https:\/\/bcbf20.ticketleap.com\/going-paperless-buzzword-or-reality\/dates\/Oct-09-2020_at_0230PM","venue_street":"","latest_start_local":"09 Oct 2020 14:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/400dc3b6-40cf-4044-a165-71477416ddc2\/hero.jpg","latitude":0,"latest_start_utc":"09 Oct 2020 13:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/400dc3b6-40cf-4044-a165-71477416ddc2\/full.jpg","name":"Going Paperless: Buzzword or Reality ONLINE","id":"07a1ac32-651d-11ea-bc48-22000a41f88b","html_description":"<p>We will explore how adaptability and automation will help you go paperless to create efficiencies and new costs savings.<\/p>\n<p>We will unravel the mysteries that will help you to become a paper 'lite' working environment. The world of print is changing and we have pieced all the clues together for you. Let’s solve this together. We want to educate you on how to scale process improvement and gain efficiencies across the enterprise. This event is aimed at innovators, Managing Directors, Finance Directors and Business Leaders within SMEs across the Black Country. Primarily this event will attract businesses that don’t know where to start when it comes to going paperless with their printing. We will explore the standard practices within businesses and by the end of the event attendees will have a clear understanding of what steps to take to reduce their print and improve their sustainability. <\/p>\n<p>Firstly, every attendee will get a free paper audit from one of our independent consultants. Secondly have you considered a paperless future? This event will help you to become more innovative in your strategies and how to improve relationships with your customers, utilising technology to drive the change. Come and learn how to ensure process control better, help promote faster processing and better business decision making, while reducing the costs across the business. This can be a ‘land and expand’ approach, or ‘big bang’ enterprise wide from day one. Let us help you become paper 'lite' across your organisation- allowing you to concentrate more on the customer and not the paper.<\/p>\n<p> <\/p>","longitude":0,"latest_end_local":"09 Oct 2020 16:30:00","earliest_end_local":"09 Oct 2020 16:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"09 Oct 2020 15:30:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."},{"name":"Advanced Manufacturing"}]},{"name":"Date","options":[{"name":"09\/10\/20"}]}],"description":""},{"earliest_start_utc":"09 Oct 2020 13:30:00","slug":"reviving-retail-with-hugglepets","venue_name":"Private","venue_city":"","latest_end_utc":"09 Oct 2020 14:30:00","earliest_start_local":"09 Oct 2020 14:30:00","url":"https:\/\/bcbf20.ticketleap.com\/reviving-retail-with-hugglepets\/dates\/Oct-09-2020_at_0230PM","venue_street":"","latest_start_local":"09 Oct 2020 14:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/9425b96c-8fbb-48ef-848b-ecb32c2671ae\/hero.jpg","latitude":0,"latest_start_utc":"09 Oct 2020 13:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/9425b96c-8fbb-48ef-848b-ecb32c2671ae\/full.jpg","name":"Reviving Retail with HugglePets ONLINE","id":"8927da64-650f-11ea-841a-22000a9bc419","html_description":"<p>Our workshop will be held online for an one hour, where we will share our top hints and tips in building a sustainable business in the retail sector. Our Director Mike will share with you his creative approach to high street regeneration by sharing his story of building the HugglePets brand across the UK. <\/p>\n<p>This event is aimed at people who either starting a business or are keen to enhance and grow their businesses, either on or offline. Attendees will be able to look behind the scenes of HugglePets rapid growth in the sector and have insight into our innovative top tips and hints on sustainable growth of their business. <\/p>\n<p>Agenda: <\/p>\n<ul><li>Welcome &amp; Introductions<\/li><li>HugglePets - Our Story so far<\/li><li>Top Tips and Hints for a Sustainable Retail Model<\/li><li>Question and Answers<\/li><li>Close<\/li><\/ul>\n<p>Speakers: <\/p>\n<p>Mike Dixon, Director of HugglePets<\/p>\n<p>(Signature Business Award Winner &amp; eBay Events Speaker)<\/p>","longitude":0,"latest_end_local":"09 Oct 2020 15:30:00","earliest_end_local":"09 Oct 2020 15:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"09 Oct 2020 14:30:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Retail, Tourism & Hospitality"}]},{"name":"Date","options":[{"name":"09\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"12 Oct 2020 08:00:00","slug":"a-new-age-of-advertising--marketing-how-to-tell-your-companys-s","venue_name":"Private","venue_city":"","latest_end_utc":"12 Oct 2020 11:00:00","earliest_start_local":"12 Oct 2020 09:00:00","url":"https:\/\/bcbf20.ticketleap.com\/a-new-age-of-advertising--marketing-how-to-tell-your-companys-s\/dates\/Oct-12-2020_at_0900AM","venue_street":"","latest_start_local":"12 Oct 2020 09:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/e0ca61d7-7f06-40fa-bc9d-fe86f78283a9\/hero.jpg","latitude":0,"latest_start_utc":"12 Oct 2020 08:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/e0ca61d7-7f06-40fa-bc9d-fe86f78283a9\/full.jpg","name":"A New Age of Advertising & Marketing: How to Tell Your Company’s Story ONLINE","id":"3c25d360-6780-11ea-9a97-22000a9bc419","html_description":"<p>From cave walls to Facebook walls, humans have been telling stories since before we could even speak. Hear about how the concept of ‘Branded Entertainment’ can transform the way you communicate with your target audience and workshop ideas for your new marketing activities.<\/p>\n<p>This event is for any Business Owner, Advertiser or Marketer looking for novel and innovative ways to communicate their products, services or values in the age of streaming and social media.  If you have a business with a marketing, advertising or CSR budget (monolithic or microscopic) we guarantee you’ll go away with at least ONE creative idea for communicating with an audience that includes your target buyer.<\/p>\n<p>In an age of social media, storytelling is a persuasive way to communicate the essence of your brand or organisation and demonstrate your relevance in the life of your target market. This is where Branded Entertainment can help.<\/p>\n<p><strong>WHAT IS BRANDED ENTERTAINMENT AND HOW CAN YOU AFFORD TO DO IT?<\/strong><\/p>\n<p>Whether you sell wall brackets, wedding cakes or wellington boots, we’ll help you rethink your approach to advertising and marketing. You might be a charity in need of volunteers or donations, a venue hosting a range of events or a professional services firm, Branded Entertainment offers the opportunity to tell your story in an engaging way which will connect you to your target market.<\/p>\n<p>Infinite Wisdom Studios is a creative storytelling company that was founded in the Black Country over a decade ago. It’s worked with Hollywood Studios and British institutions like the BBC, to big brands such as Oxfam and Jaguar Land Rover, right through to SMEs and local businesses. It’s seeking to encourage the conversation around ‘Branded Entertainment’ and work with SMEs to support new stories that can promote their businesses locally and nationally.<\/p>\n<p>Birmingham Business School and Katharina Stolley have been undertaking research on the development and application of Branded Entertainment. Together they have developed an interactive workshop where businesses can interact with creative producers to identify their story and explore what Branded Entertainment can do for them. It’s time to stop spending all those marketing budgets on adverts! If you want to find out why, come and hear our story.<\/p>\n<p><strong>WHO SHOULD ATTEND?<\/strong><\/p>\n<p>Since cavemen painted pictures, and early settlers gathered around campfires to tell stories, humans have been captivated by well told stories. In the age of Netflix, YouTube, Alexa, eBooks, Instagram and Twitter there are more ways than ever before to reach audiences through sound, picture and the written word. Whether you’re a self-starter, a medium sized business, a charity or a non-profit organisation with an Advertising &amp; Marketing Team, we invite you to attend this FREE Storytelling Workshop. <\/p>\n<p>As part of the day we’ll help inspire and suggest NEW ways to tell your story, or find ways to be a part of someone else’s. Whether you’re looking to generate new customer relationships or strengthen your bond with your existing clients, we’ll show you how to be relevant, think about your company’s role in “The Story” and ensure your communications reflect the values and beliefs of your brand. During the event you’ll workshop ideas together with other businesses and creatives.  <\/p>\n<p><strong>AGENDA: <\/strong><br>09:00-09:30: Introduction: What is Branded Entertainment?<br>09:30-10:00: Finding Your Story: How can you apply its principals?<br>10:00-10:30: Comfort Break &amp; Virtual Networking<br>10:30-11:30: Development Lab: Bringing Your Stories to Life<br>11:30-12:00: Close &amp; Next Steps  <\/p>\n<p><strong>SPEAKERS:<\/strong><br><em>MICHAEL FORD<\/em> - Producer, Infinite Wisdom Studios<\/p>\n<p>Wolverhampton-born Michael is an experienced drama producer working with national and global broadcasters including ViacomCBS and BBC. In recent years he has specialised in children’s and family content.<\/p>\n<p><em>LAUREN BURNHAM<\/em> &amp; <em>EMILY KIRKHAM<\/em> - Founders, Prickly Peach Films<\/p>\n<p>Prickly Peach is a multi-Royal Television Society award-winning content agency producing branded video productions for SMEs, and music videos for independent artists and labels.<\/p>\n<p><em>TIM LUFT<\/em> - Director, Virtual Reality Simulation Systems<\/p>\n<p>Tim is a veteran of the tech sector and creative advisor on the new immersive storytelling programme from Create Central, employing new technologies to entertain and inform audiences.<\/p>\n<p><br><em>MORE SPEAKERS TO BE ANNOUNCED (PLEASE WATCH FOR UPDATES)<\/em><\/p>","longitude":0,"latest_end_local":"12 Oct 2020 12:00:00","earliest_end_local":"12 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"12 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"12\/10\/20"}]}],"description":""},{"earliest_start_utc":"12 Oct 2020 08:30:00","slug":"building-teams-in-an-age-of-uncertainty","venue_name":"Wolverhampton Technology Centre","venue_city":"Wolverhampton","latest_end_utc":"12 Oct 2020 11:30:00","earliest_start_local":"12 Oct 2020 09:30:00","url":"https:\/\/bcbf20.ticketleap.com\/building-teams-in-an-age-of-uncertainty\/dates\/Oct-12-2020_at_0930AM","venue_street":"Wolverhampton Science Park","latest_start_local":"12 Oct 2020 09:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/0aefa8c2-3bf3-4c69-8b95-5dfebf992d03\/hero.jpg","latitude":0,"latest_start_utc":"12 Oct 2020 08:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/0aefa8c2-3bf3-4c69-8b95-5dfebf992d03\/full.jpg","name":"Building teams in an age of uncertainty","id":"d2afb94c-6a99-11ea-808f-22000a2be246","html_description":"<p>There is no doubt we are in uncharted waters. There is no rule book for the current business environment. But this was true before the current crisis. Owing to the rapid technological, cultural and economic change we are having to rethink how we build, manage and develop groups of people to meet company goals whilst achieving their personal aspirations. We talk a lot about the performance of individuals, but usually when we measure teams we look at the individual performance of the manager and hold them accountable for the team performance. But are we missing something about how we have designed the team in the first place? And is there something we could do to help managers, individuals and the company itself perform better by looking at the organisations we have created? This highly interactive workshop is designed to help you to operate and grow during times of uncertainty. You will learn the importance of understanding the diverse skills and qualities of your teams that will allow them to be effective in times of uncertainty and change.<\/p>\n<p>The event is aimed at SME, Senior Managers, Departmental Managers and HR Managers. Attendees will be able to learn how to capture and utilise the skills and qualities of their teams in order to operate and thrive during times of uncertainty.<\/p>\n<p>This 3 hour session includes business simulations and case studies to consider the following:<\/p>\n<ul><li>What is a team?<\/li><li>Building a team to cope.<\/li><li>Developing a team to compete.<\/li><li>Getting teams to work together to excel.<\/li><li>Ending, merging and refining a team purpose to adapt and change effectively.<\/li><\/ul>\n<p>Speaker: Mike Ryan, Tutor, Gecko Programmes<\/p>","longitude":0,"latest_end_local":"12 Oct 2020 12:30:00","earliest_end_local":"12 Oct 2020 12:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"12 Oct 2020 11:30:00","venue_postal_code":"WV10 9RU","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"},{"name":"Wolverhampton"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"12\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"12 Oct 2020 09:00:00","slug":"life-after-furlough---the-end-of-a-beautiful-relationship","venue_name":"Private","venue_city":"","latest_end_utc":"12 Oct 2020 10:00:00","earliest_start_local":"12 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/life-after-furlough---the-end-of-a-beautiful-relationship\/dates\/Oct-12-2020_at_1000AM","venue_street":"","latest_start_local":"12 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/6a6d81b8-acfb-4ba9-903d-583c5bf0e64f\/hero.jpg","latitude":0,"latest_start_utc":"12 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/6a6d81b8-acfb-4ba9-903d-583c5bf0e64f\/full.jpg","name":"Life after Furlough - the end of a beautiful relationship ONLINE","id":"1e5177d8-b486-11ea-83d5-22000ab52675","html_description":"<p>What are the options for employers as the government's furlough scheme comes to an end? Redundancies, restructuring and a new world of work will face many businesses as we emerge from the effects of the Covid19 pandemic.  The event is aimed at all those involved in managing employees and who have needed to access the government's furlough scheme.  Attendees will gain an insight into how the government plans to wind down its furlough scheme and an insight to how the world of work will be affected. <\/p>\n<p>Learn how to position your business and workforce for a post-Covid world. Find out why Covid-19 has had such a huge impact on the workplace and what you can do about it. Network with HR professionals and other peoples managers.<\/p>\n<p>Agenda<\/p>\n<p>* The HR and legal challenges that lie ahead for employers after the end of the government's furlough scheme. <\/p>\n<p>*The 5 key HR steps all employers should take as the furlough scheme ends<\/p>\n<p> * The challenges that lie ahead - reorganisations and redundancy planning<\/p>\n<p>* The new world of work: remote working - is it so great? How do we manage it?<\/p>\n<p>* The need for effective leadership - what does that look like?<\/p>\n<p>Speaker <\/p>\n<p>Simon Bond Director, Bond Legal Ltd<\/p>\n<p> <\/p>","longitude":0,"latest_end_local":"12 Oct 2020 11:00:00","earliest_end_local":"12 Oct 2020 11:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"12 Oct 2020 10:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Date","options":[{"name":"12\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]},{"name":"Sectors","options":[{"name":"Professional Services"}]},{"name":"Sector","options":[{"name":"Professional Services"}]},{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Date","options":[{"name":"09\/11\/2020"}]}],"description":""},{"earliest_start_utc":"12 Oct 2020 13:00:00","slug":"property-matters","venue_name":"Private","venue_city":"","latest_end_utc":"12 Oct 2020 15:00:00","earliest_start_local":"12 Oct 2020 14:00:00","url":"https:\/\/bcbf20.ticketleap.com\/property-matters\/dates\/Oct-12-2020_at_0200PM","venue_street":"","latest_start_local":"12 Oct 2020 14:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/d769c4d6-5634-403e-ae1d-552da496898a\/hero.jpg","latitude":0,"latest_start_utc":"12 Oct 2020 13:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/d769c4d6-5634-403e-ae1d-552da496898a\/full.jpg","name":"Property Matters ONLINE","id":"60781a4a-6517-11ea-aaa8-22000a5bfa21","html_description":"<p>Whether you are a developer, contractor, investor or landlord, this seminar will cover a range of property related topics that will ensure your business is up to date with all the latest sector developments. The event is aimed at property sector professionals including developers, contractors, investors and commercial landlords. Highlighting the very best practice, this seminar will ensure your ‘house is in order’ when it comes to achieving success in the property arena. Experts from Higgs’ Property Services team will look at a number of key issues pertinent to property professionals:<\/p>\n<p>- Considerations when developing property – what structure works best; issues which may arise and how to manage these; procurement and construction of the development;<\/p>\n<p>- Leasing property – common misconceptions and what you really need to know;<\/p>\n<p>- Funding and property finance – understanding the expectations of funders in respect of the development.<\/p>","longitude":0,"latest_end_local":"12 Oct 2020 16:00:00","earliest_end_local":"12 Oct 2020 16:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"12 Oct 2020 15:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Property & Construction"}]},{"name":"Date","options":[{"name":"12\/10\/20"}]}],"description":""},{"earliest_start_utc":"12 Oct 2020 15:00:00","slug":"business-model-automation","venue_name":"Private","venue_city":"","latest_end_utc":"12 Oct 2020 17:00:00","earliest_start_local":"12 Oct 2020 16:00:00","url":"https:\/\/bcbf20.ticketleap.com\/business-model-automation\/dates\/Oct-12-2020_at_0400PM","venue_street":"","latest_start_local":"12 Oct 2020 16:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/7b501325-789b-409a-b217-d9ddfd18f88f\/hero.jpg","latitude":0,"latest_start_utc":"12 Oct 2020 15:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/7b501325-789b-409a-b217-d9ddfd18f88f\/full.jpg","name":"Business Model Automation ONLINE","id":"7e7aae44-6aa4-11ea-8c4d-22000ab736e2","html_description":"<p>Mapping your Business Model in 5 Steps, and using various technologies better. The event is aimed for businesses across all sectors who are looking for digital solutions to the challenges they face in business planning, day-to-day running and long term delivery. This workshop session will take delegates through the essentials of mapping a business model. Then through the use of freely available tools, create a technology roadmap to address and solve your business challenges.<\/p>\n<p>The new SOLVD project team at University of Wolverhampton will be available to advise on support and funding available.<\/p>","longitude":0,"latest_end_local":"12 Oct 2020 18:00:00","earliest_end_local":"12 Oct 2020 18:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"12 Oct 2020 17:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"12\/10\/20"}]}],"description":""},{"earliest_start_utc":"12 Oct 2020 15:30:00","slug":"charity-partnerships---working-together-making-a-difference","venue_name":"Private","venue_city":"","latest_end_utc":"12 Oct 2020 17:30:00","earliest_start_local":"12 Oct 2020 16:30:00","url":"https:\/\/bcbf20.ticketleap.com\/charity-partnerships---working-together-making-a-difference\/dates\/Oct-12-2020_at_0430PM","venue_street":"","latest_start_local":"12 Oct 2020 16:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/1e0f2273-8ea5-49c2-909d-38b192842469\/hero.jpg","latitude":0,"latest_start_utc":"12 Oct 2020 15:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/1e0f2273-8ea5-49c2-909d-38b192842469\/full.jpg","name":"Charity Partnerships - Working together, making a difference ONLINE","id":"3c7ac5e6-62b2-11ea-8aca-22000b6d80dc","html_description":"<p>Charity fundraising is an ideal way to integrate team building exercises and staff development into your company. Smart charities recognise that each business is different; that you have busy lives and don't always have the time to think up new ideas.  We want to show you how, by tapping into a charity's ideas, attending their events, using their marketing, a company can really make a difference to their local community and still fulfill their own goals.  <\/p>\n<p>The event is aimed at business leaders who may get enthusiastic about working with a charity. Staff, at any level, who already organise their companies fundraising who are looking at new and exciting ways of getting involved. Anyone interested in making a difference to their local environment.  <\/p>\n<p>Attendees will gain an understanding of the level of support offered by local charities. How charity partnerships can be invaluable to raising the profile of their chosen charity. The social media, and pr benefits of attending charity events. The extent of resources available to support the smooth running of company run charity events. They will see a full calendar of exciting events and campaigns that they can engage with that require minimal planning, and maximum benefits, to the company. There will also be an insight to how charitable funds make a difference to our hospital.<\/p>\n<p>Agenda:<\/p>\n<p>Opening from Chief Executive or senior Director<\/p>\n<p>Talks from 2 medical consultants about the benefits of large donations<\/p>\n<p>Talks from 2 corporate partners (one solicitor and one charitable grant foundation)<\/p>\n<p>Talk from the Fundraising Manager showing how easy it is to get involved<\/p>\n<p>Close<\/p>\n<p>Speakers: <\/p>\n<p>Senior Director of Trust Staff<\/p>\n<p>2 Medical Consultants<\/p>\n<p>2 Corporate Partners<\/p>\n<p>Karen Phillips, Fundraising Manager<\/p>","longitude":0,"latest_end_local":"12 Oct 2020 18:30:00","earliest_end_local":"12 Oct 2020 18:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"12 Oct 2020 17:30:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Professional Services"}]},{"name":"Date","options":[{"name":"12\/10\/20"}]}],"description":""},{"earliest_start_utc":"13 Oct 2020 08:00:00","slug":"an-introduction-to-scrum-and-agile-methods","venue_name":"Private","venue_city":"","latest_end_utc":"13 Oct 2020 11:00:00","earliest_start_local":"13 Oct 2020 09:00:00","url":"https:\/\/bcbf20.ticketleap.com\/an-introduction-to-scrum-and-agile-methods\/dates\/Oct-13-2020_at_0900AM","venue_street":"","latest_start_local":"13 Oct 2020 09:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/c24dfb0b-9b14-424b-b497-65ac01ea347f\/hero.jpg","latitude":0,"latest_start_utc":"13 Oct 2020 08:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/c24dfb0b-9b14-424b-b497-65ac01ea347f\/full.jpg","name":"An introduction to Scrum and Agile methods ONLINE","id":"b35a0c4c-5a35-11ea-b150-22000b6902b0","html_description":"<p>A brief Introduction to Scrum and Agile - the core concepts of lean and agile working and how these can be applied in any business to transform the world of work.  If you are a team in charge of delivering a product or project; an individual preparing to work with or on an agile team; a project manager entering the Agile environment; or someone who just wants to learn what all the fuss is about with Agile and Scrum; this course is perfect for you!<\/p>\n<p>Sectors: IT industry, NHS, Banking, Insurance, Education. The session will introduce the core concepts of lean and agile working and show how these can be applied in any business to transform the world of work.  <\/p>\n<p>This informative workshop will provide details on:<\/p>\n<p>• Introduction to Scrum, The Agile Manifesto and Principles.<\/p>\n<p>• When do we use Scrum?<\/p>\n<p>• The Scrum Framework.<\/p>\n<p>• How to use Scrum in non-software situations.<\/p>\n<p>There will be opportunity at the end of the workshop for Q&amp;A.<\/p>\n<p>Speaker: <\/p>\n<p>Karl Royle: Karl is a Certified Scrum Professional and has been working with agile since 2010.<\/p>\n<p>He is an Agile organisational change coach and facilitator. He specialises in using Scrum beyond the domain of software development. <\/p>\n<p>Karl is an Agile and Scrum practitioner and uses Open Space Technology, Scrum and Kanban methodologies to transform project direction in HE. Karl is Head of Enterprise and Commercial Development at the Faculty of Education, Health and Wellbeing where he works in research, development and consultancy working on national training and impact evaluation projects, product development and innovation. His current interests are around the process of knowledge transfer between universities and SMEs and the development of core competencies for enterprise, entrepreneurship and employability.<\/p>","longitude":0,"latest_end_local":"13 Oct 2020 12:00:00","earliest_end_local":"13 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"13 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Professional Services"}]},{"name":"Date","options":[{"name":"13\/10\/20"}]}],"description":""},{"earliest_start_utc":"13 Oct 2020 08:00:00","slug":"access-to-finance-masterclass","venue_name":"Private","venue_city":"","latest_end_utc":"13 Oct 2020 09:00:00","earliest_start_local":"13 Oct 2020 09:00:00","url":"https:\/\/bcbf20.ticketleap.com\/access-to-finance-masterclass\/dates\/Oct-13-2020_at_0900AM","venue_street":"","latest_start_local":"13 Oct 2020 09:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/2208e742-77a7-4caa-9967-ac37bdc5e077\/hero.jpg","latitude":0,"latest_start_utc":"13 Oct 2020 08:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/2208e742-77a7-4caa-9967-ac37bdc5e077\/full.jpg","name":"Access to Finance Masterclass ONLINE","id":"c6313b84-dd65-11ea-b614-22000a930ba7","html_description":"<p>The British Business Bank (BBB) will be holding a briefing event to raise awareness of the £250m Midlands Engine Investment Fund (MEIF) and wider BBB programmes (specifically those developed in response to Covid-19) to provide businesses (and intermediaries supporting businesses) looking to apply to the funds with additional support and information.  <\/p>\n<p>The event is aimed at:<\/p>\n<ul><li>SMEs in the Midlands looking for alternative finance to support their business.<\/li><li>Intermediaries who support the above businesses.<\/li><\/ul>\n<p>Attendees will gain the opportunity to understand more about the funding options available, highlight the fund managers and delivery partners who are deploying funds and meet some fellow businesses who have beneffited from investment from BBB.<\/p>\n<p><strong>Agenda: <\/strong><\/p>\n<p>09.00am - Session begins<\/p>\n<p>09.05am - Welcome and presentation from British Business Bank<\/p>\n<p>09.20am - Debt Panel - ELEM and Maven<\/p>\n<ul><li>ELEM presentation – Victoria Copestake, Business Development Manager – 5 minutes<\/li><li>Maven presentation – Jonathan Lowe, Investment Director – 5 minutes<\/li><li>Q&amp;A Panel – 10 minutes, BBB to lead<\/li><\/ul>\n<p>09.40am - Equity Panel – Mercia and Foresight<\/p>\n<p>10.00am - BBB to close<\/p>\n<p><strong>Speakers: <\/strong><\/p>\n<p>Victoria Copestake, Business Development Manager <\/p>\n<p>Jonathan Lowe, Investment Director<\/p>\n<p> <\/p>","longitude":0,"latest_end_local":"13 Oct 2020 10:00:00","earliest_end_local":"13 Oct 2020 10:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"13 Oct 2020 09:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Professional Services"},{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"13\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"13 Oct 2020 08:00:00","slug":"apprenticeships-in-education-health-and-wellbeing-opening-doors","venue_name":"Private","venue_city":"","latest_end_utc":"13 Oct 2020 16:30:00","earliest_start_local":"13 Oct 2020 09:00:00","url":"https:\/\/bcbf20.ticketleap.com\/apprenticeships-in-education-health-and-wellbeing-opening-doors\/dates\/Oct-13-2020_at_0900AM","venue_street":"","latest_start_local":"13 Oct 2020 09:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/f7beb7f3-707d-48e3-b6ea-dbaa4032d006\/hero.jpg","latitude":0,"latest_start_utc":"13 Oct 2020 08:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/f7beb7f3-707d-48e3-b6ea-dbaa4032d006\/full.jpg","name":"Apprenticeships in Education, Health and Wellbeing: Opening Doors at the University of Opportunity ONLINE","id":"957117ba-5e0f-11ea-aad9-22000b96d04c","html_description":"<p>Come and find out more about the Higher and Degree Apprenticeships that are currently being offered and in development at the Faculty of Education, Health and Wellbeing at the University of Wolverhampton.  Subject-specific workshops will be held throughout the day and delegates can 'drop-in' for sessions most relevant to their profession or attend for the whole day to access information relating to funding, contracting and workforce development.  <\/p>\n<p>The event is aimed at: <\/p>\n<ul><li>Employers who are already supporting apprentices on Teaching, Nursing Associate, Registered Nurse Degree, and Social Work Apprenticeship programmes at the University of Wolverhampton.  Employers interested in future apprenticeships being offered within the Faculty; Advanced Clinical Practitioner, District Nurse, Public Health Practitioner, Specialist Community and Public Health Nurse, Midwife, Occupational Therapist.<\/li><li>Prospective\/new employers who wish to explore current and future apprenticeship programmes offered by the Faculty of Education, Health and Wellbeing.<\/li><li>NHS organisations, GP practices, Clinical Commissioning Groups (CCGs), Nursing Homes, Independent Health\/Social Care providers, prospective applicants working in healthcare\/social care settings, Care Organisations.<\/li><li>Potential applicants who are interested in completing an apprenticeship at the University of Wolverhampton within the Faculty of Education, Health and Wellbeing.  <\/li><\/ul>\n<p>Find out more about the Higher and Degree Apprenticeships that are currently being offered and in development at the Faculty of Education, Health and Wellbeing at the University of Wolverhampton; programme structure, curriculum, content, requirements for employers, requirements for apprentices, recruitment timelines, admission and contracting process. Information about the Apprenticeship Levy, non-Levy employers, gifting the levy, sub-contracting.<\/p>\n<p>Agenda: Full schedule to be confirmed - workshops for each subject area will be available throughout the day. Attendees can 'drop-in' for the workshop most relevant to their profession.<\/p>\n<p>Speaker: Jackie Mitchell, Head of Academic Development - Apprenticeships, Faculty of Education, Health and Wellbeing, University of Wolverhampton<\/p>","longitude":0,"latest_end_local":"13 Oct 2020 17:30:00","earliest_end_local":"13 Oct 2020 17:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"13 Oct 2020 16:30:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Education & Skills"}]},{"name":"Date","options":[{"name":"13\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"13 Oct 2020 09:00:00","slug":"how-to-get-into-uk-rail---session-2-online","venue_name":"Private","venue_city":"","latest_end_utc":"13 Oct 2020 11:00:00","earliest_start_local":"13 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/how-to-get-into-uk-rail---session-2-online\/dates\/Oct-13-2020_at_1000AM","venue_street":"","latest_start_local":"13 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/3d0727eb-051a-4ba2-b886-23a0ce23e061\/hero.jpg","latitude":0,"latest_start_utc":"13 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/3d0727eb-051a-4ba2-b886-23a0ce23e061\/full.jpg","name":"How to Get into UK Rail - Session 2 ONLINE","id":"c5c9b8a4-f0f9-11ea-b2c6-22000b9af1f3","html_description":"<p>How to Supply into the UK Rail Sector.  The event is aimed at manufacturing and engineering SMEs seeking to diversify into the Rail Sector. Suitable for Senior Management, New Product Development professionals and those with responsibility for generating new sales.  Attendees will gain a valuable insight into the structure of the UK Rail Sector, individual consultation by UK Rail specialists and the opportunity to receive 12 hours worth of European funded assistance to help develop your very own Get into Rail Strategy (subject to SME eligibility must be located within Black Country).<\/p>\n<p>Agenda: <\/p>\n<p>The event will be one hour in duration consisting of:<\/p>\n<ul><li>30 Minute Power Point Presentation on Get into Rail<\/li><li>15 Minute Networking and Discussions<\/li><li>1-2-1 Consultations for SMEs and support to sign upnfor Digi Rail support<\/li><\/ul>\n<p>Speakers: <\/p>\n<p>Rachel Eade - Rail Supply Chain Specialist for BCRRE<\/p>\n<p>Alec Gilham - Organisational Development BCRRE<\/p>","longitude":0,"latest_end_local":"13 Oct 2020 12:00:00","earliest_end_local":"13 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"13 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Advanced Manufacturing"}]},{"name":"Date","options":[{"name":"06\/10\/20"}]}],"description":""},{"earliest_start_utc":"13 Oct 2020 09:00:00","slug":"think-sandwell---support-to-recruit-upskill-and-grow-your-busin","venue_name":"Private","venue_city":"","latest_end_utc":"13 Oct 2020 10:00:00","earliest_start_local":"13 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/think-sandwell---support-to-recruit-upskill-and-grow-your-busin\/dates\/Oct-13-2020_at_1000AM","venue_street":"","latest_start_local":"13 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/43a05b1f-7fc7-407a-9c70-46e84f62ce8d\/hero.jpg","latitude":0,"latest_start_utc":"13 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/43a05b1f-7fc7-407a-9c70-46e84f62ce8d\/full.jpg","name":"Think Sandwell - support to recruit, upskill and grow your business ONLINE","id":"65619f9a-de2a-11ea-ad4a-22000a930ba7","html_description":"<p>Sandwell Council's Employment and Skills team ‘Think Sandwell’ provide a one-stop-shop solution for all your recruitment and upskilling needs.  Offering impartial advice on apprenticeships and signposting to funded training, support through the recruitment process from writing job descriptions, sifting candidates and arranging interviews.  Our experienced advisors work across all sectors and at all levels; from entry level jobs to management roles.<\/p>\n<p>Our goal is to support local residents to move into sustainable employment and to gain the skills and qualifications to do so. We do this by partnering with local employers to recruit on their behalf; ensuring that your vacancies are filled with suitably skilled and experienced candidates drawn from our local talent pool.<\/p>\n<p>For employers who want to diversify their workforce and tap into hidden talent, we can provide disability awareness training at no cost to the employer and advice and guidance on employing people with disabilities including how to implement low cost workplace adjustment solutions.<\/p>\n<p>This event will provide a walkthrough guide to our service and a taster of our Disability Awareness training.  <\/p>\n<p>Who is the event aimed at?<\/p>\n<p>We support businesses of all sizes and from all sectors. Anyone looking to take on new staff, diversify their workforce and upskill existing workers will benefit. <\/p>\n<p>What will attendees gain?<\/p>\n<p>The event will offer food for thought on ways to grow, upskill and diversify your workforce.<\/p>\n<p>Learn about how apprenticeships can be utilised to upskill existing staff at little or no increased cost to the business; reducing turnover and improving your employees’ engagement.<\/p>\n<p>Our Specialist Employment team will provide information on how they can support you to increase workforce diversity within your business and meet Corporate Social Responsibility commitments by employing people with disabilities. <\/p>","longitude":0,"latest_end_local":"13 Oct 2020 11:00:00","earliest_end_local":"13 Oct 2020 11:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"13 Oct 2020 10:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"13\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"13 Oct 2020 09:00:00","slug":"thrive-at-work-wellbeing-awards-programme","venue_name":"Private","venue_city":"","latest_end_utc":"13 Oct 2020 10:00:00","earliest_start_local":"13 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/thrive-at-work-wellbeing-awards-programme\/dates\/Oct-13-2020_at_1000AM","venue_street":"","latest_start_local":"13 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/e4cc98a8-4de6-44d0-b37d-2df4dfb273e7\/hero.jpg","latitude":0,"latest_start_utc":"13 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/e4cc98a8-4de6-44d0-b37d-2df4dfb273e7\/full.jpg","name":"Thrive at Work Workplace Wellbeing Awards Programme ONLINE","id":"a82f5530-6f42-11ea-92c5-22000b6d80dc","html_description":"<p>The FREE Thrive at Work Workplace Wellbeing Awards Programme has been created in recognition of the need to ensure our working population is supported – designed to encourage and reward employers for improving the health and wellbeing offer to their employees. Already over 400 organisations are taking advantage of this free programme to help improve their staff's wellbeing. The event will tell you more about the programme and how you can join. <\/p>\n<p>This session is suitable for:<\/p>\n<ul><li>Organisations interested in launching or developing workplace wellbeing initiatives<\/li><li>Health and wellbeing champions<\/li><li>Occupational health and HR managers<\/li><\/ul>\n<p>The Thrive at Work Workplace Wellbeing Awards Programme provides employers a structure, and the tools and resources to improve the health and wellbeing of their employees and ultimately improve productivity and profit.<\/p>\n<p>The new Foundation level consists of an easy 5 step approach, which will give you a comprehensive understanding of the current wellbeing position of the organisation, the mental and physical wellbeing of your workforce and any lasting impacts as a result of the COVID19 pandemic.<\/p>\n<p>It is open to organisations with more than 8 employees across the East and West Midlands. There are no costs in signing up to Thrive at Work. Application is free as is access to the online toolkit resource, accreditation and award.<\/p>\n<p>You will gain a better understanding of:<\/p>\n<ul><li>What is the Thrive at Work Wellbeing Awards Programme?<\/li><li>How it can support your organisation<\/li><li>Getting started with a simple 5 step approach<\/li><\/ul>\n<p><strong>AGENDA<\/strong><\/p>\n<ul><li>What is Thrive at Work?<\/li><li>Background of how Thrive at Work came about?<\/li><li>Impact of poor mental health, Impact mental health has on other aspects of our lives and community<\/li><li>Thrive at Work process, 3 Accreditation levels as well as the recently launched Foundation Level<\/li><li>Themes <\/li><li>Who has signed up to date?<\/li><li>Brief summary <\/li><li>FAQ<\/li><\/ul>\n<p><strong>Speakers: <\/strong><\/p>\n<p>Sharon Lindop – Accreditation Manager<\/p>\n<p>Andrew Rudge – Accreditation Assessor<\/p>\n<p> <\/p>","longitude":0,"latest_end_local":"13 Oct 2020 11:00:00","earliest_end_local":"13 Oct 2020 11:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"13 Oct 2020 10:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Professional Services"},{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"13\/10\/20"}]}],"description":""},{"earliest_start_utc":"13 Oct 2020 09:30:00","slug":"fsbbank-of-england-round-table","venue_name":"Private","venue_city":"","latest_end_utc":"13 Oct 2020 11:00:00","earliest_start_local":"13 Oct 2020 10:30:00","url":"https:\/\/bcbf20.ticketleap.com\/fsbbank-of-england-round-table\/dates\/Oct-13-2020_at_1030AM","venue_street":"","latest_start_local":"13 Oct 2020 10:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/c105980e-4356-47a7-af46-491222b3baa7\/hero.jpg","latitude":0,"latest_start_utc":"13 Oct 2020 09:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/c105980e-4356-47a7-af46-491222b3baa7\/full.jpg","name":"FSB\/Bank of England Round Table ONLINE","id":"2069be1c-e06a-11ea-919f-22000a3fd8f5","html_description":"<p>As part of the Black Country Business Festival 2020, FSB has organised an exclusive Bank of England Round Table Event. You are invited to a talk about the role of the Bank of England and its Financial Stability work with Graeme Chaplin from the Bank of England. This event will help delegates gain a greater understanding of how the Bank of England's Stability work impacts local economic growth and small businesses and aims to provide you with a more in-depth knowledge that could help to inform your decisions for your business moving forward. This is a free-to-attend, exclusive round table event and spaces are strictly limited to just 20 places therefore booking is essential. <\/p>\n<p>The event is aimed at people running their own small business. Attendees will gain a greater understanding of how the Bank of England's stability work impacts local economic growth which could help inform decisions in their own businesses moving forward.  <\/p>\n<p><strong>Speakers: <\/strong><\/p>\n<p>Karen Woolley - FSB Development Manager<\/p>\n<p>Graeme Chaplin - Agent for Bank of England<\/p>","longitude":0,"latest_end_local":"13 Oct 2020 12:00:00","earliest_end_local":"13 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"13 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"13\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"13 Oct 2020 15:00:00","slug":"british-art-show-9-all-you-need-to-know-about-the-additional-th","venue_name":"Private","venue_city":"","latest_end_utc":"13 Oct 2020 18:00:00","earliest_start_local":"13 Oct 2020 16:00:00","url":"https:\/\/bcbf20.ticketleap.com\/british-art-show-9-all-you-need-to-know-about-the-additional-th\/dates\/Oct-13-2020_at_0400PM","venue_street":"","latest_start_local":"13 Oct 2020 16:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/4e563143-4775-423b-8f80-4d814d6c4ddc\/hero.jpg","latitude":0,"latest_start_utc":"13 Oct 2020 15:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/4e563143-4775-423b-8f80-4d814d6c4ddc\/full.jpg","name":"‘British Art Show 9: All you need to know about the additional thousands of visitors coming to the Black Country in 21' ONLINE","id":"a7b23296-6784-11ea-bc48-22000a41f88b","html_description":"<p>Every 5 years the British Art Show Tours 4 UK Cities nationwide. In 2021 Wolverhampton is one of the chosen host cities for British Art Show 9 and we can expect up to 70k people to visit the region. This is a great opportunity for those in retail, tourism and hospitality to find out how they can make the best of linking in with the organisers and maximising opportunities for their businesses to benefit from this footfall. <\/p>\n<p>Who is the event aimed at?<\/p>\n<p>Businesses of all sizes stand to benefit from the influx of visitors to the City. Hospitality, retailers, cafe, pub and restaurant owners, hoteliers, transport providers, entertainment and nightlife and other regional tourist attractions.  <\/p>\n<p>From February to May 2021 Wolverhampton will be hosting ‘British Art Show 9’, the most anticipated exhibition of cutting-edge contemporary art in Britain. The Show will bring thousands of art-lovers to Wolverhampton from across the UK and beyond, putting our cultural offer firmly in the spotlight. British Art Show 8 attracted over 300,000 visitors in its tour to four cities from October 2015 to January 2017, providing valuable footfall and visitor spend to the tourism, hospitality, retail and entertainment businesses. The organisers for the Wolverhampton aspect to the show will outline how you can prepare and benefit from this fantastic opportunity and help to put Wolverhampton on the cultural map.<\/p>\n<p>Speaker: <\/p>\n<p>Maggie Ayliffe, Head of Wolverhampton School of Art<\/p>\n<p>Marguerite Nugent is Manager, Arts and Culture, City of Wolverhampton Council<\/p>\n<p> <\/p>","longitude":0,"latest_end_local":"13 Oct 2020 19:00:00","earliest_end_local":"13 Oct 2020 19:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"13 Oct 2020 18:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."},{"name":"Retail, Tourism & Hospitality"}]},{"name":"Date","options":[{"name":"13\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"13 Oct 2020 16:30:00","slug":"the-national-foundry-training-centre-open-evening","venue_name":"ECMS National Foundry Training Centre","venue_city":"Tipton, Dudley","latest_end_utc":"15 Oct 2020 18:00:00","earliest_start_local":"13 Oct 2020 17:30:00","url":"https:\/\/bcbf20.ticketleap.com\/the-national-foundry-training-centre-open-evening\/dates\/Oct-13-2020_at_0530PM","venue_street":"Tipton Road","latest_start_local":"15 Oct 2020 17:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/3e32cd41-699e-4e74-a4d1-cf079bf6dc86\/hero.jpg","latitude":0,"latest_start_utc":"15 Oct 2020 16:30:00","performance_count":2,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/3e32cd41-699e-4e74-a4d1-cf079bf6dc86\/full.jpg","name":"The National Foundry Training Centre Open Evening","id":"c0458334-5e0c-11ea-be07-22000b228098","html_description":"<p>Join Elite Centre for Manufacturing Skills for a tour of the UK’s only foundry training centre right here in the Black Country.  The event is aimed at manufacturing and engineering businesses with an interest in the foundry and metalforming industries.  ECMS will be showcasing the capabilities of the National Foundry Training Centre including cutting edge casting technologies, Sand Lab and Pattern Workshop. The facilities will also be available for research techniques and commercial usage.  Delegates will see the unique facilities now available through ECMS for specialist foundry training, commercial hire and research.<\/p>\n<p>Agenda: <\/p>\n<p>5:30pm - Snacks and Networking<br>5:50pm - Welcome and Introduction by ECMS<br>6:05pm - CMF Chairman Stuart Gregory - Introduction to Cast Metals Federation<br>6:15pm - Tour Begins - Foundry and Pattern shop , IT Suite and Sand\/Metal Lab<br>7:00pm - Q&amp;A Session<br> <br> <\/p>","longitude":0,"latest_end_local":"15 Oct 2020 19:00:00","earliest_end_local":"13 Oct 2020 19:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"13 Oct 2020 18:00:00","venue_postal_code":"DY4 7UW","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Dudley"}]},{"name":"Sector","options":[{"name":"Advanced Manufacturing"}]},{"name":"Date","options":[{"name":"13\/10\/20"},{"name":"15\/10\/20"}]}],"description":""},{"earliest_start_utc":"13 Oct 2020 17:30:00","slug":"bob-club-360","venue_name":"Light House","venue_city":"Wolverhampton","latest_end_utc":"13 Oct 2020 21:00:00","earliest_start_local":"13 Oct 2020 18:30:00","url":"https:\/\/bcbf20.ticketleap.com\/bob-club-360\/dates\/Oct-13-2020_at_0630PM","venue_street":"The Chubb Buildings, Fryer Street","latest_start_local":"13 Oct 2020 18:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/e4a158a3-7b9a-4da6-b5fc-1a956f82433b\/hero.jpg","latitude":0,"latest_start_utc":"13 Oct 2020 17:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/e4a158a3-7b9a-4da6-b5fc-1a956f82433b\/full.jpg","name":"BOB Club 360","id":"cb4eaf80-6aa0-11ea-808f-22000a2be246","html_description":"<p>An evening of business networking in partnership with Light House and regional Business Over Breakfast club members. The event is aimed at Businesses across the West Midlands – Established (Sole Traders, Ltd Companies) together with new Start Up businesses.<\/p>\n<p>What will attendees gain?<\/p>\n<ul><li>New contacts for their business.<\/li><li>New business opportunities.<\/li><li>Business related services.  <\/li><\/ul>\n<p>Speakers: <\/p>\n<p>Kelly Jeffs, CEO of Light House<\/p>\n<p>Representatives of BoB Clubs (Names TBC)<\/p>\n<p>Other business owners (TBC)<\/p>","longitude":0,"latest_end_local":"13 Oct 2020 22:00:00","earliest_end_local":"13 Oct 2020 22:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"13 Oct 2020 21:00:00","venue_postal_code":"WV1 1HT","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Wolverhampton"}]},{"name":"Sector","options":[{"name":"Professional Services"}]},{"name":"Date","options":[{"name":"13\/10\/20"}]}],"description":""},{"earliest_start_utc":"14 Oct 2020 07:30:00","slug":"what-we-can-do-for-you","venue_name":"Private","venue_city":"","latest_end_utc":"14 Oct 2020 08:30:00","earliest_start_local":"14 Oct 2020 08:30:00","url":"https:\/\/bcbf20.ticketleap.com\/what-we-can-do-for-you\/dates\/Oct-14-2020_at_0830AM","venue_street":"","latest_start_local":"14 Oct 2020 08:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/97a75a81-930f-4877-b477-f395b3a0eeba\/hero.jpg","latitude":0,"latest_start_utc":"14 Oct 2020 07:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/97a75a81-930f-4877-b477-f395b3a0eeba\/full.jpg","name":"What We Can Do For You ONLINE","id":"05c9fa34-6e9d-11ea-978c-22000bccc173","html_description":"<p>This event is an opportunity for an informal chat with our staff at DWP to find out what support and advice is available for businesses regarding recruitment and staff retention in today's world of work. The event is aimed at businesses and organisations who engage with volunteers and staff.  The event is also aimed at HR professionals from large companies to small and medium enterprises. Attendees will learn about the services DWP provides to support training to gain employment, recruitment and retention of staff at no extra cost to your business.  <\/p>\n<p>Agenda:<\/p>\n<p><strong>Introduction and Overview of  Universal Credit and Caseloads<\/strong><\/p>\n<p>Cathy Taylor - Business Development Manager (Employer &amp; Partnerships)<\/p>\n<p><strong>What Can We Offer Your Business?<\/strong><\/p>\n<p>Information on Retention of Staff, Access to Work and Disability Confident – Ruth Trethewey – Employer Adviser<\/p>\n<p>Redundancy Support – Shaun Millward – Employer Adviser<\/p>\n<p>Go Train – Skills for the Employed offer<\/p>\n<p><strong>Recruitment Support<\/strong><\/p>\n<p>Work Experience Placements, Work Trials, Apprenticeships, Find A Job – Steve Hollies – Employer Adviser<\/p>\n<p>Tailored offers for employers, Sector Based Work Academies – Dave Brookes – Employer Adviser<\/p>\n<p>NPA – Testimony of recruitment support by DWP<\/p>\n<p><strong>Upskilling of the Future Work Force<\/strong><\/p>\n<p>Inclusivity and Diversity, Advocacy, Talent Pool\/Construction Hub – Claire Willetts – Employer Adviser<\/p>\n<p>Dudley College – Testimony on joint working<\/p>\n<p>Working with Partners, Preparing Customers for Interview, Kick Start scheme – Julia Robbins – Employer Adviser<\/p>\n<p>Skills Shop – Testimony from partner organisation<\/p>\n<p><strong>Q &amp; A<\/strong><\/p>\n<p>Ian Thompson – Employer Adviser<\/p>\n<p> <\/p>\n<p> <\/p>","longitude":0,"latest_end_local":"14 Oct 2020 09:30:00","earliest_end_local":"14 Oct 2020 09:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"14 Oct 2020 08:30:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"14\/10\/20"}]}],"description":""},{"earliest_start_utc":"14 Oct 2020 09:00:00","slug":"developing-high-performance-teams","venue_name":"Private","venue_city":"","latest_end_utc":"14 Oct 2020 10:30:00","earliest_start_local":"14 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/developing-high-performance-teams\/dates\/Oct-14-2020_at_1000AM","venue_street":"","latest_start_local":"14 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/954a7b21-59da-47fb-935a-2e54bccd3234\/hero.jpg","latitude":0,"latest_start_utc":"14 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/954a7b21-59da-47fb-935a-2e54bccd3234\/full.jpg","name":"Developing High Performance Teams ONLINE","id":"a875ffa4-57c2-11ea-b6cc-22000bbd30be","html_description":"<p><strong>How much is employee disengagement costing your business?<\/strong>  Learn the facts and figures and work out how much of your payroll is dead money.  You don’t know what you don’t know.  You cannot train engagement so please come and learn new things... We can teach you to make every employee a profit centre for your business. Your employees won’t change if you don’t take action and lead the way.  Often as a company grows, the direct line of sight to the original mission and culture has become foggy or even lost. With a lack of clear direction along with a set of guiding core values, larger companies become havens to those with a mentality of \"<strong>ME<\/strong>\" rather than \"<strong>WE<\/strong>\".  As business leaders it’s critical to re-engage the team to give them back their purpose and make some discoveries on the way. With a re-energised and re-engaged workforce, the company will be a high performing fun place to work which will attract the people and the customers that you want. It's never too late to challenge the culture that exists and start creating a new one if the old one isn't serving you or your company well.  <\/p>\n<p>If you are the Business Owner, CEO or MD of a business with 20 to 200 employees you can attend this online workshop and find out how to create transformational change in 3 months or less.  <strong>Lots of real life examples, amazing results, case studies and testimonials.<\/strong>  <\/p>\n<p>Learn about the current engagement stats in the UK and what you can do about it. You will learn some simple methods to light a fire within your organisation, reconnect with the core values of why the business exists and how to push that message from top to bottom and see a real difference in the company’s performance quickly. All attendees will have an opportunity to get a Free Employee Engagement Survey to measure Engagement in their organisation.  <\/p>\n<p><strong>Speakers: <\/strong><\/p>\n<p>Karrie-Ann Fox, Engage &amp; Grow Master Coach<\/p>\n<p>NLP Practitioner<\/p>\n<p>DISC Practitioner<\/p>","longitude":0,"latest_end_local":"14 Oct 2020 11:30:00","earliest_end_local":"14 Oct 2020 11:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"14 Oct 2020 10:30:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"14\/10\/20"}]}],"description":""},{"earliest_start_utc":"14 Oct 2020 09:00:00","slug":"diversity-and-inclusion-in-business","venue_name":"Private","venue_city":"","latest_end_utc":"14 Oct 2020 11:00:00","earliest_start_local":"14 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/diversity-and-inclusion-in-business\/dates\/Oct-14-2020_at_1000AM","venue_street":"","latest_start_local":"14 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/b2633217-cdb7-43bb-8237-a0ca79574477\/hero.jpg","latitude":0,"latest_start_utc":"14 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/b2633217-cdb7-43bb-8237-a0ca79574477\/full.jpg","name":"Diversity and inclusion in business ONLINE","id":"90d66dd0-6518-11ea-841a-22000a9bc419","html_description":"<p>A session facilitated by Higgs &amp; Sons’ HR and employment team. The event is aimed at anyone who runs or operates a business and employs staff or has responsibility for HR in the workplace. HR Directors, managers etc. <\/p>","longitude":0,"latest_end_local":"14 Oct 2020 12:00:00","earliest_end_local":"14 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"14 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"14\/10\/20"}]}],"description":""},{"earliest_start_utc":"14 Oct 2020 09:00:00","slug":"effective-leadership-enhancing-productivity-and-growth","venue_name":"Private","venue_city":"","latest_end_utc":"14 Oct 2020 11:00:00","earliest_start_local":"14 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/effective-leadership-enhancing-productivity-and-growth\/dates\/Oct-14-2020_at_1000AM","venue_street":"","latest_start_local":"14 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/3d86d65a-b803-4013-817e-764bd33868d5\/hero.jpg","latitude":0,"latest_start_utc":"14 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/3d86d65a-b803-4013-817e-764bd33868d5\/full.jpg","name":"Effective Leadership: Enhancing productivity and growth ONLINE","id":"9f21b078-6d0d-11ea-978c-22000bccc173","html_description":"<p>Recent studies suggest that ineffective management costs the UK over £19 billion per year in lost working hours. Good leadership is essential to successfully manage an efficient and productive workplace. This in-depth event will introduce the new Acas framework for effective leadership and demonstrate how it can be applied in practice. It will consider the business advantages of good leadership and provide delegates with the opportunity to identify and build on their own leadership styles. <\/p>\n<p>The event is aimed at delegates from all sectors of industry including: managers, supervisors, team leaders, HR professionals, business owners, Trade Union representatives, employee representatives and individuals who wish to enhance their CPD.  <\/p>\n<p>Delegates attending this event will discover their own leadership style, gain an understanding of the new Acas framework for effective leadership and have the opportunity to put theory into practice. <\/p>","longitude":0,"latest_end_local":"14 Oct 2020 12:00:00","earliest_end_local":"14 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"14 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"14\/10\/20"}]}],"description":""},{"earliest_start_utc":"14 Oct 2020 09:00:00","slug":"supporting-staff-mental-wellbeing-across-the-black-country","venue_name":"Private","venue_city":"","latest_end_utc":"14 Oct 2020 11:00:00","earliest_start_local":"14 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/supporting-staff-mental-wellbeing-across-the-black-country\/dates\/Oct-14-2020_at_1000AM","venue_street":"","latest_start_local":"14 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/2c1452a0-8d01-4137-af93-43889053fcac\/hero.jpg","latitude":0,"latest_start_utc":"14 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/2c1452a0-8d01-4137-af93-43889053fcac\/full.jpg","name":"Supporting staff mental wellbeing across the Black Country ONLINE","id":"6456c8ec-e077-11ea-81b3-22000a65d5a2","html_description":"<p><strong>Black Country Healthcare NHS Foundation Trust<\/strong>.  Supporting staff mental wellbeing across the Black Country.  The event is aimed at businesses of any size across the Black Country, Directors, Heads of Service, Line Manager, Business Owners, HR staff, Employees.  It’s everybody’s business to know about mental health and well being.  Attendees will gain knowledge, challenging stigma, confidence in supporting others with mental health difficulties and seeking support for self, developing support networks, sharing and highlighting good practice in business.<\/p>\n<p><strong>Theme:<\/strong> Managing Mental Wellbeing at work during a pandemic<\/p>\n<p><strong>Agenda:<\/strong><\/p>\n<p>Video 1 (30 mins) MH myths, facts regarding mental health, possible impacts of Covid 19 on mental health, best practice MHFA case study \/ Stress container exercise<\/p>\n<p>Video 2 (30 mins) Practical resources \/ support opportunities \/ access<\/p>\n<p>Increasing Access to Psychological Therapies- focus on information about IAPT across the Black Country short interventions on coping skills \/ tips for coping with working from home<\/p>\n<p>24 \/ 7 MH line- how to contact what can help with if have an employee or family member who need support with their mental health<\/p>\n<p>Recovery College – resilience and social support \/ loneliness\/ keeping well in pandemic 5 ways to wellbeing<\/p>\n<p>Video 3 (30 mins)<\/p>\n<p>Black Country Employment Services including case studies<\/p>\n<p>Individual Placement and Support and employers how can we help you – the benefits of work with mental health needs, \/ engaging with employers recruitment virtual jobs fair<\/p>\n<p>Case study examples<\/p>\n<p>Employment retention – retaining employees<\/p>\n<p>How we can help<\/p>\n<p>Tips for line managers to support people with mental health needs during pandemic \/ returning to work from Furlough\/ Sickness<\/p>\n<p>Case Study examples<\/p>\n<p>Building Better Opportunities – Introduction to the project how it can help people in the community case studies<\/p>\n<p>Panel Q&amp;A (30 mins)<\/p>\n<p><strong>Panel members:<\/strong> from IAPT, MHFA, IPS Rep\/ BBO\/ Retention\/ Recovery College to discuss themes, but also to take Q and A from Chat and be interactive with audience.<\/p>","longitude":0,"latest_end_local":"14 Oct 2020 12:00:00","earliest_end_local":"14 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"14 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Professional Services"}]},{"name":"Date","options":[{"name":"14\/10\/20"}]}],"description":""},{"earliest_start_utc":"14 Oct 2020 09:00:00","slug":"tour-of-lonsdales---business-storage-facilities--recycling-for-","venue_name":"L&J Lonsdale Metals and Storage","venue_city":"Birchills, Walsall","latest_end_utc":"14 Oct 2020 10:30:00","earliest_start_local":"14 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/tour-of-lonsdales---business-storage-facilities--recycling-for-\/dates\/Oct-14-2020_at_1000AM","venue_street":"154 Green lane","latest_start_local":"14 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/6b1c9976-7cbf-422e-a130-0fa3a8277d6a\/hero.jpg","latitude":0,"latest_start_utc":"14 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/6b1c9976-7cbf-422e-a130-0fa3a8277d6a\/full.jpg","name":"Tour of Lonsdales - Business Storage Facilities & Recycling for Manufacturers","id":"9bad9a0c-6456-11ea-8ff5-22000b248c9f","html_description":"<p>We know that Brexit, and more recently the effect of Coronavirus, is of a concern to many manufacturers and how these events may impact businesses. Businesses may be looking to stockpile materials in the event that there may be problems with supply or shortages, but this leaves businesses with the issue of where to keep stocks and how to easily access them without affecting the day to day running of the business. Likewise there may be delays with dispatching manufactured goods to certain areas and again storing these goods post manufacture may have an impact on the day to day running of the business with demands on space. Businesses also have slow moving stock such as warranty parts or tools that are currently out of production that need to be kept, but again can take up considerable space. Not all businesses will have considered external storage and there is a perception that it is an expensive and long term solution only available to larger companies with a lot to store. We would like to show the advantages of using external storage and how storage can be flexible to meet and suit the needs of businesses.  <\/p>\n<p>We are aiming our event at local manufacturers. We understand the issues experienced by manufacturing businesses in terms of finding space to store materials to support production and the limitations placed on production due to capacity for storing finished goods. We don't have minimum storage quantities or time period, so we are flexible to meet our customers requirements. We want businesses to understand the benefits of using external storage.<\/p>\n<p>The metals side of our business provides a metal collection service, and other forms of waste, providing skips, bins etc and offering a total waste management and recycling service.  <\/p>\n<p>We hope to make attendees aware of the benefits of using external storage to support their business requirements, especially businesses that haven't considered external storage before. We want to demonstrate how flexible and convenient our service can be and how using our service could help their business.  <\/p>\n<p>Agenda: <\/p>\n<p>10:00am - Arrival<\/p>\n<p>10:00-10:15am - Networking <\/p>\n<p>10:15 am - Introduction to Lonsdales &amp; tour of the facilities -  Green Lane site &amp; Fryers Road site (The two sites are a short car journey apart - we will encourage questions as we tour the facilities)<\/p>\n<p>11:15am - End of tour, ending comments<\/p>\n<p>11:30am - Depart Lonsdales. <\/p>\n<p>Members of the team will be in attendance and lead the warehouse tour.<\/p>","longitude":0,"latest_end_local":"14 Oct 2020 11:30:00","earliest_end_local":"14 Oct 2020 11:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"14 Oct 2020 10:30:00","venue_postal_code":"WS2 8LE","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Walsall"}]},{"name":"Sector","options":[{"name":"Advanced Manufacturing"}]},{"name":"Date","options":[{"name":"14\/10\/20"}]}],"description":""},{"earliest_start_utc":"14 Oct 2020 10:00:00","slug":"bcbf-golf-day","venue_name":"Penn Golf Club","venue_city":"Wolverhampton","latest_end_utc":"14 Oct 2020 17:30:00","earliest_start_local":"14 Oct 2020 11:00:00","url":"https:\/\/bcbf20.ticketleap.com\/bcbf-golf-day\/dates\/Oct-14-2020_at_1100AM","venue_street":"Penn Common","latest_start_local":"14 Oct 2020 11:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/7a6539af-453e-46cf-aa8e-5714d5411d93\/hero.jpg","latitude":0,"latest_start_utc":"14 Oct 2020 10:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/7a6539af-453e-46cf-aa8e-5714d5411d93\/full.jpg","name":"BCBF Golf Day","id":"736ea884-57d0-11ea-87a4-22000a5fa226","html_description":"<p>BCBF Golf Day – Golf event consisting of up to 20 teams of 4 players (Gents and Ladies)<\/p>\n<p>Tee-times available from 11.00hrs until 14.00hrs at 10 min. intervals. 2 from 4 Stableford Competition off Yellow Tees – 90% H’cap allowance.<\/p>\n<p>Bacon bap with Tea\/Coffee upon arrival. Prize presentation by Steve Bull MBE. at approx. 18.30hrs.<\/p>\n<p>Proceeds from the day will go towards the Captain’s Charities, which are Prostrate Cancer UK and Marie Curie.<\/p>\n<p>We have hosted the event for the last 2 years and both events proved to be a great success raising hundreds of pounds for charity and emphasising the importance of Golf and Business links.<\/p>\n<p>The event is open to all local businesses in The Black Country.  Businesses will become aware that Golf Clubs can provide solutions to meeting spaces, catering, company activity and even large scale corporate events.  Golf can also provide excellent opportunities for networking along with the obvious health benefits, both physical and mental.  By attending on the day it can open the lines of communication, provide an opportunity to meet great people and network with like-minded professionals, as well as raise money for good causes.  Understand how Golf can be incorporated into your business for the benefit of your employees, clients and your organisation.  <\/p>\n<p>Cost for a team of 4 is £100, which includes a £5 donation per person (i.e.£20 per team) towards the aforementioned Captain’s Charities.<\/p>\n<p>Please register your place here and contact the Club on 01902 341142 to complete the application form and to make payment.<\/p>","longitude":0,"latest_end_local":"14 Oct 2020 18:30:00","earliest_end_local":"14 Oct 2020 18:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"14 Oct 2020 17:30:00","venue_postal_code":"WV4 5JN","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Wolverhampton"}]},{"name":"Sector","options":[{"name":"Retail, Tourism & Hospitality"}]},{"name":"Date","options":[{"name":"14\/10\/20"}]}],"description":""},{"earliest_start_utc":"14 Oct 2020 10:00:00","slug":"third-week-wednesday-bf-special","venue_name":"Private","venue_city":"","latest_end_utc":"14 Oct 2020 11:00:00","earliest_start_local":"14 Oct 2020 11:00:00","url":"https:\/\/bcbf20.ticketleap.com\/third-week-wednesday-bf-special\/dates\/Oct-14-2020_at_1100AM","venue_street":"","latest_start_local":"14 Oct 2020 11:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/65cf7e16-adb3-43d1-8ba8-674a21f58e12\/hero.jpg","latitude":0,"latest_start_utc":"14 Oct 2020 10:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/65cf7e16-adb3-43d1-8ba8-674a21f58e12\/full.jpg","name":"Third Week Wednesday - Business Festival Special ONLINE","id":"b992ce24-589f-11ea-a169-22000b0c01fa","html_description":"<p>In This Year’s Black Country Business Festival  - TWW – Third Week Wednesday Goes Hybrid…..<\/p>\n<p>Our regular Third Week Wednesday hits this year’s Black Country Business Festival as a hybrid event on 14th October.<\/p>\n<p>Running digitally via Zoom, and FREE to attend, the event will give dozens of businesses the chance to connect and offers delegates the opportunity to use their own social media channels to reach out and share their business message.<\/p>\n<p>Headed up by Chamber membership adviser, Richard Brooks, the live streaming business event offers interviews, in between the open networking sessions, and a chance to project your business message out to the many thousands who follow via the Chamber’s social media platforms.<\/p>\n<p>The event is engineered to take up to 100 delegates and is set up for 50 break out rooms, giving quick 5-10 minute one to ones or small group open networking opportunities.<\/p>\n<p>Short business interviews take place in between these sessions which offer a fun and pacey way to put you in front of lots of businesses, all within the hour window.<\/p>","longitude":0,"latest_end_local":"14 Oct 2020 12:00:00","earliest_end_local":"14 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"14 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Professional Services"}]},{"name":"Date","options":[{"name":"14\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"14 Oct 2020 11:00:00","slug":"bubble-wrapping-your-business","venue_name":"Private","venue_city":"","latest_end_utc":"14 Oct 2020 13:00:00","earliest_start_local":"14 Oct 2020 12:00:00","url":"https:\/\/bcbf20.ticketleap.com\/bubble-wrapping-your-business\/dates\/Oct-14-2020_at_1200PM","venue_street":"","latest_start_local":"14 Oct 2020 12:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/b981abda-4ea3-42ab-b07b-ed93dc387498\/hero.jpg","latitude":0,"latest_start_utc":"14 Oct 2020 11:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/b981abda-4ea3-42ab-b07b-ed93dc387498\/full.jpg","name":"Bubble Wrapping your Business ONLINE","id":"69826d36-5ee4-11ea-a83c-22000aec09a6","html_description":"<p>Have you considered the impact and effect of when that one bubble bursts? It leaves a gap which if left, gets wider and the problems get bigger. Let us give you an insight into possible scenarios of issues, such as a director losing mental capacity, losing key employees to competitors, getting the business structure right, your premises are threatened by a telecoms operator and how a divorce of a shareholder can affect the business structure.<\/p>\n<p>This event is aimed at business owners, directors, partnerships, sole traders for advice on various legal issues and people will have the opportunity to ask questions from at least six lawyers who specialise in different areas of the law.  We will raise awareness of potential issues that can cause disruption to your business and offer solutions.  <\/p>\n<p><strong>Agenda: <\/strong><\/p>\n<p>12.00pm - Log in to Zoom<\/p>\n<p>12.15pm -  Presentations begin followed by Q&amp;A<\/p>\n<p><strong>Speakers: <\/strong><\/p>\n<p>Hannah Scott, Solicitor<\/p>\n<p>Sarah Bradford, Solicitor<\/p>\n<p>Tim Clark, Solicitor<\/p>\n<p>Elaine Williams, Solicitor<\/p>\n<p>Melanie Young, Chartered Legal Executive<\/p>\n<p>Joanne Briscoe, Solicitor<\/p>","longitude":0,"latest_end_local":"14 Oct 2020 14:00:00","earliest_end_local":"14 Oct 2020 14:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"14 Oct 2020 13:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"14\/10\/20"}]}],"description":""},{"earliest_start_utc":"14 Oct 2020 11:30:00","slug":"how-to-safely-and-fairly-recruit-young-people-with-convictions","venue_name":"Private","venue_city":"","latest_end_utc":"14 Oct 2020 15:00:00","earliest_start_local":"14 Oct 2020 12:30:00","url":"https:\/\/bcbf20.ticketleap.com\/how-to-safely-and-fairly-recruit-young-people-with-convictions\/dates\/Oct-14-2020_at_1230PM","venue_street":"","latest_start_local":"14 Oct 2020 12:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/b675f557-af37-4d5a-ba34-4018980aa6a0\/hero.jpg","latitude":0,"latest_start_utc":"14 Oct 2020 11:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/b675f557-af37-4d5a-ba34-4018980aa6a0\/full.jpg","name":"How to safely and fairly recruit young people with convictions - ONLINE","id":"706b1b7c-596a-11ea-8895-22000aec09a6","html_description":"<p>Black Country Talent Match are an intensive mentoring service supporting young adults with an offending background to move closer to work. Partnering with the Black Country Chamber of Commerce, we are hosting a session for businesses to find out everything they need to know about how to safely and fairly recruit someone with an offending background. This workshop will be lead by Dominic Headley. Dominic, formerly of NACRO, is a specialist consultant in criminal record policy and safer recruitment.  <\/p>\n<p>This event is aimed at businesses of all sizes and anyone with input into staff recruitment.<\/p>\n<p>Attendees will gain confidence and knowledge relating to safely and fairly recruiting people with offending backgrounds and can receive support from Black Country Talent Match to do so. <\/p>\n<p>By the end of this session you will:<\/p>\n<p>* Understand and apply the relevant legislation that impacts upon recruitment and retention of people with criminal records (e.g. ROA 1974, DPA 1998\/ GDPR 2018).<\/p>\n<p>* Learn how to deal effectively with disclosure of criminal records.<\/p>\n<p>* Gather the relevant information in order to inform the risk assessment process.<\/p>\n<p>* Understand how to interpret criminal record information in order to inform risk assessment processes.<\/p>\n<p>* Understand how to risk assess applicants\/employees with criminal records in the context of safe recruitment and reputational business risk.  <\/p>\n<p>• Understand how to recruit confidently and effectively from the talent pool of over 11 million people in the UK with convictions<\/p>\n<p>• Be able to improve the diversity of your workforce<\/p>\n<p>• Understand how to minimise any potential or perceived risks that might be involved<\/p>\n<p>• Learn how to avoid unnecessary failed recruitment costs.  <\/p>\n<p>Agenda: <\/p>\n<p>12.30pm - Start - Part 1 <\/p>\n<p>02.30pm -  Break for 20 mins<\/p>\n<p>02:20pm - Part 2  and Q &amp; A session <\/p>\n<p>04.00pm - Close <\/p>\n<p>Speaker: <\/p>\n<p>Dominic Headley FRSA  <\/p>\n<p> <\/p>","longitude":0,"latest_end_local":"14 Oct 2020 16:00:00","earliest_end_local":"14 Oct 2020 16:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"14 Oct 2020 15:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Professional Services"}]},{"name":"Date","options":[{"name":"14\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"14 Oct 2020 12:30:00","slug":"turning-the-black-country-green---session-2","venue_name":"Private","venue_city":"","latest_end_utc":"14 Oct 2020 14:00:00","earliest_start_local":"14 Oct 2020 13:30:00","url":"https:\/\/bcbf20.ticketleap.com\/turning-the-black-country-green---session-2\/dates\/Oct-14-2020_at_0130PM","venue_street":"","latest_start_local":"14 Oct 2020 13:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/b40bbcd3-345d-4fbb-babf-d8b4f0d1510b\/hero.jpg","latitude":0,"latest_start_utc":"14 Oct 2020 12:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/b40bbcd3-345d-4fbb-babf-d8b4f0d1510b\/full.jpg","name":"Turning The Black Country Green - Session 2 ONLINE","id":"7c6b0902-e095-11ea-a491-22000b180f96","html_description":"<p>Turning The Black Country Green - Taking the region through it's second industrial revolution. Attendees will learn how they can transform their business, become Carbon Neutral certified to PAS2060 and increase their profits. Businesses can gain the competitive advantage by differentiating themselves from their competition by demonstrating their commitment to the environment by reducing Carbon, whilst significantly benefiting their bottom line.  Reduce energy costs by up to 40% &amp; energy consumption by up to 20%, begin to measure, reduce and report their Carbon Footprint on their journey to become Carbon Zero ahead of the UK backstop of 2050.<\/p>\n<p>Carbon Zero Energy, Decentralised Energy, Energy Optimisation, Carbon Measuring &amp; Reporting, Carbon Offsetting.  <\/p>\n<p>The event is aimed at Financial Directors, Managing Directors, Operation Directors\/Managers, Facility Managers of businesses of all sizes and from all industries. It specifically benefits medium to large manufacturers that consume large amounts of energy and produce large amounts of carbon.  <\/p>\n<p>Attendees will be learn how they can measure, reduce, report their carbon footprint on their journey to becoming Carbon Neutral certified to PAS2060. We will demonstrated how decentralised energy can reduce costs by up to 40% and the integration of our energy management systems can reduce consumption by up to 20%. Attendees can integrate a bespoke Carbon dashboard that will measure and report their journey of becoming Zero Carbon. We provide bespoke holistic solutions that can be provided with zero CAPEX requirement and assists businesses in future proofing their business.<\/p>\n<p><strong>AGENDA<\/strong> <strong>- 14th October<\/strong><\/p>\n<p>1.30pm - 2.00pm – 2050 Net Zero &amp; Carbon Neutral WHAT, WHY, WHEN &amp; HOW<\/p>\n<p>2.00pm – 2.30 pm – Decentralisation, Optimisation, Decarbonisation <\/p>\n<p>2.30pm – 2.50pm – PAS2060 Carbon Neutral, Carbon Offsetting, UK School Tree planting program.<\/p>\n<p>2.50pm – 3.00pm - Questions<\/p>\n<p><strong>SPEAKERS<\/strong><\/p>\n<p>Envirogy Power Ltd<\/p>\n<p>CBN Expert Ltd<\/p>\n<p> <\/p>","longitude":0,"latest_end_local":"14 Oct 2020 15:00:00","earliest_end_local":"14 Oct 2020 15:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"14 Oct 2020 14:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Advanced Manufacturing"},{"name":"Professional Services"}]},{"name":"Date","options":[{"name":"14\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"14 Oct 2020 13:00:00","slug":"queens-award-for-enterprise--create-a-winning-entry","venue_name":"Private","venue_city":"","latest_end_utc":"14 Oct 2020 15:30:00","earliest_start_local":"14 Oct 2020 14:00:00","url":"https:\/\/bcbf20.ticketleap.com\/queens-award-for-enterprise--create-a-winning-entry\/dates\/Oct-14-2020_at_0200PM","venue_street":"","latest_start_local":"14 Oct 2020 14:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/2e4f3896-a7a1-4f92-9489-d3bcdac28923\/hero.jpg","latitude":0,"latest_start_utc":"14 Oct 2020 13:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/2e4f3896-a7a1-4f92-9489-d3bcdac28923\/full.jpg","name":"Queen’s Award for Enterprise – Create a Winning Entry! ONLINE","id":"8da9f68a-62da-11ea-a83c-22000aec09a6","html_description":"<p>Entering awards could be invaluable for you and your business and there is nothing more prestigious than winning a Queens Award for Enterprise. During this interactive session you will hear from previous winners and Deputy Lieutenants who will explain the benefits associated with winning an award, as well as the reality of the process itself. You will then enjoy a digital workshop designed to help you significantly improve your chances of creating a winning entry! <\/p>\n<p>A popular misconception is that the awards are always won by large organisations. This is not the case as you will hear from our region’s previous winners.<\/p>\n<p>The Queen’s Awards for Enterprise are awarded to businesses which excel in International Trade, Innovation, Sustainable Development and Promoting Opportunity.<\/p>\n<p>Irrelevant of your size or sector, if you are proud of what your company achieves and feel like you have a story to tell, then you should attend this online event.  <\/p>\n<p><strong>What will attendees gain?<\/strong><\/p>\n<p>Many leaders don’t understand the benefits these awards can bring to the business and therefore don’t pursue them. However, previous winners have broken into new markets, attracted investment, raised morale and improved their chances of attracting the best talent in the region.<\/p>\n<p>This event is designed to inspire you to do the same for your business and to provide the tools to help you create the best entry possible. <\/p>\n<p><strong>Agenda:<\/strong><\/p>\n<p>Welcome from the Lord Lieutenants office<\/p>\n<p>Introduction from a Deputy Lieutenant<\/p>\n<p>Panel Session with previous winners<\/p>\n<p>Digital Workshop<\/p>","longitude":0,"latest_end_local":"14 Oct 2020 16:30:00","earliest_end_local":"14 Oct 2020 16:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"14 Oct 2020 15:30:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"14\/10\/20"}]}],"description":""},{"earliest_start_utc":"14 Oct 2020 15:30:00","slug":"the-business-of-winning","venue_name":"Millennium City Courtyard","venue_city":"Wolverhampton","latest_end_utc":"14 Oct 2020 17:30:00","earliest_start_local":"14 Oct 2020 16:30:00","url":"https:\/\/bcbf20.ticketleap.com\/the-business-of-winning\/dates\/Oct-14-2020_at_0430PM","venue_street":"University of Wolverhampton - City Campus, Wulfruna Street","latest_start_local":"14 Oct 2020 16:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/9034e889-c3f6-4c4c-add8-322b5161f0f0\/hero.jpg","latitude":0,"latest_start_utc":"14 Oct 2020 15:30:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/9034e889-c3f6-4c4c-add8-322b5161f0f0\/full.jpg","name":"The Business of Winning","id":"39bb875c-62c4-11ea-adb8-22000b1e8239","html_description":"<p>Meet the University of Wolverhampton Racing (UWR) Team, the only student run team in the UK who race in the F3 Cup and the Morgan Challenge, and take a close look at our professional calibre racing cars. The highly commercial nature of motorsport, linked with its popularity and high profile, lends itself well to the development of business partnerships. It allows a raft of commercial entitlements that offer genuine potential as a dynamic, innovative business-development platform.nIn addition to meeting the team, this event will share with you the stories of several UWR sponsors who have utilised the tailored opportunities and range of commercial entitlements that are on offer to meet their individual business development requirements.nBy attending the Business of Winning, you will discover exciting dimensions to add to your existing business development strategies, from meeting and hosting clients, to growing your social media content. <\/p>\n<p>This event is aimed at anyone, in any scale of business, with a passion for, or an interest in, motorsport. It will likely be particularly pertinent to MD’s, marketing\/ PR staff, or business development staff.<\/p>\n<p>Attendees will gain an insight into the workings of a student-run professional motorsport team and the multiple competitions they take part in. The presentations will focus on harnessing the unique opportunities that working with a motorsport team give to businesses on any scale, and hearing from current UWR sponsors on the innovative use of their bespoke relationship to develop new business opportunities, and maintain a strong dynamic with existing contacts.  <\/p>\n<p>Agenda: <\/p>\n<p>16:30 – Networking, meet the teams, view the cars<\/p>\n<p>17:15 – Presentations by UWR &amp; sponsors<\/p>\n<p>17:45 – Further networking &amp; car viewing<\/p>\n<p>18:30 – Event close. <\/p>\n<p>Speaker: Terry Gibson, Development Manager, University of Wolverhampton<\/p>\n<p>James Worthington, Managing Director, My Work Wear<\/p>\n<p>Shane Kelly, Professional Driver, University of Wolverhampton<\/p>","longitude":0,"latest_end_local":"14 Oct 2020 18:30:00","earliest_end_local":"14 Oct 2020 18:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"14 Oct 2020 17:30:00","venue_postal_code":"WV1 1LY","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Wolverhampton"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"14\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"14 Oct 2020 16:00:00","slug":"business-survival--growth-leaders-discussion","venue_name":"Private","venue_city":"","latest_end_utc":"14 Oct 2020 17:00:00","earliest_start_local":"14 Oct 2020 17:00:00","url":"https:\/\/bcbf20.ticketleap.com\/business-survival--growth-leaders-discussion\/dates\/Oct-14-2020_at_0500PM","venue_street":"","latest_start_local":"14 Oct 2020 17:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/ea87d216-f2ab-4d18-91f5-0f1533a4f334\/hero.jpg","latitude":0,"latest_start_utc":"14 Oct 2020 16:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/ea87d216-f2ab-4d18-91f5-0f1533a4f334\/full.jpg","name":"Business Survival & Growth: Leaders Discussion ONLINE","id":"40073a94-f283-11ea-b7e9-22000bb5086f","html_description":"<p>Leaders from the Chamber, CBI, Make UK, IOD and FSB discuss what businesses need to do to survive and grow in an economy impacted by Brexit, the Recession and Covid 19.<\/p>\n<p><strong>Speakers: <\/strong><\/p>\n<p>Adam Marshall, Chief Executive - British Chambers<\/p>\n<p>Mike Cherry, Chair - FSB<\/p>","longitude":0,"latest_end_local":"14 Oct 2020 18:00:00","earliest_end_local":"14 Oct 2020 18:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"14 Oct 2020 17:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"14\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"15 Oct 2020 08:00:00","slug":"brownfield-money-generator-or-money-pit","venue_name":"Private","venue_city":"","latest_end_utc":"15 Oct 2020 10:00:00","earliest_start_local":"15 Oct 2020 09:00:00","url":"https:\/\/bcbf20.ticketleap.com\/brownfield-money-generator-or-money-pit\/dates\/Oct-15-2020_at_0900AM","venue_street":"","latest_start_local":"15 Oct 2020 09:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/d5840062-28a3-4ce2-988b-081b4c156900\/hero.jpg","latitude":0,"latest_start_utc":"15 Oct 2020 08:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/d5840062-28a3-4ce2-988b-081b4c156900\/full.jpg","name":"Brownfield: Money Generator or Money Pit? ONLINE","id":"82bd98b4-5f90-11ea-be07-22000b228098","html_description":"<p>Own or occupy a brownfield site or thinking about buying such a site or renting premises on one? Not sure about the advantages and disadvantages? Want to know more about what might be involved in developing brownfield land or the latest techniques available to support your development? BRIC (Brownfield Research &amp; Innovation Centre) can answer all these questions.  The event is aimed at SMEs that are involved in the remediation and redevelopment of brownfield sites, this could include remediation companies, land developers, land owners, construction companies, house builders, architects.<\/p>\n<p>The event will offer:<\/p>\n<p>• Practical advice - Specialist presentations delivered by members of the BRIC team providing insight into strategies, innovations and techniques used to tackle the challenges posed by brownfield sites.<\/p>\n<p>• Case studies – providing hands-on experience of the free support offered by BRIC to Black Country SMEs.<\/p>\n<p>• Networking - Meet with other businesses involved in brownfield remediation and redevelopment. Whether you want to have a 1-2-1 with a member of the BRIC team, raise your profile, or simply catch up with peers, this BRIC event offers a great networking and knowledge sharing opportunity.<\/p>\n<p>Attendees will gain practical advice from Brownfield experts, see live case studies and network with professionals involved in redevelopment projects.  <\/p>\n<p>Agenda \/ Speakers:<\/p>\n<p>Mark Schneider, BRIC Project Manager: Project Overview<\/p>\n<p>Noukhez Ahmed, BRIC Researcher: The BRIC Index<\/p>\n<p>Rana Khan, BRIC Researcher: Practical demonstration of the BRIC Equipment<\/p>\n<p>Tony West, BRIC Knowledge Transfer Manager: A BRIC case study<\/p>\n<p>Jan Bayley, BRIC Knowledge Transfer Manager:  A BRIC case study<\/p>","longitude":0,"latest_end_local":"15 Oct 2020 11:00:00","earliest_end_local":"15 Oct 2020 11:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"15 Oct 2020 10:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Property & Construction"}]},{"name":"Date","options":[{"name":"15\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"15 Oct 2020 08:00:00","slug":"changes-to-legal-education-and-routes-to-qualification","venue_name":"Private","venue_city":"","latest_end_utc":"15 Oct 2020 10:00:00","earliest_start_local":"15 Oct 2020 09:00:00","url":"https:\/\/bcbf20.ticketleap.com\/changes-to-legal-education-and-routes-to-qualification\/dates\/Oct-15-2020_at_0900AM","venue_street":"","latest_start_local":"15 Oct 2020 09:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/07de9392-46fd-4d55-b8a7-622b627d113f\/hero.jpg","latitude":0,"latest_start_utc":"15 Oct 2020 08:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/07de9392-46fd-4d55-b8a7-622b627d113f\/full.jpg","name":"Changes to Legal Education and Routes to Qualification ONLINE","id":"09bef508-5f99-11ea-8aca-22000b6d80dc","html_description":"<p>Changes to Legal Education and Routes to Qualification: Implications for private practice and how the University can support. Over the last 5 years there have been significant changes in legal education which impact on professional practice for both private law firms and larger organisations who employ legal teams.  The event is aimed at private law firms and larger organisations that employ legal teams are invited to a special event hosted by Professor Sukhninder Panesar, Head of Law at the University of Wolverhampton.  <\/p>\n<p>Delegates will hear more about changes to legal education, the new models of professional qualifications, degree apprenticeships and part time studies available for staff at all levels, and the ways businesses need to position themselves and their staff.  <\/p>\n<p>The session will include a presentation and an opportunity to discuss the support that the University can provide locally.  <\/p>\n<p>Speaker: Sukhninder Panesar – Head of the Wolverhampton Law School<\/p>","longitude":0,"latest_end_local":"15 Oct 2020 11:00:00","earliest_end_local":"15 Oct 2020 11:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"15 Oct 2020 10:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Professional Services"},{"name":"Education & Skills"}]},{"name":"Date","options":[{"name":"15\/10\/20"}]}],"description":""},{"earliest_start_utc":"15 Oct 2020 08:00:00","slug":"working-towards-a-healthier-workforce","venue_name":"Private","venue_city":"","latest_end_utc":"15 Oct 2020 10:00:00","earliest_start_local":"15 Oct 2020 09:00:00","url":"https:\/\/bcbf20.ticketleap.com\/working-towards-a-healthier-workforce\/dates\/Oct-15-2020_at_0900AM","venue_street":"","latest_start_local":"15 Oct 2020 09:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/50e523ec-9fcb-469b-9cba-b450c9dffafd\/hero.jpg","latitude":0,"latest_start_utc":"15 Oct 2020 08:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/50e523ec-9fcb-469b-9cba-b450c9dffafd\/full.jpg","name":"Working towards a healthier workforce ONLINE","id":"4e796e70-5f95-11ea-8aca-22000b6d80dc","html_description":"<p>An employee wellbeing strategy is not just an added extra, today it is a must for any business wanting to increase productivity, promote healthier lives and reduce sickness\/absence. The University of Wolverhampton Faculty of Education is uniquely placed to offer a joined-up approach to promoting the health and well-being of your workforce. This event will showcase how the University’s dedicated offering of sports science, personal training, health and fitness facilities combined with the use of a fully registered bone densitometry and body fat composition scanner, can be used to measure and enhance your workforce’s health and wellbeing.<\/p>\n<p>We can offer:<\/p>\n<p>• Initial screening questionnaire to ensure they meet with DXA referral criteria for body composition<\/p>\n<p>• First body composition scan with results consultation straight after scan<\/p>\n<p>• Result shared (with consent) with dedicated fitness instructors and recommendations for areas for improvement based on the scan results for example: reduction in visceral fat levels, to reduce risk of obesity related conditions or in case of muscle presenting greater in one side of the body more than the other, that muscle is built up equally to prevent injury or risk of balance impairment.<\/p>\n<p>• Dedicated fitness instructors who will contact the employee and arrange a one to one planning session based on patient feedback and scan results.<\/p>\n<p>• Employee will have use of the sports centre (gym, exercise classes and swimming pool) for a period of 12 weeks to complete their exercise plan<\/p>\n<p>• Post 12 week scan, this is compared to initial scan. All results discussed with the employee following the scan and changes made during that period<\/p>\n<p>• The employee is offered a discounted corporate membership at the gym following completion of the 12 weeks wellbeing package.<\/p>\n<p>This interactive workshop will explore employee health and wellbeing and propose a tailored structure to engage employees with a health improvement programme.  <\/p>\n<p>The event is aimed at any organisation’s development, human resources or management teams with an interest in promoting health and wellbeing in their organisations.  Attendees will gain an  overview of health and wellbeing strategies for employee engagement and further knowledge of a tailored programme offered by the University of Wolverhampton to promote employee health and wellbeing.  <\/p>\n<p> <\/p>","longitude":0,"latest_end_local":"15 Oct 2020 11:00:00","earliest_end_local":"15 Oct 2020 11:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"15 Oct 2020 10:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"15\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"15 Oct 2020 09:00:00","slug":"tackling-diversity-on-trustee-boards","venue_name":"Private","venue_city":"","latest_end_utc":"15 Oct 2020 11:00:00","earliest_start_local":"15 Oct 2020 10:00:00","url":"https:\/\/bcbf20.ticketleap.com\/tackling-diversity-on-trustee-boards\/dates\/Oct-15-2020_at_1000AM","venue_street":"","latest_start_local":"15 Oct 2020 10:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/8ff41f77-69a5-4bd7-adb5-d5c37d9550c1\/hero.jpg","latitude":0,"latest_start_utc":"15 Oct 2020 09:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/8ff41f77-69a5-4bd7-adb5-d5c37d9550c1\/full.jpg","name":"Tackling diversity on Trustee boards ONLINE","id":"3c2db31a-6513-11ea-8153-22000a5bfa21","html_description":"<p>There are over 1 million trustees in the UK supporting 196,000 charities, but what makes a good trustee and how can charities ensure that the diverse communities they serve are represented in the make-up of their own trustees? Managers of charities and third sector organisations; existing charity trustees; those who might be considering the role of a charity trustee, and those involved in recruiting charity trustees at either Board level, senior management or otherwise. The event will be facilitated by members of Higgs &amp; Sons’ Charity and Not for Profit team who will use their vast experience of all aspects of charity law to focus on the particular considerations of organisations when recruiting and retaining trustees. <\/p>\n<p>This keynote seminar will explore the role and responsibilities of charity trustees, and what charities can do to encourage those from under-represented community groups to consider becoming a trustee.  <\/p>\n<p>Speaker: <\/p>\n<p>Kirsty McEwen, Head of Charity and Not for Profit, Higgs &amp; Sons<\/p>","longitude":0,"latest_end_local":"15 Oct 2020 12:00:00","earliest_end_local":"15 Oct 2020 12:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"15 Oct 2020 11:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."},{"name":"Education & Skills"}]},{"name":"Date","options":[{"name":"15\/10\/20"}]}],"description":""},{"earliest_start_utc":"15 Oct 2020 10:00:00","slug":"the-future-of-construction-is-digital","venue_name":"Private","venue_city":"","latest_end_utc":"15 Oct 2020 11:30:00","earliest_start_local":"15 Oct 2020 11:00:00","url":"https:\/\/bcbf20.ticketleap.com\/the-future-of-construction-is-digital\/dates\/Oct-15-2020_at_1100AM","venue_street":"","latest_start_local":"15 Oct 2020 11:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/381ba6dd-00c4-4881-85ed-a144214fdfa9\/hero.jpg","latitude":0,"latest_start_utc":"15 Oct 2020 10:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/381ba6dd-00c4-4881-85ed-a144214fdfa9\/full.jpg","name":"The Future of Construction is Digital ONLINE","id":"dc066858-de37-11ea-b7fb-22000b3f048f","html_description":"<p>In our most ambitious collaboration yet we are bringing together leading experts in construction and digital technologies from the University of Cambridge and the University of Wolverhampton to help Black Country SMEs in the construction sector to improve their operations.<br><br>The Institute for Manufacturing at the University of Cambridge will reveal how simple, low cost and off the shelf digital technologies can be combined to provide practical digital solutions to specific industry challenges, giving examples of successful pilot solutions developed for manufacturing businesses.<br><br>The Construction Futures Research Centre at the University of Wolverhampton has been set up to support SMEs achieve high standards of delivery in offsite construction. We will demonstrate how using technology and Modern Methods of Construction is the solution to the housing crisis.  <\/p>\n<p>The event is aimed at MD \/ Manufacturing Director \/ Operations Manager from SMEs involved in construction and manufacturers supplying the construction sector.  <\/p>\n<p><strong>What will attendees gain? <\/strong><\/p>\n<p>• Introduction to Modern Methods of Construction and how this can speed up and improve the efficiency of house building<br>• How Black Country SMEs can get fully funded support to achieve high standards of delivery in offsite construction<br>• Build awareness of low cost digital solutions for manufacturing<br>• Reflect on business priorities<br>• Identify potential digital solutions to help address these priorities<br>• Outline a priority digital solution for your individual business<\/p>\n<p><strong>Agenda \/ Schedule:<\/strong><br>11:00 – Introductions<br>11:05 – Digital Construction on a Shoestring Workshop, facilitated by the University of Cambridge<\/p>\n<ul><li>Shoestring overview and demonstrator videos<\/li><\/ul>\n<p>11:15 – audience participation<\/p>\n<ul><li>Reflecting on Business priorities<\/li><li>Identifying potential low cost digital solutions for your business<\/li><li>Outlining priority digital solutions<\/li><\/ul>\n<p>11:45 – Initial feedback<br>11:50 – Innovative Solutions to the Housing Crisis, presented by the University of Wolverhampton<\/p>\n<ul><li>How business can adopt Modern Methods of Construction and Building Information Modelling<\/li><li>CFRC overview<\/li><\/ul>\n<p>12:25 – Q&amp;A<\/p>\n<p><strong>Names of speakers:<\/strong><\/p>\n<p><em>University of Cambridge:<\/em><\/p>\n<p>Dr Greg Hawkridge - Research Associate<br>Dr Gokcen Yilmaz - Research Associate<br>Liz Salter - Industrial Associate<\/p>\n<p><em>University of Wolverhampton:<\/em><\/p>\n<p>Professor Mohammed Arif - Head of School, Architecture and Built Environment<br>Dr David Heesom - Reader in Building Information Modelling<br>Paul Davies - Knowledge Transfer Manager<\/p>","longitude":0,"latest_end_local":"15 Oct 2020 12:30:00","earliest_end_local":"15 Oct 2020 12:30:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"15 Oct 2020 11:30:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Property & Construction"}]},{"name":"Date","options":[{"name":"15\/10\/20"}]},{"name":"Featured Event","options":[{"name":".Featured Event"}]}],"description":""},{"earliest_start_utc":"15 Oct 2020 13:00:00","slug":"invest-in-your-greatest-asset---your-staff","venue_name":"Wolverhampton Technology Centre","venue_city":"Wolverhampton","latest_end_utc":"15 Oct 2020 15:00:00","earliest_start_local":"15 Oct 2020 14:00:00","url":"https:\/\/bcbf20.ticketleap.com\/invest-in-your-greatest-asset---your-staff\/dates\/Oct-15-2020_at_0200PM","venue_street":"Wolverhampton Science Park","latest_start_local":"15 Oct 2020 14:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/751212f9-119c-45f2-9961-6c3529357efc\/hero.jpg","latitude":0,"latest_start_utc":"15 Oct 2020 13:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/751212f9-119c-45f2-9961-6c3529357efc\/full.jpg","name":"Invest in your greatest asset - Your staff","id":"d7931514-6a9c-11ea-aecf-22000a2be246","html_description":"<p>Richard Branson famously said - \"Train people well enough so they can leave, treat them well enough so they don't want to\". This interactive and informative workshop delves into the importance of investing in your staff, nurturing talent and encouraging progression within your organisation.  Information is also available on the funding available and practical advice on how to apply for and secure funding. The event is aimed at SMEs. Attendees will gain an understanding on why employee development is vital to your business.  Learn of the funding available to SMEs.<\/p>\n<p>Attendees will come away with an understanding on why it is important to invest in your staff, tools and techniques on how to improve employee engagement and information to take away with them on where they can get additional support. <\/p>\n<p><strong>Areas to address:<\/strong><\/p>\n<p>Your lovely Staff - Asset or cost?<br>Being good at your job - What does productivity really mean today?<br>Role and expertise - When does an employee have enough training?<br>Progression and value - Are you just training them to leave?<\/p>\n<p><strong>Speaker: <\/strong><\/p>\n<p>Mike Ryan, Tutor, Gecko Programmes<\/p>","longitude":0,"latest_end_local":"15 Oct 2020 16:00:00","earliest_end_local":"15 Oct 2020 16:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"15 Oct 2020 15:00:00","venue_postal_code":"WV10 9RU","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Wolverhampton"},{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Business Support & Comms."}]},{"name":"Date","options":[{"name":"15\/10\/20"}]}],"description":""},{"earliest_start_utc":"15 Oct 2020 13:00:00","slug":"show-me-the-money","venue_name":"Private","venue_city":"","latest_end_utc":"15 Oct 2020 15:00:00","earliest_start_local":"15 Oct 2020 14:00:00","url":"https:\/\/bcbf20.ticketleap.com\/show-me-the-money\/dates\/Oct-15-2020_at_0200PM","venue_street":"","latest_start_local":"15 Oct 2020 14:00:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/0b5fc589-a5cf-4348-adc3-9e2824324e4a\/hero.jpg","latitude":0,"latest_start_utc":"15 Oct 2020 13:00:00","performance_count":1,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/0b5fc589-a5cf-4348-adc3-9e2824324e4a\/full.jpg","name":"Show me the money ONLINE","id":"05049e4e-62e8-11ea-a92d-22000b228098","html_description":"<p>This seminar will look at payment on construction projects. Experts from Higgs’ Construction and Engineering team will explore what options are available to contractors and sub-contractors when they are faced with payment issues. The issues discussed will be applicable to construction projects of all sizes and will be useful to construction industry professionals, contractors and developers. The seminar will offer tangible practical advice on the position under construction contracts and how to get paid and limit losses in construction projects and will also refer to payment issues arising as a result of COVID 19.<\/p>\n<p><strong>Speakers:<\/strong><\/p>\n<p>Rachael Hobbis<\/p>\n<p>Adam Thompson<\/p>","longitude":0,"latest_end_local":"15 Oct 2020 16:00:00","earliest_end_local":"15 Oct 2020 16:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"15 Oct 2020 15:00:00","venue_postal_code":"","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Digital Event"}]},{"name":"Sector","options":[{"name":"Property & Construction"}]},{"name":"Date","options":[{"name":"15\/10\/20"}]}],"description":""},{"earliest_start_utc":"15 Oct 2020 16:30:00","slug":"the-national-foundry-training-centre-open-evening","venue_name":"ECMS National Foundry Training Centre","venue_city":"Tipton, Dudley","latest_end_utc":"15 Oct 2020 18:00:00","earliest_start_local":"15 Oct 2020 17:30:00","url":"https:\/\/bcbf20.ticketleap.com\/the-national-foundry-training-centre-open-evening\/dates\/Oct-15-2020_at_0530PM","venue_street":"Tipton Road","latest_start_local":"15 Oct 2020 17:30:00","venue_region_name":"","hero_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/3e32cd41-699e-4e74-a4d1-cf079bf6dc86\/hero.jpg","latitude":0,"latest_start_utc":"15 Oct 2020 16:30:00","performance_count":2,"hero_small_image_url":"https:\/\/ticketleap-media-master.s3.amazonaws.com\/3e32cd41-699e-4e74-a4d1-cf079bf6dc86\/full.jpg","name":"The National Foundry Training Centre Open Evening","id":"c0458334-5e0c-11ea-be07-22000b228098","html_description":"<p>Join Elite Centre for Manufacturing Skills for a tour of the UK’s only foundry training centre right here in the Black Country.  The event is aimed at manufacturing and engineering businesses with an interest in the foundry and metalforming industries.  ECMS will be showcasing the capabilities of the National Foundry Training Centre including cutting edge casting technologies, Sand Lab and Pattern Workshop. The facilities will also be available for research techniques and commercial usage.  Delegates will see the unique facilities now available through ECMS for specialist foundry training, commercial hire and research.<\/p>\n<p>Agenda: <\/p>\n<p>5:30pm - Snacks and Networking<br>5:50pm - Welcome and Introduction by ECMS<br>6:05pm - CMF Chairman Stuart Gregory - Introduction to Cast Metals Federation<br>6:15pm - Tour Begins - Foundry and Pattern shop , IT Suite and Sand\/Metal Lab<br>7:00pm - Q&amp;A Session<br> <br> <\/p>","longitude":0,"latest_end_local":"15 Oct 2020 19:00:00","earliest_end_local":"15 Oct 2020 19:00:00","hashtag_text":"","venue_timezone":"Europe\/London","earliest_end_utc":"15 Oct 2020 18:00:00","venue_postal_code":"DY4 7UW","venue_country_code":"GBR","performances":[],"categories":[{"name":"Location","options":[{"name":"Dudley"}]},{"name":"Sector","options":[{"name":"Advanced Manufacturing"}]},{"name":"Date","options":[{"name":"13\/10\/20"},{"name":"15\/10\/20"}]}],"description":""}]